{
    "statuses": {
        "Cursed": "If this isn't removed within three days, you will die.",
        "Frozen": "You can't use any abilities until you thaw out. 1/3 chance you'll thaw every day. Thaws out in 3 days if not thawed out.",
        "Paralyzed": "You have a 48 hour cooldown before you can use another ability and item. Permanent until cured.",
        "Burned": "Every 24 hours from when you're inflicted, you will lose an item from rarity descending. You cant pass items whilst burning Permanent until cured.",
        "Empowered": "You can use any one of your abilities for 2 days, even if you ran out of them. When you use an ability, it's a 12 hour cooldown before you can use another. Using a killing ability will make you lose Empowered on use.",
        "Drunk": "25% chance to target a random person instead when using an item or an ability. Wears off after 48 hours. This effect stacks.",
        "Restrained": "Cannot use abilities. If Restrained by the Gatekeeper, forced to use the abilities they use on you. Permanent until cured.",
        "Disabled": "You can't vote at the Elimination Phases. Permanent until cured.",
        "Blackmailed": "You can't talk for a day and you can't vote at that Elimination Phase. Removes after 24 hours.",
        "Despaired": "You always vote for yourself during an Elimination Phase.",
        "Lucky": "Your coins bonus is now x1.5 your regular coins bonus and your luck is doubled. Permanent until you gain a new status effect.",
        "Unlucky": "Your coins bonus is halved and your luck is halved. Permanent until you gain a new status effect."
    },
    "items": {
        "Cursed Shadow": {
            "rarity": "Common",
            "cost": 1000,
            "effect": "Inflict a player of your choice with Cursed."
        },
        "Ice Wand": {
            "rarity": "Common",
            "cost": 1000,
            "effect": "Inflict a player of your choice with Frozen."
        },
        "Lightning Staff": {
            "rarity": "Common",
            "cost": 1000,
            "effect": "Inflict a player of your choice with Paralyzed."
        },
        "Flint & Steel": {
            "rarity": "Common",
            "cost": 1000,
            "effect": "Inflict a player of your choice with Burned."
        },
        "Doggo Treat": {
            "rarity": "Common",
            "cost": 400,
            "effect": "If you feed your Doggo a treat, it will be more loyal and give more useful information more often. You can also consume it yourself which gives you 200 coins."
        },
        "Beer": {
            "rarity": "Common",
            "cost": 1000,
            "effect": "Inflict a player of your choice with Drunk."
        },
        "Seed": {
            "rarity": "Common",
            "cost": 500,
            "effect": "Plant a seed, every 36 hours you'll gain a 5% coin bonus for every seed planted. At 50%, fertilizers will not double the seed %, and instead give 5%."
        },
        "Money Bag": {
            "rarity": "Common",
            "cost": 0,
            "effect": "Gives you 500 coins."
        },
        "Role Scanner": {
            "rarity": "Common",
            "cost": 1000,
            "effect": "Receive seven roles your target could be, with one being their actual role. The other six roles are selected by how that player has been acting throughout the game."
        },
        "Status Scanner": {
            "rarity": "Common",
            "cost": 1000,
            "effect": "Tells you any and all status effects your target currently has."
        },
        "Immunity Scanner": {
            "rarity": "Common",
            "cost": 1500,
            "effect": "Tells you any and all immunities your target currently has."
        },
        "Tip": {
            "rarity": "Common",
            "cost": 200,
            "effect": "Gives you a relatively useful piece of information you may find useful."
        },
        "Hangover Pills": {
            "rarity": "Common",
            "cost": 750,
            "effect": "Removes one stack of the Drunk status effect on use."
        },
        "Cheque": {
            "rarity": "Common",
            "cost": 500,
            "effect": "Allows you to transfer coins to another player."
        },
        "Aura Veil": {
            "rarity": "Common",
            "cost": 1000,
            "effect": "Choose a negative status effect to become immune to. When inflicted or attempted to be inflicted with a negative status effect, this effect wears off."
        },
        "Decurse": {
            "rarity": "Uncommon",
            "cost": 750,
            "effect": "Removes the Cursed status effect on use."
        },
        "Thaw Claw": {
            "rarity": "Uncommon",
            "cost": 750,
            "effect": "Removes the Frozen status effect on use."
        },
        "Nerve Master": {
            "rarity": "Uncommon",
            "cost": 750,
            "effect": "Removes the Paralyzed status effect on use."
        },
        "Fertilizer": {
            "rarity": "Uncommon",
            "cost": 1500,
            "effect": "Double all seed giving % in alliance. If 0%, add 10%."
        },
        "Holy Water": {
            "rarity": "Uncommon",
            "cost": 750,
            "effect": "Removes the Burned status effect on use. Cannot be burnt."
        },
        "Jailbreaking Device": {
            "rarity": "Uncommon",
            "cost": 1000,
            "effect": "Removes the Disabled status effect on use."
        },
        "Lillie's Blood": {
            "rarity": "Uncommon",
            "cost": 1200,
            "effect": "Makes a person of choice immune to status effects for 2 days. Does not cure any current effects. Status effects on when in use, will not effect the target."
        },
        "Vortex Liquid": {
            "rarity": "Uncommon",
            "cost": 1000,
            "effect": "Makes you immune for a random upcoming Elimination phase."
        },
        "Iron Ball": {
            "rarity": "Uncommon",
            "cost": 0,
            "effect": "Does absolutely nothing but takes up an item slot and cannot be used. Removes after 48 hours."
        },
        "Down Syndromer": {
            "rarity": "Uncommon",
            "cost": 1200,
            "effect": "Inflict a player of your choice with Disabled for 24 hours."
        },
        "Imprisoning Key": {
            "rarity": "Uncommon",
            "cost": 1500,
            "effect": "Inflict a player of your choice with Restrained for 24 hours."
        },
        "Sad Story": {
            "rarity": "Uncommon",
            "cost": 1500,
            "effect": "Inflict a player of your choice with Despaired for 24 hours."
        },
        "Duct Tape": {
            "rarity": "Uncommon",
            "cost": 1800,
            "effect": "Inflict a player of your choice with Blackmailed."
        },
        "Catapult": {
            "rarity": "Uncommon",
            "cost": 2500,
            "effect": "Fire an item of choice at someone else - will destroy the item and an item of same rarity in their inventory, if not present, destroys the next closest tier item that is lower."
        },
        "Magnetic Cuffs": {
            "rarity": "Uncommon",
            "cost": 2500,
            "effect": "Select 2 people, they will now be forced to stay in the same alliance if already together, if not in the same alliance, they will be unable to join the same alliance. Can be removed with Jailbreaking device"
        },
        "Ankh": {
            "rarity": "Uncommon",
            "cost": 750,
            "effect": "Give yourself or someone else a spell of bad luck, giving them Unlucky."
        },
        "Four-Leaf Clover": {
            "rarity": "Uncommon",
            "cost": 750,
            "effect": "Give yourself or someone else immense luck, giving them Lucky."
        },
        "Scarlet Potion": {
            "rarity": "Uncommon",
            "cost": 1200,
            "effect": "Make somebody immune to a status effect of your choice. If they're already immune to that status effect, they lose it instead. If you use it on yourself, you will kill yourself, but still become immune to a status effect of your choice."
        },
        "Freedom Ring": {
            "rarity": "Rare",
            "cost": 1000,
            "effect": "Removes the Restrained status effect on use."
        },
        "Magic Mirror": {
            "rarity": "Rare",
            "cost": 1200,
            "effect": "Choose a negative status effect. Next time you're inflicted by that status you will reflect it back upon the inflictor."
        },
        "Hope Antenna": {
            "rarity": "Rare",
            "cost": 1000,
            "effect": "Removes the Despaired status effect on use."
        },
        "Energiser": {
            "rarity": "Rare",
            "cost": 3200,
            "effect": "Allow one extra use for any one of yourself or an ally's non-killing abilities."
        },
        "Doggo": {
            "rarity": "Rare",
            "cost": 2000,
            "effect": "Gives you a pet doggo which gives you useless information. The more you feed it, the more useful it becomes. Can be released which gives 500 coins on release."
        },
        "Light Eye": {
            "rarity": "Rare",
            "cost": 0,
            "effect": "Publicly shows who voted for who and what voting perks were used excluding immunities."
        },
        "Unreliable Wish": {
            "rarity": "Rare",
            "cost": 0,
            "effect": "Gain a random AA ability upon use."
        },
        "Storage Box": {
            "rarity": "Rare",
            "cost": 2400,
            "effect": "Gain +1 item count, this item does not count as an item slot."
        },
        "Liquid Nitrogen Grenade": {
            "rarity": "Rare",
            "cost": 2500,
            "effect": "Gives your target and any of their alliance members Frozen."
        },
        "Shock Grenade": {
            "rarity": "Rare",
            "cost": 2500,
            "effect": "Gives your target and any of their alliance members Paralyzed."
        },
        "Incendiary Grenade": {
            "rarity": "Rare",
            "cost": 2500,
            "effect": "Gives your target and any of their alliance members Burned."
        },
        "Cannon": {
            "rarity": "Rare",
            "cost": 2500,
            "effect": "Can fire Iron & Steel Balls & 6 Point Bombs into other players inventories. If their inventory is full, destroys the highest tier item and takes its place. Upon having this, can buy Iron Balls for 750 coins and Steel Balls for 1500 coins."
        },
        "Steel Ball": {
            "rarity": "Rare",
            "cost": 0,
            "effect": "Does absolutely nothing but takes up an item slot and cannot be used. Cannot be removed unless stolen or burned."
        },
        "Seed Gun": {
            "rarity": "Rare",
            "cost": 1000,
            "effect": "Fire a seed you have at someone of choice, reducing target coin % by double what the seed is giving you for 36 hours. Can go under 0%. If held, can buy seeds that can only be used to fire with for 250 coins."
        },
        "Cursed Relic": {
            "rarity": "Rare",
            "cost": 2500,
            "effect": "Gives your target and any of their alliance members Cursed."
        },
        "Depower": {
            "rarity": "Epic",
            "cost": 2000,
            "effect": "Removes the Empowered status effect on use. When held, it notifies you every time someone becomes Empowered."
        },
        "Immunity Card": {
            "rarity": "Epic",
            "cost": 0,
            "effect": "Makes you immune for a Elimination phase on use."
        },
        "Fake Card": {
            "rarity": "Epic",
            "cost": 2500,
            "effect": "Allows you to vote twice for a Elimination phase when used."
        },
        "Awful Orb": {
            "rarity": "Epic",
            "cost": 0,
            "effect": "Inflict a player of your choice with any negative status effect."
        },
        "Spirit Cage": {
            "rarity": "Epic",
            "cost": 7500,
            "effect": "Inflict a player of your choice with a special Cursed which can only be cured by Bless."
        },
        "Dark Eye": {
            "rarity": "Epic",
            "cost": 0,
            "effect": "Publicly shows the exact role of a player to everyone, cannot be used on yourself."
        },
        "Six Point Bomb": {
            "rarity": "Epic",
            "cost": 4000,
            "effect": "A bomb with six numbered switches. Whoever is in possession of the bomb has to pull a switch within 24 hours or explode. Once they pulled one they can pass the bomb to another player. One of the switches will blow it up, killing the holder."
        },
        "Military Vest": {
            "rarity": "Epic",
            "cost": 3600,
            "effect": "On use, makes you survive a lethal attack."
        },
        "Beer Barrel": {
            "rarity": "Epic",
            "cost": 2000,
            "effect": "Gives your target and any of their alliance members Drunk."
        },
        "Velvet Glove": {
            "rarity": "Epic",
            "cost": 4000,
            "effect": "Pick a player, you will see their inventory and will steal an item of your choice from them"
        },
        "Roulette Wheel": {
            "rarity": "Epic",
            "cost": 0,
            "effect": "When this item is used, there is multiple results that can occur:\n1/10 - You gain an extra ability charge of choice\n2/10 - Nothing Happens\n1/10 - Your Inventory is destroyed\n1/10 - You kill yourself\n1/10 - You gain 2500 coins\n1/10 - You get a random item\n1/10 - You and someone else of choice become Disabled\n1/10 - You get to shoot another player\n1/10 - You gain a random AA Ability"
        },
        "Polymorph": {
            "rarity": "Legendary",
            "cost": 0,
            "effect": "Transform into a random role which isn't currently in the game."
        },
        "Platinum Crown": {
            "rarity": "Legendary",
            "cost": 6200,
            "effect": "Inflict a player of your choice with Empowered."
        },
        "Rebound Card": {
            "rarity": "Legendary",
            "cost": 0,
            "effect": "If you are to be eliminated at next Elimination, you may instead choose eliminate someone of choice. If successful, you survive."
        },
        "Gold Card": {
            "rarity": "Legendary",
            "cost": 3500,
            "effect": "Allows you to vote three times for a Elimination phase when used."
        },
        "Danger Zone": {
            "rarity": "Legendary",
            "cost": 4500,
            "effect": "Your target and their allies will have their votes doubled on them next Elimination."
        },
        "Dusk Eye": {
            "rarity": "Legendary",
            "cost": 0,
            "effect": "Publicly shows who visited who within the time after the previous Elimination. Doesn't show self-visits."
        },
        "Reliable Wish": {
            "rarity": "Legendary",
            "cost": 0,
            "effect": "On use, get an Any Ability of your choice."
        },
        "Russian Revolver": {
            "rarity": "Legendary",
            "cost": 4500,
            "effect": "A crazy gun that you can attempt to shoot someone with. 1/6 chance to kill the holder, 1/6 chance to kill your target, 2/6 chance to miss and lose the item, 2/6 chance for nothing to happen."
        },
        "Flamethrower": {
            "rarity": "Legendary",
            "cost": 4000,
            "effect": "Completely destroys the inventory of a player of your choice and gives them Burned."
        },
        "Excalibur": {
            "rarity": "Mythical",
            "cost": 0,
            "effect": "This item will kill; bypassing protection when used on somebody. If both players have Excalibur, it will be an epic Duel to the death"
        },
        "Doggo v2": {
            "rarity": "Mythical",
            "cost": 0,
            "effect": "This mythical doggo will tell you accurate information twice a day!"
        },
        "Magic Triangle": {
            "rarity": "Mythical",
            "cost": 0,
            "effect": "You and two other players of your choice get +50% coins value and a better chance of getting more and better items during an Item Rain. The more items effect is reversing item drop chance. 1 item is 1/6, 2 is 2/6 and 3 is 3/6."
        },
        "Angel Wings": {
            "rarity": "Mythical",
            "cost": 0,
            "effect": "On use, cures you and any of your alliance members of ANY negative status effect if they have them, for every negative status effect you cure, you gain an Unreliable Wish, if you cure at least three which may include yourself, you get an additional Reliable Wish."
        },
        "Dawn Eye": {
            "rarity": "Mythical",
            "cost": 0,
            "effect": "On use, publicly reveals to everyone all of the alliances and group chats. The holder may also peek at one of these and see all of the chats contents."
        },
        "Hellforge": {
            "rarity": "Mythical",
            "cost": 0,
            "effect": "Sacrifice an item into the hellforge. Common worth 1 point going up 1 per rarity, with mythical as 6. At 200% of an items value, you can create one of that kind. Max 2 mythical, 3 legendary and 4 epic. RW and 6PB take up 2 creation slots. Hellforge takes different times to melt items down. Common - 9 hours. -2 hours every rarity up, with mythical being 0."
        },
        "Lucky Charm": {
            "rarity": "Mythical",
            "cost": 0,
            "effect": "As long as this item is in your inventory, you will know exactly what your luck is, and it will be +3 of that. You will be guaranteed at least +1 more items in an item rain making maxing out at 4. If this charm is stolen you will know who did it. This item does not count towards your inventory space, but can be stolen / burned."
        },
        "Wishing Star": {
            "rarity": "Mythical",
            "cost": 0,
            "effect": "Choose 3 people including yourself, you will all receive at least a rare and another random AA. Along with this, you will be able to gain an extra AA every power drop from time of use."
        },
        "Lucky Coin": {
            "rarity": "Unique",
            "cost": 0,
            "effect": "Someone receives this from their Care Package, increasing their Luck value by 4 when holding. You may pass this item to someone else and have to pass it to someone else when you die. If you're killed, the killer gets the item."
        },
        "Voodoo Doll": {
            "rarity": "Unique",
            "cost": 0,
            "effect": "While this item is in your in your inventory, anything that happens to you will also happen to the player this is a doll of, aside from receiving votes and being eliminated."
        }
    },


    "classes": {
        "Agent": {
            "alignment": "Good",
            "description": "Your whole life, you've been watching others. Your scouting skills have stayed intact and led you to prepare for a life-threatening moment like this.",
            "abilities": {
                "Follow": {
                    "charges": 3,
                    "rarity": "Common",
                    "effect": "You will know everything your target does and who to for 24 hours from use. Does not include perk-based actions."
                },
                "Spy": {
                    "charges": 3,
                    "rarity": "Common",
                    "effect": "You will know everything that happens to your target and who die it 24 hours from use."
                },
                "Hidden": {
                    "charges": 2,
                    "rarity": "Uncommon",
                    "effect": "For 24 hours on use, anything done on you will be reflected back to the user."
                }
            },
            "perks": {
                "Hawkeye": "If someone steals from you, you will know who did it.",
                "Organised": "Your vote cannot be stolen, blocked or tampered with in any way.",
                "Tracker": "If anyone in your alliance does a positive action to someone outside of your alliance, you will know who gave who, but not what it was."
            },
            "achievements": {
                "Master Agent": "Obtain all Agent achievements.",
                "Pro Hider": "Successfully reflect 4 actions with Hidden.",
                "Stalker": "Follow 1 person 3 times.",
                "Observer": "Spy 1 person 3 times."
            }
        },
        "Analyst": {
            "alignment": "Good",
            "description": "You're a street smart people person, capable of using signs and signals to see past the surface. You might just be the smartest there ever was, or at least you think so.",
            "abilities": {
                "Chemistry": {
                    "charges": 3,
                    "rarity": "Uncommon",
                    "effect": "Select two people, if they share an alliance, you will be told, and can select another person, this loops."
                },
                "Vibe Check": {
                    "charges": 5,
                    "rarity": "Common",
                    "effect": "Select 2 people, you will know if they are the same alignment. You cannot select the same person more than twice."
                },
                "Subtraction": {
                    "charges": 3,
                    "rarity": "Uncommon",
                    "effect": "Select someone, view their alliance's items. These items will be shown combined with each other. You also find out about any inventory affecting effects on the player you chose."
                },
                "Inspection Zone": {
                    "charges": 1,
                    "rarity": "Uncommon",
                    "effect": "Upon use, you will know everything to effect you within the next 24 hours, and who did it. If someone tries to attack you, you will dodge it. If someone tries to inflict you with a negative status, it will reflect back onto them."
                }
            },
            "perks": {
                "Face Reader": "If an ally gains information feedback from anything that they use, you will be told the information as well.",
                "That Much Smarter": "Information items can be upgraded freely by you, or, have 2 uses. Info aas can be upgraded by you as well.",
                "X-Ray Vision": "Any form of investigation done by you cannot be effected by perks or abilities, assuming the target is vistable."
            },
            "achievements": {
                "Master Analyst": "Obtain all Analyst achievements.",
                "Full View": "Use Subtraction to see a legendary+ item or a full inventory.",
                "Well Connected": "Use chemistry five times with one charge.",
                "Inspected": "View atleast 3 visits via inspection zone."
            }
        },
        "Biker": {
            "alignment": "Good",
            "description": "Apparently nobody else in this damn game owns a vehicle, all you want is the wind in your hair though. Who cares if a few people get run over?",
            "abilities": {
                "Burning Rubber": {
                    "charges": 4,
                    "rarity": "Rare",
                    "effect": "Target somebody, either: Clear all negative statuses on them, and everybody who visits them negatively or neutrally for the next 24 hours will be burned with an 8 hour burn OR burn them with an 8 hour burn, and everybody who visits them positively within the next 24 hours will also burn with an 8 hour burn."
                },
                "Stick With the Pack": {
                    "charges": 1,
                    "rarity": "Epic",
                    "effect": "Target an ally, inflicting them with Rev Up permanently. This can't be empowered or energized."
                },
                "Lunch Break": {
                    "charges": 1,
                    "rarity": "Uncommon",
                    "effect": "Disable Rev Up, Rider of the Storm, and all uses of Burning Rubber for 48 hours, to gain 24 hours of death immunity and Elim immunity."
                }
            },
            "perks": {
                "Motor Gang": "Your alignment is counted as the same as the majority of your alliance for the purpose of alliance benefits. As long as your alliance is 4+, your vote counts as 2. Every good within your alliance gains an additional +1 luck, as well as yourself.",
                "Rider of the Storm": "As long as you remain in an alliance with at least 1 other player, you gain immunity to paralysis, burn, frozen, and your ability usage can't be blocked.",
                "Rev Up": "All timed statuses and abilities happen in half the time for you, not including curse, burn, paralysis, or mass game effects.",
                "Full-Throttle Slam": "If an ally is attacked - regardless of if it kills them, ram the killer with your bike, inflicting blackmail and paralysis - you find out who they are and their role."
            },
            "achievements": {
                "Master Biker": "Obtain all Biker achievements."
            }
        },
        "Cerberus": {
            "alignment": "Good",
            "description": "A demon tasked with protecting the gates of hell, having followed the overlord, takes up protecting others as its main task.",
            "abilities": {
                "Fire Guard": {
                    "charges": 2,
                    "rarity": "Epic",
                    "effect": "Select someone, for 24 hours you will know any negative visits to the person, and can decide to reverse each effect, burn the visitor, or do nothing at all. This includes all negatives such as death other than elimination."
                },
                "Ethereal Healing": {
                    "charges": 2,
                    "rarity": "Epic",
                    "effect": "Select 2 people, removing all negatives from the first and putting them on the second, and removing all positives from the second onto the first. You can select dead people."
                },
                "Lava Wall": {
                    "charges": 2,
                    "rarity": "Rare",
                    "effect": "When used, if someone in your alliance is visited within the next 24 hours, burns the visitor and destroys their lowest tier item. The visitor fails if already burning, but still has an item destroyed."
                }
            },
            "perks": {
                "Spare Heads": "Survive 2 attacks, burning the attacker in both of these instances.",
                "Hades' Hound": "Immune to Frozen and Burned.",
                "Ash Formation": "Any items you cause to be burnt away, you gain. This includes Lava Walls item destruction."
            },
            "achievements": {
                "Master Cerberus": "Obtain all Cerberus achievements.",
                "Underworld's Guard": "Successfully save allies from 5 negatives via Fire Guard, or undo 1 death from it.",
                "Ethereal Sight": "Successfully use Ethereal Healing to swap 4 positives/negatives.",
                "Ashes to Riches": "Gain 3 items via Ash Formation."
            }
        },
        "Detective": {
            "alignment": "Good",
            "description": "Your life revolves around finding information and using it to your advantage, and that's what you plan to do.",
            "abilities": {
                "Search": {
                    "charges": 5,
                    "rarity": "Common",
                    "effect": "Find out what type of action your target most recently did (investigative, killing, healing etc) and the player they used it on."
                },
                "Interrogate": {
                    "charges": 2,
                    "rarity": "Uncommon",
                    "effect": "You're given 2 possible roles that the person you select could be, one is a random false role and the other is their actual role."
                },
                "Solve": {
                    "charges": 2,
                    "rarity": "Uncommon",
                    "effect": "Figure out any piece of information of your choice about a player. Gain a charge for this every even day if you are Detective."
                }
            },
            "perks": {
                "Clever": "Immune to Blackmailed, Disabled and Despaired.",
                "Self-Defence": "If anyone tries to attack you, they will fail and you will give them Blackmailed. Additionally, you find out their name & role."
            },
            "achievements": {
                "Master Detective": "Obtain all Detective achievements.",
                "Underworld's Guard": "Have someone attack you and fail.",
                "Ethereal Sight": "Interrogate 3 different people from 3 different factions.",
                "Ashes to Riches": "Use Solve 10 times in a game."
            }
        },
        "Fisherman": {
            "alignment": "Good",
            "description": "You're a relaxed, level-handed guy who just likes to catch fish, so much that you can use your fishing skills for various other things.",
            "abilities": {
                "Reel": {
                    "charges": 2,
                    "rarity": "Uncommon",
                    "effect": "Select a person - steal their most recent item - if they are opposite your alignment, you will see their inventory and can choose what item to steal."
                },
                "Fishing Trip": {
                    "charges": 2,
                    "rarity": "Rare",
                    "effect": "You receive a random common item or AA (you choose which). The more times you use Fishing Trip the higher the rarity of item/AA you will get. Upon mythical loop to common."
                },
                "Hooked": {
                    "charges": 2,
                    "rarity": "Epic",
                    "effect": "For 24hrs, any items/AAs your target gives or receives, you'll take instead."
                },
                "Bait": {
                    "charges": 1,
                    "rarity": "Legendary",
                    "effect": "Select someone: For 24 hours any action (excluding votes) people use on another player (excluding you & the target) will redirect towards the target. If the user or the target dies, this ability stops."
                }
            },
            "perks": {
                "Fishing Buddies": "For every 2 Allies of the same alignment you have, gain an extra item during item rains.",
                "Barrels": "You get an extra 4 inventory spaces."
            },
            "achievements": {
                "Master Fisherman": "Obtain all Fisherman achievements.",
                "Gone Fishin'": "Obtain a legendary item/AA with Fishing Trip.",
                "Good Haul": "Steal an epic or higher item/AA.",
                "The Loch-Ness Monster": "Redirect an attack using Bait, or 6 visits."
            }
        },
        "Gunman": {
            "alignment": "Good",
            "description": "You want to stop evil and prove yourself worthy, that is your only goal. You only have one shot at life, literally. Make sure it's worth it or it will really haunt you.",
            "abilities": {
                "Fire": {
                    "charges": 1,
                    "rarity": "Not an Any Ability",
                    "effect": "Shoot a player. If you kill someone who is your alignment, you will commit suicide."
                }
            },
            "perks": {
                "Confidence": "Once you've shot someone not your alignment, you become immune to negative status effects.",
                "Ignorant": "Cannot be redirected to another target when you attack somebody.",
                "Justice's Gift": "If you kill someone in the opposite alignment, you will obtain an Unreliable Wish and any AAs, items and money they had."
            },
            "achievements": {
                "Master Gunman": "Obtain all Gunman achievements.",
                "Demon Slayer": "Shoot an evil.",
                "Trigger Happy": "Shoot 2 people successfully.",
                "Dictator": "Shoot someone who has voted you multiple times (more then twice)."
            }
        },
        "Hero": {
            "alignment": "Good",
            "description": "Your ambition was always to do something magnificent and brave. It's always what you wanted to do, and you will try as hard as you can to achieve that goal.",
            "abilities": {
                "Venture": {
                    "charges": 9,
                    "rarity": "Common",
                    "effect": "Find out if a player is good or not."
                },
                "Mentor": {
                    "charges": 1,
                    "rarity": "Epic",
                    "effect": "Learn an alliance members role and learn one charge of an ability of theirs of your choice. Fails if your target is not the same alignment as you."
                },
                "Protection": {
                    "charges": 3,
                    "rarity": "Uncommon",
                    "effect": "Make an alliance member completely immune to death including eliminations for 24 hours. If Hero, you can gift a charge of this as an AA to others. Cant self pick."
                }
            },
            "perks": {
                "Heroic Power": "You get x1.25 higher Immunity Card chances and +3 Luck if everyone in your alliance is not the opposite alignment.",
                "Legion": "You may have 1 additional person in your alliance, should you choose to allow it.",
                "Guilded": "Every immunity card you get, increase the immunity card chances by 2.5%. This is added after other chance effects. Hero can get bonuses in an alliance alone."
            },
            "achievements": {
                "Master Hero": "Obtain all Hero achievements.",
                "Uniquely Taught": "Successfully use Mentor on a non AA.",
                "Good Doers": "Find 9 good people or find all good people in the game.",
                "Legendary Protector": "Save 3 people using protection."
            }
        },
        "Hydra": {
            "alignment": "Good",
            "description": "A multi-headed beast out on a quest to redeem itself for a place with God.",
            "abilities": {
                "Head Slam": {
                    "charges": 0,
                    "rarity": "Rare",
                    "effect": "Select someone, destroy their lowest tier item and inflicting a negative status you are immune to of choice. Must cycle through all immunities before re-inflicting the same again."
                },
                "Chomp": {
                    "charges": 0,
                    "rarity": "Uncommon",
                    "effect": "Select someone; they will be unable to perform actions to people other than their current alliance members for 12h. If not in an alliance, they will be unable to join one for 12h. Can stack."
                },
                "Tear-Out": {
                    "charges": 0,
                    "rarity": "Rare",
                    "effect": "Select someone, dragging them out of their alliance. Inflict a negative status of choice you are not immune to. Must cycle through all non-immunities before re-inflicting the same again."
                },
                "Head-Shield": {
                    "charges": 0,
                    "rarity": "Epic",
                    "effect": "Select as many players as things you are immune to. If 0, pick 1. Negative actions on them will fail to work, the person using it will keep the charge but be unable to vote or act for 6h. Neutral visits will inform you and the target what occured and who did it. Lasts 8h. Can stack. You can bypass this. You can only gain max 2 charges of this per day."
                },
                "Visceral Roar": {
                    "charges": 0,
                    "rarity": "Epic",
                    "effect": "Select someone, they will pick as many negative statuses they want and will gain vote power equal. Will be inflicted with them all post-elim. Selecting immunities will remove immunities."
                }
            },
             "perks": {
                "Regenerative": "If inflicted with a negative status, gain immunity to it after its cured/worn off. If attacked and survived, blocked, or redirected, develop immunity to that interaction - all immunities develop on day end.",
                "Multi-Headed Stare-Down": "If you perform multiple actions, you can have them all register as a single visit, even to multiple people. Your action will register as the most convenient type.",
                "Rejuvenative Aura": "Allies that get cured of a status will develop immunity to it. You may turn this off/on, and may pick which allies gain this.",
                "Head Growing": "Each time you [or ally] gain an immunity, and/or a new day starts, gain a base ability charge [Max 5 per day from immunities]."
             },
             "achievements": {
                "Master Hydra": "Obtain all Hydra achievements."
             }
        },
        "Judge": {
            "alignment": "Good",
            "description": "You want the world to be a utopia, where it's free of crime, poverty and hatred. You want the evils gone, but if you fail you will gradually weaken yourself.",
            "abilities": {
                "Lawful": {
                    "charges": 1,
                    "rarity": "Epic",
                    "effect": "Changes the day to have two eliminations. Your votes count as 2 for both of them. You become immune to elimination for both. Must be used atleast 12 hours before elimination for full effect. If used past that, double elimination and vote of 2 does not occur, but immunity does."
                },
                "Overrule": {
                    "charges": 2,
                    "rarity": "Epic",
                    "effect": "Remove 1 elimination immunities from a player for the upcoming elimination. If none, counts as -1 immunity."
                },
                "The Hammer": {
                    "charges": 1,
                    "rarity": "Rare",
                    "effect": "Use this to completely stop the upcoming elimination phase when the time comes."
                }
            },
            "perks": {
                "Justice": "If both people eliminated during the Lawful trial are not your alignment then you gain a random Epic-Mythical tier item.",
                "Dystopia": "If both of the people eliminated are your alignment during the Lawful trial then your abilities and alignment AA's are disabled, and you get Despaired."
            },
            "achievements": {
                "Master Judge": "Obtain all Judge achievements.",
                "Hammer Time": "Save a member of your alliance with The Hammer.",
                "Bypasser": "Bypass 2 lots of immunities with overrules.",
                "Court's Master": "Gain the Justice perk."
            }
        },
        "Manager": {
            "alignment": "Good",
            "description": "You're experienced at organization and managing people and will do whatever it takes to create the perfect alliance.",
            "abilities": {
                "Kick": {
                    "charges": 4,
                    "rarity": "Uncommon",
                    "effect": "1 charge - Kick someone from your alliance. - 2 charges - select someone, you will kick them if they are in any alliances. Kicked players lose 25% of their total coins which is evenly spread throughout your alliance and your personal luck goes up by 1. Kicked people cannot re-join their alliance for 36 hours. Dying will stop any active kicks."
                },
                "Contract": {
                    "charges": 2,
                    "rarity": "Uncommon",
                    "effect": "Give an ally +25% coins value. If they are your alignment, gain +25% for yourself too."
                },
                "Discount": {
                    "charges": 4,
                    "rarity": "Uncommon",
                    "effect": "Give yourself or an ally a 50% reduced price on every buyable item until you/they buy one. Does not stack to get more reduction."
                },
                "Ban": {
                    "charges": 1,
                    "rarity": "Legendary",
                    "effect": "Ban all members from a targets alliance if they're in one. They cannot join any alliance nor make one for 36 hours, they cannot be in an alliance with any of the members they got banned from for 72 hours. If you die the ban goes off."
                }
            },
            "perks": {
                "Tradesman": "Your luck goes up by 1 every time you receive an item from a player and down by 1 when you give an item.",
                "Money Transfer": "Allows you to transfer an amount of coins to anyone within your alliance. Anyone in the Manager's alliance can also transfer money to allies. Manager can turn this on or off."
            },
            "achievements": {
                "Master Manager": "Obtain all Manager achievements.",
                "Client": "Contract the same person twice.",
                "Clearing Price": "Discount an item 4 times.",
                "Removal": "Kick 3 people."
            }
        },
        "Mecha": {
            "alignment": "Good",
            "description": "You are a defensive robotic machine that takes pleasure in military and undercover procedures.",
            "abilities": {
                "Entrapment": {
                    "charges": 2,
                    "rarity": "Rare",
                    "effect": "Select someone, if they attempt to harm you within the next 18 hours, evade it and inflict the harm back on them, along with gaining a charge/item of whatever they used."
                },
                "Target Fire": {
                    "charges": 1,
                    "rarity": "Epic",
                    "effect": "Select 2 people, if one harms the other within the next 36 hours, both get hit by it 3 fold. This only works on 6 Point Bombs once."
                },
                "Smoke Grenade": {
                    "charges": 2,
                    "rarity": "Rare",
                    "effect": "Select someone, if they attempt to harm anyone within your alliance within the next 24 hours, cause it to fail, and give them drunk 3 stack, burned and cursed."
                },
                "Last Resort": {
                    "charges": 1,
                    "rarity": "Epic",
                    "effect": "Select someone, they cannot be eliminated at next elimination. If saved from elimination, all voters on the target will become paralyzed."
                }
            },
            "perks": {
                "Enhanced Learning": "Each time your base abilities are successfully used, gain 1 luck and 5% coins.",
                "Lock On": "Redirection on you fail, and simply inflict the redirector with the ability/item as well."
            },
            "achievements": {
                "Master Mecha": "Obtain all Mecha achievements.",
                "It's a trap!": "Successfully trigger Entrapment five times.",
                "Now you see me...": "Use smoke grenade to protect an ally three times.",
                "Final Gambit": "Successfully use Last Resort."
            }
        },
        "Medium": {
            "alignment": "Good",
            "description": "You're a quiet, passionate and lonely soul who has the ability to talk to the dead.",
            "abilities": {
                "Bury Alive": {
                    "charges": 2,
                    "rarity": "Rare",
                    "effect": "Bury someone for 24 hours, making them count as dead and finding out their role. They cannot act outside of what they could do when dead, except talk. Abilities that work on dead players will now work on your targets."
                },
                "Preserve": {
                    "charges": 2,
                    "rarity": "Uncommon",
                    "effect": "If someone died, within 24 hours of the death you can use this on them to make them their body survive for 24 more hours. If they have heal, ethereal heal, break, saving grace, protection or blessed within that time they will come back to life, if not, you take any money they have on them."
                },
                "Soul Seer": {
                    "charges": "inf",
                    "rarity": "Uncommon",
                    "effect": "Select a player, upon their death, you can see their role, their items, money and their last actions. You gain a charge upon the selected player dying. If used on yourself and you die, you may continue to make chats with the living."
                }
            },
            "perks": {
                "Service": "If you save anyone with Preserve, they cannot vote you for the rest of the game.",
                "Haunted Tombstone": "Cut a player of your choices coins in half when you're eliminated, you choose who gets the coins.",
                "Spiritual": "You can open chats with the dead, allowing communication."
            },
            "achievements": {
                "Master Medium": "Obtain all Medium achievements.",
                "Preservation": "Gain 1000 coins or revive someone via preserve.",
                "Death Data": "Use Soul seer on 4 people.",
                "Living Line Blue": "Bury someone alive, saving them from elimination, or getting a dead-only ability used on them."
            }
        },
        "Nurse": {
            "alignment": "Good",
            "description": "Your only desire in life is to heal others and help the ones you need to survive yourself.",
            "abilities": {
                "Heal": {
                    "charges": 3,
                    "rarity": "Uncommon",
                    "effect": "Heal your target from the next fatal effect that happens to them aside from being eliminated."
                },
                "Vaccinate": {
                    "charges": 3,
                    "rarity": "Uncommon",
                    "effect": "Your target becomes immune to a status effect of your choice."
                },
                "Cure": {
                    "charges": 3,
                    "rarity": "Uncommon",
                    "effect": "Cures your target of any status effect[s] of your choice."
                }
            },
            "perks": {
                "Powerful Immunity": "Immune to negative status effects.",
                "Medical Bills": "You may charge your target an amount of coins when using any of your abilities on somebody. If they refuse the bills, you will get your ability charge back."
            },
            "achievements": {
                "Master Nurse": "Obtain all Nurse achievements.",
                "Head Doctor": "Save someone from an attack successfully 3 times.",
                "Autism Go!": "Vaccinate 1 person three times.",
                "Private Healthcare": "Earn 1500 coins or more from Medical Bills."
            }
        },
        "Seraph": {
            "alignment": "Good",
            "description": "You believe yourself to be a higher angel incarnated in physical form, here to show sinners the correct path.",
            "abilities": {
                "Purification": {
                    "charges": 2,
                    "rarity": "Uncommon",
                    "effect": "Select someone, all negative statues on them are inflicted back on the original users."
                },
                "Ascend": {
                    "charges": 2,
                    "rarity": "Uncommon",
                    "effect": "Soar into the air, and see who visits yourself and allies for the next 12 hours. You will avoid negatives while this is active."
                },
                "Holy Light": {
                    "charges": 2,
                    "rarity": "Uncommon",
                    "effect": " Select someone, returning any positives lost within the previous 18 hours. If they hadn't lost any positives, the next positive performed by them and done to them is 2 fold."
                }
            },
            "perks": {
                "Cleansing Aura": "Negative statuses on yourself and allies are degraded to not be as effective.",
                "Angelic": "Positives inflicted by you on others will reward you with 200 coins. Positives inflicted on you will reward the inflictor with 100 coins, provided its not you.",
                "Golden Thread": "If you are killed, your death is delayed by 24 hours. Any sort of death protection within this state will stop the death from occurring. Elimination death is not included, unless it was via soul-bind."
            },
            "achievements": {
                "Master Seraph": "Obtain all Seraph achievements.",
                "Angelic Clearing": "Inflict / remove 3 statuses using purification.",
                "Above it all": "Avoid 2 negatives using ascend.",
                "Holy Blessings": "Regain a positive using Holy Light."
            }
        },
        "Terminal": {
            "alignment": "Good",
            "description": "Once one of the greats, your time is nearing, power dwindling due to the falling of others, but you wont give up just yet.",
            "abilities": {
                "Emotional Surge": {
                    "charges": 1,
                    "rarity": "Not an Any Ability",
                    "effect": "Inflict someone of choice with statuses that you have lost immunity to."
                },
                "Final Swing": {
                    "charges": 1,
                    "rarity": "Not an Any Ability",
                    "effect": "Cannot be empowered or energized. While having less than or equal to 3 regrets, you can disable someone's perks and abilities until you die. If you have 4 or more, you can disable someone's perks or abilities until you die. Using this will add 3 regrets."
                },
                "Saving Grace": {
                    "charges": 3,
                    "rarity": "Not an Any Ability",
                    "effect": "Select someone, saving them from elimination and negative effects for the next 24 hours. If they are not the most voted at elimination, gain a regret. If you de-activate this, you gain a non-negative removing version to use."
                },
                "Body Shield": {
                    "charges": 1,
                    "rarity": "Not an Any Ability",
                    "effect": "Select someone, if they are attacked, they survive, however, you lose an active perk of choice; but also lose 3 regrets. Cannot remove Hourglass of life or be self-used unless reflected/redirected."
                }
            },
            "perks": {
                "Hourglass of Life": "Every time an ally dies, or you're alone for an elimination, gain 1 regret.",
                "Heartbeats": "Immune to all negative statuses, but every time you gain a regret, lose an immunity of choice.",
                "Spiritual Remains": "While without regrets, your vote power is 3.",
                "Shaking Hands": "While having less than 3 regrets, you cannot be redirected.",
                "Shallow Breaths": "While with less than 4 regrets, if an ally or yourself is attacked, you can choose to kill the attacker, or stop them, paralysing and despairing them. Killing them will add a regret to yourself, but not killing them will remove a regret from yourself.",
                "Level Headed": "While with less than 6 regrets, you will remove a negative status from yourself or an ally of choice every day."
            },
            "achievements": {
                "Master Terminal": "Obtain all Terminal achievements.",
                "Cleared": "Remove a total of 5+ statuses due to level-headed.",
                "Guardian Angel": "Have saving grace succeed 3 times.",
                "Breath-taking": "Save an ally with shallow breaths."
            }
        },
        "Time Traveller": {
            "alignment": "Good",
            "description": "You have mastered the element of time, you know it's entire construct and can control it as much as you want.",
            "abilities": {
            "Double Time": {
                "charges": 1,
                "rarity": "Not an Any Ability",
                "effect": "Everyone in your alliance will have their next ability happen twice, or if it involves time, either twice as fast or twice as long (refer to ECO). Double time won't work on double time."
            },
            "Rewind": {
                "charges": 2,
                "rarity": "Rare",
                "effect": "Select someone, any statuses they had and items they used in the past 24 hours, they regain. Cannot use on same person within 24 hours - Global Cooldown"
            },
            "Loop": {
                "charges": 1,
                "rarity": "Not an Any Ability",
                "effect": "Select someone - Any negative abilities or item effects that have effected them within the past 24 hours and the next 24 hours, will effect them again, every 24 hours, 3 times."
            }
            },
            "perks": {
            "Timelines": "You can choose with up to a 12 hour delay, when a status placed on you begins effecting you.",
            "Time Zoned": "If your ability is reflected back onto you, or fails, you can re-use it."
            },
            "achievements": {
            "Master Time Traveller": "Obtain all Time Traveller achievements.",
            "Double Trouble": "Double 3 allies actions.",
            "Redone": "Use rewind to re-gain 4 items.",
            "Noose Loop": "Loop someone's negative statuses for the full time successfully."
            }
        },
        "Undercover": {
            "alignment": "Good",
            "description": "You want to stay a secret to everyone, if you get exposed to what you really are, then the future will not be bright for you.",
            "abilities": {
            "Black Cloak": {
                "charges": 7,
                "rarity": "Common",
                "effect": "Next time someone visits you, they get redirected to a target of your choice."
            },
            "Deduct": {
                "charges": "inf",
                "rarity": "Uncommon",
                "effect": "Find the exact role of a player of your choice, has a 24 hour cooldown after use if you are Undercover."
            },
            "Investigate": {
                "charges": 3,
                "rarity": "Uncommon",
                "effect": "Find out who voted your target at the previous elimination and who your target is voting for the upcoming elimination."
            }
            },
            "perks": {
            "Exposed": "If three currently living people have declared you as the Undercover, you cannot use Deduct or Investigate anymore. If someone incorrectly declares, find out who they are, and you may reduce their coin bonus to 0% and inflict a negative [not DC] status of choice, at any point once per incorrect guess.",
            "Paranoia": "Cannot be redirected.",
            "White Clues": "Gain a charge for Investigate every time you deduce an opposite aligned person."
            },
            "achievements": {
            "Master Undercover": "Obtain all Undercover achievements.",
            "No U": "Use black cloak to make someone target themselves.",
            "Under the Radar": "Don't get exposed for the whole game.",
            "Investigator": "Use Investigate 6 times."
            }
        },
        "Wizard": {
            "alignment": "Good",
            "description": "You're the master of spells. You've been practicing magic ever since you were young, and you will use the magic to your advantage.",
            "abilities": {
            "Freeze": {
                "charges": 1,
                "rarity": "Common",
                "effect": "Freeze somebody, giving them a special 4 day, 1/4 thaw chance Frozen. Can choose if it removes any other status effect they have apart from Cursed."
            },
            "Electrify": {
                "charges": 1,
                "rarity": "Common",
                "effect": "Electrify somebody, giving them a special Paralysed which stuns for 56 hours. Can choose if it removes any other status effect they have apart from Cursed."
            },
            "Empower": {
                "charges": 1,
                "rarity": "Legendary",
                "effect": "Empower somebody, giving them Empowered. Removes any other status effect they have apart from Cursed. If you empower yourself, you cannot use empower again."
            },
            "Fireball": {
                "charges": 1,
                "rarity": "Uncommon",
                "effect": "Burn somebody, giving them a special Burned which burns every 16 hours. Can choose if it removes any other status effect they have apart from Cursed."
            },
            "Bless": {
                "charges": 2,
                "rarity": "Rare",
                "effect": "Bless somebody, removing all curses from them if they have any. It can also revive a dead player if they're preserved."
            }
            },
            "perks": {
            "Magic Barrier": "Immune to Frozen, Paralysed, Burned and Cursed. Reflects onto the inflictor."
            },
            "achievements": {
            "Master Wizard": "Obtain all Wizard achievements.",
            "Unlimited Power!": "Empower yourself.",
            "Warlock": " Electrify, Freeze and Fireball the same person.",
            "Priest": "Bless 2 people who are cursed."
            }
        },
        "Yeti": {
            "alignment": "Good",
            "description": "You are a monster that thrives off sticking around in cold environments, you decided to help the person who helped you from a fateful encounter.",
            "abilities": {
            "Encapsulate": {
                "charges": 2,
                "rarity": "Rare",
                "effect": "Target a player, inflict them with Frozen. While Frozen, they are unable to be visited by anyone outside of their alliance and you. However, they be visited by anyone to cure Frozen."
            },
            "Sheltered in Ice": {
                "charges": 2,
                "rarity": "Rare",
                "effect": "Inflict Frozen on every ally in your alliance, while frozen they are immune to negatives. If they are immune, you will learn and choose to bypass it. You may choose to unfreeze them at any time."
            },
            "Nomadic Tribute": {
                "charges": 1,
                "rarity": "Not an Any Ability",
                "effect": "Anyone currently frozen will secretly vote anyone of your choice for the next elimination, if they thaw after this ability is used. Their vote will be returned to normal."
            }
            },
            "perks": {
            "Winter Coat": "You reflect Frozen, and may choose to give allies immunity to Frozen. You may choose to also remove this immunity at any time even if they left the alliance.",
            "Nomadic": "You can see who is currently Frozen at any time and will be told if anyone thaws.",
            "Icicles": "When any players thaw out naturally, you may choose to re-freeze them for 24 hours.",
            "Glacial Wall ": "If anyone attempts to vote you while they are Frozen it will not count."
            },
            "achievements": {
            "Master Yeti": "Obtain all Yeti achievements."
            }
        },
        "Amalgamation": {
            "alignment": "Neutral",
            "description": "A creation of terror, roaming around the battlefield waiting for its next victim.",
            "abilities": {
            "Absorption": {
                "charges": 1,
                "rarity": "Not an Any Ability",
                "effect": "Select a player. Upon their death you may see their abilities and perks and pick one of each. You will be given the ability and perk, and you will also regain a charge of Absorption after doing so. This cannot gain charges outside of its base conditions, and cannot be copied."
            }
            },
            "perks": {
            "Eternal Hunger": "Every time something is used on you, gain 5% coin bonus."
            },
            "achievements": {
            "Master Amalgamation": "Obtain all Amalgamation achievements."
            }
        },
        "Backstabber": {
            "alignment": "Neutral",
            "description": "You're a strong guy, and you can choose to help anyone you want, but you can also backstab anyone you want at any time. This is how you interpret life, betraying to survive.",
            "abilities": {
            "Man's Blessing": {
                "charges": 1,
                "rarity": "Rare",
                "effect": "The first vote on a selected player has 1 less power and remains permanent until you change it. This can stack and go across multiple voters."
            },
            "Decode": {
                "charges": 2,
                "rarity": "Not an Any Ability",
                "effect": "Reverse the effects of Mans Blessing, making the first vote on them increase by 1 instead or reverse the effects of Fatality, making any votes on your allies and yourself not counting."
            },
            "Fatality": {
                "charges": 1,
                "rarity": "Epic",
                "effect": "For one elimination, all votes on any of your allies count as an increased power of 1."
            }
            },
            "perks": {
            "Manipulator": "If you Decode someone and they have the Lucky status, they get the Unlucky status or vice versa. Same applies with Burned & Frozen. You can choose to turn this off.",
            "Finger of Death": "When you die, you may pick a target to have the first vote for someone count as 2 permanently. Once that target dies, you may choose another player.",
            "Counting Stars": "Every time one of your allies die, you gain a charge for Mans Blessing or Decode."
            },
            "achievements": {
            "Master Backstabber": "Obtain all Backstabber achievements.",
            "Night Sky": "Have at least 6 official allies die at any time during the game.",
            "Force Fingered": "Have a target affected by Finger of Death eliminated.",
            "Wishy Washy": "Decode 3 times."
            }
        },
        "Banker": {
            "alignment": "Neutral",
            "description": "You love numbers, and really big ones at that. Even better if they're YOUR big numbers, and you will do anything you can to raise them.",
            "abilities": {
            "Inheritance Tax": {
                "charges": 1,
                "rarity": "Uncommon",
                "effect": "You take all money from a dead player."
            },
            "Last Will": {
                "charges": 4,
                "rarity": "Rare",
                "effect": "If you receive the most votes for the upcoming elimination, everyone who voted you has their coin count reduced to 0. This applies even if rebounded / immune."
            },
            "Payday": {
                "charges": 1,
                "rarity": "Rare",
                "effect": "Everyone currently alive must pay up 200 coins to you or become Restrained for 3 days."
            },
            "Inflate": {
                "charges": 1,
                "rarity": "Uncommon",
                "effect": "Increases an items price by 1000 coins."
            }
            },
            "perks": {
            "Bank Loans": "When in an alliance, all members gain x1.2 more coins. Also allows you to transfer an amount of coins to anyone. Anyone in the Banker's alliance can also transfer money to each other. Banker will know who passes what amounts to who and Banker can turn this on or off.",
            "Greedy": "If in an alliance, you may take all coins that non-aligned allies get. If 50% of living player pay payday, you gain elimination immunity for next elimination, if 75% pay, also gain +2 vote power for upcoming elimination.",
            "Shopkeeper": "You will know when an item is bought, and what item it is."
            },
            "achievements": {
            "Master Banker": "Obtain all banker achievements.",
            "Pretty Penny": "Gain over 1000 coins using inheritance tax.",
            "Written Off": "Reduce 4 people's money counts to 0 using last will.",
            "Payday Payoff": "Gain 1000 coins or more with Payday."
            }
        },
        "Bard": {
            "alignment": "Neutral",
            "description": "*Panicked flute sounds as boss approaches*",
            "abilities": {
            "Charisma Chant": {
                "charges": 3,
                "rarity": "Not an Any Ability",
                "effect": "Select a player, their luck goes up by +2 and +50% until a luck event occurs. Any statuses on them that are negative will be degraded."
            },
            "Damage Dance": {
                "charges": 2,
                "rarity": "Not an Any Ability",
                "effect": "Select a player, their next offensive ability / item use will be 2-fold"
            },
            "Protection Prance": {
                "charges": 2,
                "rarity": "Not an Any Ability",
                "effect": "Select a player, the next negative on them will be blocked."
            },
            "Tactical Tune": {
                "charges": 1,
                "rarity": "Legendary",
                "effect": "Upon use, become immune to death, statuses and elimination, lasts 24h. If attacked or eliminated in this time, add 24 hours onto this - loops."
            }
            },
            "perks": {
            "Bards Charisma": "If Bard, x2 luck and coins from all sources. If not, x1.5 coins instead of x2. Lucky does not effect coins. This perk cannot stack with itself.",
            "Lullaby": "If killed, your killer will be blackmailed for 36 hours. If eliminated, all voters will be given unlucky.",
            "On Deaf Ears": "You may fake-use any base abilities of yours on people."
            },
            "achievements": {
            "Master Bard": "Obtain all Bard achievements."
            }
        },
        "Bomber": {
            "alignment": "Neutral",
            "description": "You are a mad explosives expert, whose actions are very hard to track.",
            "abilities": {
            "Sticky Bomb": {
                "charges": 1,
                "rarity": "Not an Any Ability",
                "effect": "Put a sticky bomb on a player without them knowing. When the holder is visited, the visitor gets the bomb. Detonates after 48 hours."
            },
            "Gas Bomb": {
                "charges": 1,
                "rarity": "Epic",
                "effect": "Gas a player. Them and any visitors get Paralysed, Disabled, and Blackmailed for a 48 hour period. Gas goes away after 72 hours. Self-visits will not gas you."
            },
            "Tagger Bomb": {
                "charges": 1,
                "rarity": "Epic",
                "effect": "Tag a player. Every time the tagged player visits someone they also get tagged. You can see tagged peoples visits."
            }
            },
            "perks": {
            "Bomber's Mask": "Allows you to track the locations of your bombs, including 6 Point Bombs when held.",
            "Cautious Nature": "When going to use an ability or item on someone, you will know if an ability is active on or around them",
            "Resistant Vest": "Immune to any effects of a bomb and any fatal item effects."
            },
            "achievements": {
            "Master Bomber": "Obtain all Bomber achievements.",
            "Tick Tick Boom": "Kill someone using a sticky bomb.",
            "Chambers": "Gas bomb 4 people.",
            "Tag, you're it!": "Tag 8 people."
            }
        },
        "Cheater": {
            "alignment": "Neutral",
            "description": "You're a crazy maniac who'll do anything to win, and doesn't play by the rules.",
            "abilities": {
            "Bend": {
                "charges": 2,
                "rarity": "Uncommon",
                "effect": "Change someone's alignment to an alignment of your choice. They will be informed of this. If Cheater: Gain a charge of this every day."
            },
            "Interception": {
                "charges": 5,
                "rarity": "Uncommon",
                "effect": "Target a person, receive the next feedback that they would receive from an ability/item."
            },
            "Break": {
                "charges": 1,
                "rarity": "Legendary",
                "effect": "For 24 hours, if whoever you select dies, they will come back to life at the end of this time."
            }
            },
            "perks": {
            "Rulebreaker": "Negative item effects from the alignment you currently are will not affect you.",
            "Wilful Ignorance": "Your actions cannot be blocked in any way."
            },
            "achievements": {
            "Master Cheater": "Obtain all Cheater achievements.",
            "Cheating Death": "Die whilst having break activated.",
            "All Seeing Eyes": "Obtain three investigative feedback results using interception.",
            "Can't Touch This": "Be unaffected by three status effects due to Rulebreaker."
            }
        },
        "Cyborg": {
            "alignment": "Neutral",
            "description": "You're a human swarming with nanobots and mechanical parts, upgrading and destroying to better yourself and others around you.",
            "abilities": {
            "Upgrade": {
                "charges": 3,
                "rarity": "Epic",
                "effect": "Select someone, they can now upgrade a perk or ability. Max once per ability or perk."
            },
            "Overclock": {
                "charges": 3,
                "rarity": "Rare",
                "effect": "Select someone, they can now upgrade an item of choice. Max once per item."
            },
            "Hyperdrive": {
                "charges": 1,
                "rarity": "Legendary",
                "effect": "Select someone, they gain a new charge for an ability of choice, once every 4 days."
            },
            "Degrade": {
                "charges": 1,
                "rarity": "Rare",
                "effect": "Select someone, you learn their role and see their abilities and perks, you can degrade an ability or perk of choice."
            }
            },
            "perks": {
            "Perfection": "You're already perfect, you cant use Upgrade on yourself. Hyperdrive on yourself will give 1/2 charges when applying then to aas, and 1/3 to base abilities. Your self-hyper runs off a different timer than other hypers given to you.",
            "Tinkering": "You can upgrade any Common items you obtain once per item type, and any Uncommon items you obtain once.",
            "Robotic Nature": "You're immune to Paralysed, Frozen, Burned, Despaired, Blackmailed and Drunk."
            },
            "achievements": {
            "Master Cyborg": "Obtain all Cyborg achievements.",
            "Tink tonk": "Tinker an item.",
            "Hyperactive": "Hyperdrive someone.",
            "Better, Faster, Stronger": "Upgrade an ability or perk."
            }
        },
        "Entertainer": {
            "alignment": "Neutral",
            "description": "Put on a show, for public and private audiences!",
            "abilities": {
            "Opening act": {
                "charges": 4,
                "rarity": "Uncommon",
                "effect": "Select someone, if they join or make an alliance within the next 48 hours, you will know. They will have -10% or +10% immunity card chances, you decide. Does not stack if multiple in same alliance."
            },
            "Side-Show": {
                "charges": 3,
                "rarity": "Uncommon",
                "effect": "Select someone, forcing yourself into their alliance, as if someone invited you. You can be in 2 alliances at once using this method. If you use this when in 2, you will have to leave 1, you pick."
            },
            "The Twist": {
                "charges": 2,
                "rarity": "Uncommon",
                "effect": "Select 2 players, their alliances will be merged for 24 hours. If in same alliance, the alliance is instead split equally. People may not leave for the duration of this ability."
            },
            "Finale": {
                "charges": 1,
                "rarity": "Not an Any Ability",
                "effect": "Select someone, their alliance must vote within their alliance chat a person to die. Draws will kill all not in the draw. An alliance of 2 will have draws kill both instead. People may not use abilities until someone is voted, counts as an elimination kill. People may not leave for the duration of this ability. If you pick someone alone, you will be blackmailed and despaired."
            }
            },
            "perks": {
            "Legion": "You may have 1 additional person in your alliance, if you choose to allow it.",
            "Lead Actor": "You gain 2 luck from Good/Evil, for every good and evil pair in your alliance, gain an additional 2 luck. When you leave an alliance, you may have any form of leave message come up [kicked, dragged out, banned]. You can leave your own abilities.",
            "Top-Hat Tip": "You start the game lucky, you are immune to unlucky. You can see yours and all your allies luck at all times.",
            "False-Smile": "If someone leaves your alliance, use a free charge of opening act on them automatically, or, you can inflict unlucky, frozen or disabled within 12 hours, frozen and disabled will last 12 hours.",
            "Forced Performance": "If someone uses a negative action on you that tells you it was used, if you correctly say who did it, you may drag them into your alliance at any time."
            },
            "achievements": {
            "Master Entertainer": "Obtain all Entertainer achievements."
            }
        },
        "Ghost": {
            "alignment": "Neutral",
            "description": "You're not really a human. You're just a lone spirit casting an illusion unknown to the others. Your spirit is still alive, and it doesn't want to be around others.",
            "abilities": {
            "Invisibility": {
                "charges": 4,
                "rarity": "Uncommon",
                "effect": "Go invisible which allows nobody to visit you for 24 hours."
            },
            "Curse": {
                "charges": 4,
                "rarity": "Common",
                "effect": "Curse somebody, giving them Cursed. Removes any other status effects they have."
            },
            "Death Curse": {
                "charges": 1,
                "rarity": "Not an Any Ability",
                "effect": "Curse somebody, giving them a special Cursed which can only be cured by the Bless. Someone inflicted with this curse will have their perks and abilities disabled unless you die."
            },
            "Disappear": {
                "charges": 1,
                "rarity": "Legendary",
                "effect": "Vanish for up to two days, making nothing happen to you. You're also immune to votes. You may reappear at any time once you vanish."
            }
            },
            "perks": {
            "Ghosts Blood": "Immune to Cursed.",
            "Secret Spirit": "You can still use your items and abilities when you're eliminated. You still gain AA's and items from power drops/item rains.",
            "Confusion": "If you're investigated, the investigator will receive a random result instead."
            },
            "achievements": {
            "Master Ghost": "Obtain all Ghost achievements.",
            "Ghost's Grudge": "Kill someone with Death Curse.",
            "Magical Warfare": "Kill someone with a normal curse.",
            "Vanishing Act": "Use Disappear during F4."
            }
        },
        "Goliath": {
            "alignment": "Neutral",
            "description": "You're a skilled ring fighter, great at exploiting weakness, shaking up fights, and punching the hell out of things in general.",
            "abilities": {
            "Bloody Knuckles": {
                "charges": 2,
                "rarity": "Uncommon",
                "effect": "Target somebody, you learn their status immunities. Choose a status immunity to remove from them permanently. If the target has no immunities they leave a blood trail which tracks their next visit for you even through Shatter. (who they visited and the nature of the visit)"
            },
            "Wall Breaker": {
                "charges": 2,
                "rarity": "Uncommon",
                "effect": "Target somebody, if they're in an alliance you publicly reveal the alliance name and members. If they aren't in an alliance this does nothing and you gain a charge back but they're aware Goliath tried to break in."
            },
            "Dimensional Shatter": {
                "charges": 0,
                "rarity": "Not an Any Ability",
                "effect": "Gain a charge of this ability only after Rage has activated four times. For 24 hours all visits are untraceable, any deaths are not revealed but still happen. Whoever is eliminated at the end of the day dies and doesn't get their last words. In the case of a draw, everybody involved dies. All investigation abilities reveal nothing."
            }
            },
            "perks": {
                "Rage": "When you or an ally is negatively afflicted, gain another charge of Bloody Knuckles. You can only gain 1 charge per person who negatively inflicts you or your allies every 2 days.",
                "God's Fist": "Once Rage activates ten times gain a powerful upgrade for one use of Bloody Knuckles that strips all immunities including death immunity or protection, can't be blocked or redirected.",
                "Crippling Strike": "When an ally is attacked, you will know who did it even through Shatter, and can choose to paralyze them. Status immunities you have chosen to remove with Bloody Knuckles prior to the attack will be removed permanently from the attacker.",
                "Scrying": "When you use Dimensional Shatter you gain death immunity, nullify 50% of votes on you, and Crippling Strike also activates for both status infliction and attacks."
            },
            "achievements": {
                "Master Goliath": "Obtain all Goliath achievements.",
                "Broken Barriers": "Active the God's Fist perk.",
                "Knock, Knock": "Reveal the first two alliances you use Wall Breaker on.",
                "Jaw Crusher": "Successfully use Crippling Strike to remove more than 3 status immunities."
            }
        },
        "Incubus": {
            "alignment": "Neutral",
            "description": "Charm magic isn't needed so much when your way with words bends the mind of mortals alone.",
            "abilities": {
            "Demonic Embrace": {
                "charges": "inf",
                "rarity": "Epic",
                "effect": "Pick someone once every 24h. They will be told they have been embraced by an Incubus. embraced targets will have x2 vote power when voting with you or an embraced person and you also have x2 vote power when voting with embraced, as long as Sinister smile isnt on."
            },
            "Sinister Smile": {
                "charges": "inf",
                "rarity": "Not an Any Ability",
                "effect": "Embraced targets only have their vote work when voting with you, or against you. You gain 2/6 vote power per living embraced and 1/6 per dead embraced, your vote rounds up. You can switch this on or off, embraced will not know."
            },
            "Hair Pulling": {
                "charges": 3,
                "rarity": "Rare",
                "effect": "Force all embraced to vote with you."
            },
            "Gentle Holdings": {
                "charges": 3,
                "rarity": "Uncommon",
                "effect": "Only works on embraced targets. Give them elim immunity and +1 vote power for next elimination."
            }
            },
            "perks": {
            "Sexual Findings": "Every time someone new uses something on you, gain 25 coins. Every time you use something, gain 25 coins.",
            "Kiss Of Death": "Each time an embraced dies, gain 500 coins.",
            "Master": "You will be told if an embraced is voting you / going to vote you. embraced will not gain x2 votes against you, and instead will be halved in vote power. If majority of votes are going to be on you [based on if nothing was reducing vote power / redirecting votes] from embraced members mostly, you may choose to have a random one die via Soul Suck, bypassing everything, max once every 36 hours.",
            "Utter Affection": "If you have 4 or more living embraced, if attacked, your latest embraced will take the hit. This also activates if 33% of living are embraced.",
            "Hard-On": "If 3 embraced die, gain a charge of hair pulling, and become able to self-use gentle holdings.",
            "Love-Hate Duet": "Evade the first negative from an embraced each day, you learn what it was and who did it.",
            "Lick-Up": "If one of your embraced die from soul suck, you gain a random item, going up in rarity for base-level. eg, 1st kill is common+, second is uncommon+, etc."
            },
            "achievements": {
            "Master Incubus": "Obtain all Incubus achievements."
            }
        },
        "Masochist": {
            "alignment": "Neutral",
            "description": "You love attention, especially the kind to cause you torment. Votes on you gives you pleasure, among other things",
            "abilities": {
            "Allure": {
                "charges": 5,
                "rarity": "Common",
                "effect": "Make someone vote you during elimination."
            },
            "Repulse": {
                "charges": 0,
                "rarity": "Rare",
                "effect": "Make any votes on you reflected back to the voter, but still gain a stack. Activates with 2 charges at 5 stacks."
            },
            "Submission": {
                "charges": 0,
                "rarity": "Epic",
                "effect": "All votes don't work on you apart from giving you charge. Every vote you receive now counts towards your vote. Activates with 1 charge at 8 stacks."
            },
            "Cross Eyes": {
                "charges": 0,
                "rarity": "Uncommon",
                "effect": "Works for 24 hours on use. If you have a negative status put on you"
            }
            },
            "perks": {
            "Pleasure": "Receive a stack of pleasure every time you get voted.",
            "Masochism": "Gain 100 coins for every stack you receive.",
            "Bliss": "When you're attacked, it fails and you give the attacker Blackmailed. Gives you 3 stacks. Activates at 10 stacks.",
            "Euphoria": "Gives additional perks when at high amount of stacks.\n12 Stacks = You get an extra vote if you have a negative status effect.\n14 Stacks = All negative status effects don't work on you apart from Cursed.\n16 Stacks = You now get an extra vote for every negative status effect.\n18 Stacks = You now may swap 3 stacks in for immunity to the next Elimination. Deactivates when under 18 stacks again.",
            "Pain Chaser": "If someone in your alliance has a negative effect happen, you get it instead.",
            "One Track Mind": "Immune to Lucky.",
            "Master Bound": "You cannot vote yourself or inflict yourself with negative status effects, unless reflected."
            },
            "achievements": {
            "Master Masochist": "Obtain all masochist achievements.",
            "Orgasmic": "Gain 18 stacks.",
            "Submissive": "Successfully use submission to gain 4+ vote power.",
            "Eye rolling": "Survive an attack due to bliss."
            }
        },
        "Mimic": {
            "alignment": "Neutral",
            "description": "You have no identity, you live your life imitating other people, being behind other peoples shadows.",
            "abilities": {
            "Re-enact": {
                "charges": 3,
                "rarity": "Epic",
                "effect": "Select someone, you copy and gain a charge of their next ability they use."
            },
            "Replay": {
                "charges": 1,
                "rarity": "Rare",
                "effect": "Select someone, any votes they gain - you gain that as your vote power for next elimination. Can be used on yourself at half vote power."
            },
            "Reaction": {
                "charges": 3,
                "rarity": "Rare",
                "effect": "The next action done to you also effects the person doing it to you."
            },
            "Reuse": {
                "charges": 3,
                "rarity": "Epic",
                "effect": "Select a person, gain a copy of the next item they use. Items that are Mythical or higher, can be copied max twice."
            }
            },
            "perks": {
            "Blend In": "In in in a tie vote, only your opposition can be voted.",
            "Personal Mimicry": "Upon a successful Reaction, you may copy a perk from the person. Max 2 at a time.",
            "Shifting": "Your alignment will change to whatever your alliance's dominant faction is luck wise. If there's a 'tie' then you may pick between the alignments."
            },
            "achievements": {
            "Master Mimic": "Obtain all mimic achievements.",
            "Shifted": "Join an alliance where there is a tie between alignments.",
            "Mirrored": "Successfully use Reaction.",
            "Perfect Copy": "Gain a unique ability or Legendary+ item using your abilities."
            }
        },
        "Nephilim": {
            "alignment": "Neutral",
            "description": "Born from the gods, but not one to walk with them.",
            "abilities": {
               "Spacial Followings": {
                  "charges": 2,
                  "rarity": "Rare",
                  "effect": "Defensive: When used, for 24 hours, you will disarm anyone of their items used against you or an ally and claim them for yourself, you will know who you disarmed. Offensive: Select someone, breaking their arms, preventing item use and passing for 24 hours and inflicting paralysis."
               },
               "Ready-Stance": {
                  "charges": 2,
                  "rarity": "Rare",
                  "effect": "Defensive: Upon use, anything used on you in the next 24 hours you will know about, you can choose to stop the effect entirely, inflict it on an ally, or take it. Offensive: Select someone, anything negative that happens to you in the next 12 hours, also happens to them, if they try to do a negative onto you, disable, restrain and blackmail them, preventing the action. You will be told who does what to you during this, and for every negative action done to you, the timer increases by 2 hours."
               },
               "Brute Force": {
                  "charges": 1,
                  "rarity": "Epic",
                  "effect": "Offensive only: Bind someone's alliance, causing them only to target each other for the next 24 hours, including votes. If not in an alliance, break their arms preventing item use and passing for 24h, and prevent them from joining an alliance for 24h."
               },
               "Iron Will": {
                  "charges": 1,
                  "rarity": "Epic",
                  "effect": "Defensive only: If killed or eliminated within the next 24 hours, survive it, gaining immunity to all negative statuses for the next 3 days."
               }
            },
            "perks": {
               "Stinging Serenity": "You may change between offensive and defensive states, with a 18 hour delay between changes. You start off in a state of choice.",
               "Stable enough": "\nDefensive: Immune to 3 statuses of choice\nOffensive: Negative Status-inflicting items/AA last twice as long, or are twice as damaging depending on the status",
               "Bloodied": "\nDefensive: Every time an ally dies, your coin bonus increases by 15%\nOffensive: Every time someone you have harmed dies, gain 10% of their coins",
               "Iron-body": "\nDefensive: Lethal attacks will rebound and kill an ally instead\nOffensive: Lethal attacks will rebound 2 fold onto the attacker"
            },
            "achievements": {
               "Master Nephilim": "Obtain 3 Nephilim achievements.",
               "Personal Space Stealing": "Claim 3 items using Spacial Followings.",
               "Readied up": "Successfully have at least 3 visits when using Ready Stance.",
               "Tough as nails": "Successfully survive elimination with iron body.",
               "Smack Down": "Activate Ready Stance while in offensive to harm someone.",
               "Brutality": "Use Brute Force on 4 or more people in one use.",
               "Pain Gains": "Inflict 3 lots of double strength/length statuses."
            }
        },
        "Pathologist": {
            "alignment": "Neutral",
            "description": "You're interested in the dead and you enjoy examining dead bodies. It's all you do, even in your free time. You're so obsessed with it that you want others to be killed just to be examined.",
            "abilities": {
                "Body Examine": {
                    "charges": 4,
                    "rarity": "Uncommon",
                    "effect": "Find the role of a player who has died."
                 },
               "Act Out": {
                  "charges": 1,
                  "rarity": "Legendary",
                  "effect": "Choose a perk and an ability to gain from somebody who is dead. Max 2 times per person. If not path: Max 1 perk at a time, unable to gain multiple. Can choose to not get a perk when using it."
               },
               "Disrespectful Peek": {
                  "charges": 6,
                  "rarity": "Common",
                  "effect": "Check what items a dead player has."
               },
               "Confiscate": {
                  "charges": 3,
                  "rarity": "Uncommon",
                  "effect": "Take all the items from a player who has died for yourself."
               }
            },
            "perks": {
               "Dead Inside": "Immune to any effects from somebody's perk or ability that can happen to you when they're dead.",
               "Corpse Raider": "Every time someone is eliminated, gain 2.5% coin bonus. Every time someone is murdered, gain 5% coin bonus."
            },
            "achievements": {
               "Master Pathologist": "Obtain all Pathologist achievements.",
               "Forensic": "Act Out a non-AA/unique ability.",
               "Grave Robber": "Confiscate 5 items.",
               "Mortician": "Block someone's perk/ability that activates on you when eliminated/dead."
            }
        },
        "Sidekick": {
            "alignment": "Neutral",
            "description": "You are an amazing team player and will always help others, making you a strong ally. Helping others allows you to help yourself too.",
            "abilities": {
               "Safeguard": {
                  "charges": 3,
                  "rarity": "Uncommon",
                  "effect": "Protect somebody from the next elimination. Cannot be yourself. Whoever you protect won't be notified."
               },
               "Surveillance": {
                  "charges": 3,
                  "rarity": "Uncommon",
                  "effect": "Protect your alliance from outside visitors for 24 hours."
               },
               "Steel Guard": {
                  "charges": 0,
                  "rarity": "Epic",
                  "effect": "Protect your alliance from the next elimination. Can be used solo."
               },
               "Silver Finger": {
                  "charges": 1,
                  "rarity": "Rare",
                  "effect": "Your vote counts as 2 for the next elimination and 2 votes will be nullified against you."
               }
            },
            "perks": {
               "Security": "Every time you successfully protect someone with Safeguard, gain a charge for Steel Guard.",
               "Sympathetic": "Prevents anyone from voting anyone else in your alliance."
            },
            "achievements": {
               "Master Sidekick": "Obtain all Sidekick achievements.",
               "Reliable Friend": "Have all 3 safe guards save someone.",
               "Steel Saviour": "Save an ally with steel guard.",
               "Patrol Officer": "Stop 5 different visitors with Surveillance."
            }
        },
        "Succubus": {
            "alignment": "Neutral",
            "description": "You're a mass seducer, but not so good at hiding what you do.",
            "abilities": {
               "Charm": {
                  "charges": "inf",
                  "rarity": "Not an Any Ability",
                  "effect": "Pick someone to charm, they can no longer vote you however they know who you are and your vote doubles if a charmed votes the same player as you. 48 hour cooldown."
               },
               "Gag": {
                  "charges": 3,
                  "rarity": "Common",
                  "effect": "Gag a player, giving them blackmailed. Refer to perks if charmed player."
               },
               "Contract Break": {
                  "charges": "inf",
                  "rarity": "Not an Any Ability",
                  "effect": "Pick a charmed person to free from charm and gain a charge for Gag. 48 hour cooldown."
               }
            },
            "perks": {
               "Sexual Encounter": "Every time someone new uses something on you, gain 50 coins.",
               "Sadistic": "If one of your charmed targets is voted off or killed, you gain 300 coins along with a charge for Gag.",
               "Chain Puller": "If your voted target ends up in a draw, you may force all your charmed targets to vote the person of your choice. If you are voted up in a draw, you can make all charmed targets vote the other person.",
               "Soul Sucker": "If a person dies from having their Soul Sucked, gain 2 charges for Gag.",
               "Muffled Moans": "Blackmailing a charmed causes them to become seduced - meaning if they try to hint to who you are or do anything non-positive to you, they die, ignoring everything. This does not blackmail them, it only changes charmed -> seduced.",
               "Blinding Desire": "Seduced people cannot detect your actions when they involve seducing other people.",
               "Dominatrix": "Cannot be seduced, immune to blackmail."
            },
            "achievements": {
               "Master Succubus": "Obtain all Succubus achievements.",
               "Seductive": "Charm 4 people.",
               "Silenced": "Have 3 gagged and charmed people alive at once.",
               "Collar Tugger": "Activate the chain puller perk."
            }
        },
        "Tinkerer": {
            "alignment": "Neutral",
            "description": "Alteration of everything and anything to get a step ahead the others, even power itself.",
            "abilities": {
               "Override": {
                  "charges": 3,
                  "rarity": "Epic",
                  "effect": "Use an AA without using up a charge. Using this on an AA more than once will delete the AA from your inventory afterwards. Cannot be used on empower nor hyperdrive when empowered."
               },
               "Matter Reconstruction": {
                  "charges": 2,
                  "rarity": "",
                  "effect": "Transform an item into a random equally rare AA. If Unique, gain a random AA of Uncommon+. Ultimate and Mythical items become a Legendary AA."
               },
               "Upsurge": {
                  "charges": 2,
                  "rarity": "Uncommon",
                  "effect": "Merge 2 AA's of the same rarity into one of choice from the rarity above. Will have a charge if both used AA's had one. Can be used to merge multiple pairs of AA's in one go."
               },
               "Down-surge": {
                  "charges": 2,
                  "rarity": "Uncommon",
                  "effect": "Break down an AA into 2 of choice from the rarity below. Both will have a charge if broken down one did. If not, only one of them will."
               },
               "Assimilate": {
                  "charges": 2,
                  "rarity": "Epic",
                  "effect": "Select someone, taking AA's of choice from them. You may not use these AA's outside of using them to build in your other abilities."
               }
            },
            "perks": {
               "Power Handling": "You may pass AA's to other players.",
               "Low-Power Hotwire": "You may use a Common AA for free every day, even if it has 0 charges.",
               "Assimilation Copy": "If you use Assimilate on someone with immunities, copy them.",
               "Eye of Power": "You can see what AA's your allies get in Power Drops and from AA based items."
            },
            "achievements": {
               "Master Tinkerer": "Obtain all Tinkerer achievements."
            }
        },
        "Villager": {
            "alignment": "Neutral",
            "description": "You're just a villager who wants to survive. You may have to fight for survival, but it's your desire to live and get back to your village, everyone loves you.",
            "abilities": {
               "Bond": {
                  "charges": 4,
                  "rarity": "Common",
                  "effect": "Bond with a player of choice, giving them +30% coin bonus. Cannot be used on the same person again within 12 hours. Can stack."
               }
            },
            "perks": {
               "Loveable": "You can be in up to three alliances.",
               "Jack of All Trades": "Gain an additional Any Ability from events and items that usually give Any Abilities."
            },
            "achievements": {
               "Master Villager": "Obtain all Villager achievements.",
               "Around the World": "Enter 3 alliances.",
               "Bonding": "Bond 1 person 4 times.",
               "MVP Teammate": "Use bond on 3 different allies."
            }
        },
        "Wanderer": {
            "alignment": "Neutral",
            "description": "You're a level headed loner, trying to get away from the chaos.",
            "abilities": {
               "Serene State": {
                  "charges": 3,
                  "rarity": "Uncommon",
                  "effect": "When activated, the next action on you will fail, you know what it was, and who did it."
               },
               "Forceful Resignation": {
                  "charges": 2,
                  "rarity": "Rare",
                  "effect": "Select someone, if in alliance, they are removed from the alliance and cannot re-join an alliance for 24 hours. If not in alliance, they become paralysed and blackmailed."
               },
               "Off The Beaten Path": {
                  "charges": 3,
                  "rarity": "Common",
                  "effect": "Select someone, you swap coin bonuses for next coin phase. You also swap luck if yours is lower. Luck is swapped until luck influencing event occurs."
               }
            },
            "perks": {
               "Lonesome": "When not in an alliance, gain 35% coin boost and +3 luck.",
               "Calming Silence": "When not in an alliance, you gain +1 luck every 2 days. You have access to this luck only when alone.",
               "Observant": "Observant - When not in an alliance or in an alliance of 2 - You will know whats used on you.",
               "Wolf": "When not in alliance or in an alliance of 2, lethal attacks on you will fail and kill the attacker, if they are immune to attacks, you learn their role and destroy their inventory."
            },
            "achievements": {
               "Master Wanderer": "Obtain all Wanderer achievements.",
               "Run-down": "Use Forceful resignation on the same alliance twice.",
               "Lone Wolf": "Kill someone who tried to kill you.",
               "Not Today": "Avoid 3 negative actions using Serene State."
            }
        },
        "Anarchist": {
            "alignment": "Evil",
            "description": "You believe democracy oppresses the will of the individual. You like to cause anarchy, switching things up and making the battlefield change.",
            "abilities": {
               "Purge": {
                  "charges": 7,
                  "rarity": "Rare",
                  "effect": "Choose someone and they will have their vote blocked. If their vote power is personally buffed due to a perk or ability, their vote power will only be decreased by 1. They will be alerted that their vote was blocked by the Anarchist. Gain a charge of this after every elimination phase."
               },
               "Imperium": {
                  "charges": 1,
                  "rarity": "Rare",
                  "effect": "Select someone, they may cast three votes for the upcoming Elimination. Must all be for different people."
               },
               "Isolate": {
                  "charges": 1,
                  "rarity": "Rare",
                  "effect": "Isolate someone for until the upcoming Elimination, making them unable to do anything (including vote) but also not able to be visited or voted."
               },
               "Sunder": {
                  "charges": 1,
                  "rarity": "Epic",
                  "effect": "Split the players into 2 equal groups of your choice. Everyone can only visit, vote and talk to people in that group until the next Elimination. Both groups will vote someone out. If used 12h before elim, occurs immediately, else, occurs at eliminaiton."
               }
            },
            "perks": {
               "One Step Ahead": "Each day you may select up to two players (you cannot switch to different players after selection). You will know who these players are voting for until after the upcoming Elimination."
            },
            "achievements": {
               "Master Anarchist": "Obtain all Anarchist achievements.",
               "Purge Night": "Have only yourself and/or allies able to vote due to purge uses.",
               "Division Decision": "Use sunder, and have whoever you voted on your side die.",
               "Lonesome Survival": "Save someone via isolation."
            }
        },
        "Arsonist": {
            "alignment": "Evil",
            "description": "Some men just want to watch the world burn.",
            "abilities": {
               "Douse": {
                  "charges": "inf",
                  "rarity": "Uncommon",
                  "effect": "Every 24 hours, you may douse someone, not notifying the person you douse. Using this on a doused will remove the douse, but give you +1 luck."
               },
               "Incineration": {
                  "charges": 2,
                  "rarity": "Epic",
                  "effect": "Upon use, burn all doused players, destroying all of their items, and giving them burned."
               },
               "Ignite": {
                  "charges": 3,
                  "rarity": "Rare",
                  "effect": "Select a doused player, burning them and destroying their highest tier item, and remove doused on them. Alternatively, give burned to all doused."
               },
               "Chemical Burning": {
                  "charges": 1,
                  "rarity": "Epic",
                  "effect": "Select someone, giving a special burned, which burns ability charges instead of items. Can be cured using 2 lots of burn removal items/abilities. Can only select doused targets, removes doused on them."
               }
            },
            "perks": {
               "Ashes to Ashes": "Your items cannot be burnt away/destroyed nor stolen. Anyone you douse is also 'framed' and shown as Arsonist / Evil.",
               "Flamed": "Reflect burn, and, every time someone tries to burn you, gain a charge of ignite, and douse them.",
               "Gasoline Fumes": "For every doused person, get +10% coins. For every 2 doused people, get +1 luck.",
               "Hellish Landscape": "If every living player is doused; remove all burn immunities people have and then inflict everyone with a 12h burn. You also gain a random Epic-Mythical item. You may now also douse corpses.",
               "Heat Vision": "You can see who is currently Burned. You also know who is currently doused."
            },
            "achievements": {
                "Master Arsonist": "Obtain all Arsonist achievements."
            }
        },
        "Bartender": {
            "alignment": "Evil",
            "description": "You're completely obsessed with alcohol, all you do is drink and pressure others into drinking a lot.",
            "abilities": {
               "On the House": {
                  "charges": "inf",
                  "rarity": "Common",
                  "effect": "Pick someone giving them Drunk. If Bartender - Has a 24 hour cooldown."
               },
               "Intoxication": {
                  "charges": 2,
                  "rarity": "Rare",
                  "effect": "Upon activation, select a person, them and all people currently with Drunk will gain an extra stack of Drunk as well as Blackmailed, Disabled and Paralysed for 24hrs."
               },
               "Clink": {
                  "charges": 1,
                  "rarity": "Epic",
                  "effect": "Select a person, their entire inventory will become Iron Balls."
               },
               "Moonshine": {
                  "charges": 1,
                  "rarity": "Rare",
                  "effect": "Select a person, remove any other status effects aside from Cursed that they currently have and they will become 100% Drunk for 24 hours"
               }
            },
            "perks": {
               "Drinking Buddies": "Gain a Beer every time someone else in the game gets a Beer",
               "Alcoholic": "Anytime someone tries to inflict you with Drunk, it gets reflected back to them.",
               "Staggering Suggestions": "You know who is drunk. People within your alliance can only be the target of positive drunk actions. You can select 25% of players who are not within your alliance to never be the target of positives, and always the target of negatives."
            },
            "achievements": {
               "Master Bartender": "Obtain all Bartender achievements.",
               "Drunkception": "Have a drunk person accidentally target you with a drunk giving item/ability and have it reflect back to them.",
               "House Party": "Intoxicate 5 or more people.",
               "Ferrate Fabricate": "Turn 4 items into Iron Balls."
            }
        },
        "Consort": {
            "alignment": "Evil",
            "description": "Your charm, charisma and good looks gets you anything you want and you will manipulate that as much as you possibly can.",
            "abilities": {
               "Private Show": {
                  "charges": 3,
                  "rarity": "Not an Any Ability",
                  "effect": "Select someone - Any actions they attempt to do for the next 12 hours will fail, they will not be informed unless its a feedback action."
               },
               "Public Display": {
                  "charges": 1,
                  "rarity": "Not an Any Ability",
                  "effect": "Select someone - Any actions themselves or their alliance attempt to do for the next 24 hours will fail, they will not be informed unless its a feedback action."
               },
               "Revealing Attraction": {
                  "charges": 2,
                  "rarity": "Not an Any Ability",
                  "effect": "Select someone - If they use any positive actions or send items / money for the next 24 hours, you receive it instead. This does not include self-use positives."
               }
            },
            "perks": {
               "Backstage Practise": "Every time you're visited by someone new, gain a charge for Private Show.",
               "Tips for Tips": "Gain 50 coins for every action you stop",
               "Viruses": "Spread negative status effects you have upon every successful action stopped. You can decide with up to an hour delay when it is inflicted. You can gain statuses you are immune to, and not be affected by them. Losing the immunity while having the status, will remove the status with it.",
               "Redressing": "If a harmful status effect or harmful action is used on you by someone you're using an original ability on, your ability cancels."
            },
            "achievements": {
               "Master Consort": "Obtain all Consort achievements.",
               "Pornstar": "Stop atleast 4 actions using public display.",
               "Stripper": "Stop 4 actions using private show.",
               "Gold Digger": "Get more then 300 coins in 1 day from your abilities."
            }
        },
        "Cultist": {
            "alignment": "Evil",
            "description": "A dark minded individual who 'gifts' their targets with a secret incantation that marks them as a sacrifice to dark powers.",
            "abilities": {
               "Mark of the Fallen": {
                  "charges": 1,
                  "rarity": "Not an Any Ability",
                  "effect": "The targeted player becomes marked. Any action marked people do to someone else (except voting) passes along the mark. This is not known to the target. It can be spread indefinitely. (You cannot pick yourself)"
               },
               "Forbidden Knowledge": {
                  "charges": 3,
                  "rarity": "Uncommon",
                  "effect": "See all actions performed on all members of your alliance for that elimination phase. Only reveals the type of actions performed."
               },
               "Sacrifice": {
                  "charges": "1",
                  "rarity": "Not an Any Ability",
                  "effect": "You can only target Marked people with this. Whoever is chosen by you will be marked for death, they have 48 hrs to pass it onto someone else by visiting them. People will be notified when they are marked for death. The timer increases by 6 hours every time the Mark of Death is passed on. (You cannot pick yourself)"
               }
            },
            "perks": {
               "Mob Mentality": "The number of marked players the Cultist has grants different bonuses\n\n2 Marked = Coin bonus 10%\n3 Marked = Alliance receives a private Item Rain\n4 Marked = Given a Cursed Relic (Epic item)\n5 Marked = Survey now works on all marked people and reveals all the marked to the Cultist.\n6 Marked = Gain 50% coin Bonus, and a charge of Forbidden Knowledge\n7 Marked = You can cure a player of all Status effects once per elimination phase (Unlimited)\n8 Marked = You can give a player any negative status effect of choice (basic) once per elimination phase (Unlimited)\n9+ Marked = Gain an extra 5% coin bonus for every marked person from this point onwards.",
               "Dark Company": "You are immune to Curse. If a player in the Cultist's alliance is marked then they get Curse Immunity as long as they're in this alliance/marked.",
               "Martyr": "If all players alive are marked then they all receive Cursed. You can see who cursed are voting, but not who is voting who."
            },
            "achievements": {
               "Master Cultist": "Obtain all Cultist achievements.",
               "Intolerable": "Find at least 10 actions done to your alliance using Forbidden Knowledge.",
               "Festivities": "Mark +9 People and mass curse everyone.",
               "Marked for Death": "Death mark someone, and have someone die while carrying the death mark."
            }
        },
        "Doll": {
            "alignment": "Evil",
            "description": "You're a husk, empty on the inside, but seemingly perfect on the outside.",
            "abilities": {
               "Soul Seeking": {
                  "charges": "inf",
                  "rarity": "Common",
                  "effect": "Check someone - finding out their luck, coins and statuses. Starts with 2 charges. Gains a charge each time you get a status and every 24 hours."
               },
               "Soul Swap": {
                  "charges": 3,
                  "rarity": "Rare",
                  "effect": "Swap statuses between 2 players of choice."
               },
               "Coin Flip": {
                  "charges": 2,
                  "rarity": "Uncommon",
                  "effect": "Select 2 people, swapping coin bonuses for 48 hours."
               },
               "Luck Transfer": {
                  "charges": 2,
                  "rarity": "Rare",
                  "effect": "Permanently swap 2 people's luck. If you use it on yourself, you will only swap if yours is lower."
               },
               "Survival Swap": {
                  "charges": 1,
                  "rarity": "Epic",
                  "effect": "You swap immunities between 2 players permanently."
               },
               "Body Swap": {
                  "charges": 1,
                  "rarity": "Uncommon",
                  "effect": "Select 2 people, actions on 1 go to the other, and vise versa, for 48 hours."
               }
            },
            "perks": {
               "Facade": "You may fake your role, alignment, items, immunities, etc",
               "Breakable": "Upon taking a lethal attack for the first time, you survive, lose 2 ability charges of choice and lose Facade."
            },
            "achievements": {
               "Master Doll": "Obtain all Doll achievements.",
               "Picture Perfect": "Have someone investigate you while your Facade is still functional.",
               "Degeneration": "Cause someone to lose multiple immunities due to survival swap.",
               "Soul Watcher": "Use soul swap 5 times or mores."
            }
        },
        "Forsaken Angel": {
            "alignment": "Evil",
            "description": "Not everything from paradise is friendly.",
            "abilities": {
               "Blackened Chains": {
                  "charges": 5,
                  "rarity": "Rare",
                  "effect": "Select someone, the next negative that happens to you, happens to them 2 fold."
               },
               "Erasure": {
                  "charges": 1,
                  "rarity": "Epic",
                  "effect": "Select someone, and remove a positive perk of choice from them if they have visited you or an ally within the last 48 hours. They gain it back upon your death. Cannot be used on the same person more than once per game. Empowering this cancels your empower."
               },
               "Broken Blade": {
                  "charges": 1,
                  "rarity": "Epic",
                  "effect": "Select someone, destroying all currently-lasting positive abilities on them, and destroy any positive items within their inventory."
               },
               "Wing Tear": {
                  "charges": 0,
                  "rarity": "Not an Any Ability",
                  "effect": "Gain a charge after surviving a majority vote or attack. Select someone, upon dying, drag them to death with you. You can use your abilities, coins & items when dead, along with their abilities, coins and items too. Suicides do not give charges. This cannot gain charges out of its main condition, other than empower - which breaks on use."
               }
            },
            "perks": {
               "Halo-less": "Positive effects on you can be turned into equally powerful negatives, and put on a person of choice.",
               "Forsaken Already": "Curses on you act as heals while active. It will not kill you upon its end. Death curses will additionally act as elimination protection till hit/gone.",
               "Spiteful": "Upon dying without successfully using Wing Tear - all negatives acquired throughout the game, will be put onto your killer[s] [spread out if voted]."
            },
            "achievements": {
               "Master Forsaken Angel": "Obtain all Forsaken Angel achievements.",
               "Blood Web": "Use Wing Tear on 2 different people.",
               "Abyssal Bindings": "Successfully use Blackened Chains 4 times.",
               "Painful Exchange": "Swap 3 positives into negatives."
            }
        },
        "Gatekeeper": {
            "alignment": "Evil",
            "description": "You've always been taking in prisoners, whether they're sickly evil or perfectly innocent and abusing your power by using them. You like to stop your threats by putting them through misery and pain instead of killing them.",
            "abilities": {
               "Restrain": {
                  "charges": 2,
                  "rarity": "Uncommon",
                  "effect": "Restrain someone, giving them Restrained. Removes any other status effect they have apart from Cursed. Will be removed on your death. If Gatekeeper"
               },
               "Force Ability": {
                  "charges": 7,
                  "rarity": "Uncommon",
                  "effect": "Force your prisoner to use any of their abilities on any player."
               },
               "Release": {
                  "charges": 2,
                  "rarity": "Not an Any Ability",
                  "effect": "Select someone, removing Restrained from them."
               }
            },
            "perks": {
               "Armoured": "Immune to Restrained, Paralysed and Frozen",
               "Preserved": "Items cannot be stolen. It will notify anyone who tries to steal them that they had no items.",
               "Spare Cuffs": "If someone is inflicted with Restrained, you can use your abilities on them as if they are a prisoner."
            },
            "achievements": {
               "Master Gatekeeper": "Obtain all Gatekeeper achievements.",
               "Kevlar": "Have Armoured save you from all 3 statuses.",
               "Forced Trigger": "Kill someone using Force Ability.",
               "Enslaver": "Never choose to release someone from your Restrain."
            }
        },
        "Hacker": {
            "alignment": "Evil",
            "description": "You love hacking, and you will try to hack as much as possible to survive, it's your only choice. You can really change results of things, you can mess up anyone you want.",
            "abilities": {
               "False Result": {
                  "charges": 4,
                  "rarity": "Uncommon",
                  "effect": "Choose three targets, for the next elimination, if your first target votes your second target, they instead vote your third target."
               },
               "Troll": {
                  "charges": 1,
                  "rarity": "Epic",
                  "effect": "For the upcoming elimination, you become immune to votes but votes on any of your allies are now doubled. Your allies cannot leave the alliance until after the elimination. Must be used 6h before elim."
               },
               "Silence": {
                  "charges": 2,
                  "rarity": "Common",
                  "effect": "Give a player Blackmailed."
               },
               "Disable": {
                  "charges": 2,
                  "rarity": "Common",
                  "effect": "Give someone Disabled. Removes any other status effects apart from Cursed. This effect is removed from anyone who has it when you die."
               }
            },
            "perks": {
               "Escapist": "Immune to Disabled and Blackmailed."
            },
            "achievements": {
               "Master Hacker": "Obtain all Hacker achievements.",
               "Escape Artist": "Have someone try to Disable or Blackmail you.",
               "Corruption": "Have all 4 false results cause someone to get eliminated.",
               "Owned": "Have a teammate die to Troll."
            }
        },
        "Highwayman": {
            "alignment": "Evil",
            "description": "You're a crazy bandit who goes to insane levels of crazy to make things go your way and increasing your chance of survival.",
            "abilities": {
               "Ruthless Murder": {
                  "charges": 1,
                  "rarity": "Not an Any Ability",
                  "effect": "Reveal your role and shoot someone of your choice. If you kill someone with the same alignment as you, you will be Despaired and cannot use any of your own abilities. This uses up Armed Friend as well."
               },
               "Hold-up": {
                  "charges": 2,
                  "rarity": "Epic",
                  "effect": "Threaten to kill someone, they can either accept death, give you all their money or all of their items. The target cannot act until decision is made. Cannot select the same target within 12h. "
               },
               "Armed Friend": {
                  "charges": 1,
                  "rarity": "Not an Any Ability",
                  "effect": "You give somebody Ruthless Murder but you cannot use it after."
               },
               "Bloody Escape": {
                  "charges": 1,
                  "rarity": "Rare",
                  "effect": "Choose a person to hide behind permanently. If you're attacked, they will attack your target instead. The person you hide behind will appear as Highwayman if investigated."
               }
            },
            "perks": {
               "Suspicious": "If someone in your alliance is investigated they will investigate you instead."
            },
            "achievements": {
               "Master Highwayman": "Obtain all Highwayman achievements.",
               "Red Handed": "Successfully use ruthless murder.",
               "Held": "Successfully hold-up someone.",
               "Meat Shield": "Successfully have bloody escape save you."
            }
        },
        "Hunter": {
            "alignment": "Evil",
            "description": "You've hid in the shadows, waiting to strike at the right times to benefit yourself. Your life is made of isolation and making risks.",
            "abilities": {
               "Mask": {
                  "charges": 3,
                  "rarity": "Common",
                  "effect": "Select someone, giving them a mask which makes all information about them hidden."
               },
               "Hunt": {
                  "charges": 1,
                  "rarity": "Not an Any Ability",
                  "effect": "Guess someone's role. If nobody alive has investigated them and found their exact role, their role is revealed to everyone and you kill them. If hunt fails, you become Blackmailed."
               },
               "Scent Marker": {
                  "charges": 1,
                  "rarity": "Rare",
                  "effect": "Mark someone with a special scent, when they die, you gain a Stack for Thrill of the Hunt and gain another charge for Scent Marker."
               }
            },
            "perks": {
               "Thrill of the Hunt": "Gain a Stack every time somebody dies with your Scent Marker.\n1 Stack = Gain +1 Luck.\n2 Stacks = Gain a charge for Mask.\n3 Stacks = Mask now cures status effects.\n4 Stacks = Your vote becomes 2.\n5 Stacks = You become immune to attacks.\n6 Stacks = First vote against you is null.\n7+ Stacks = Gain coins equal to 50 times your stack count."
            },
            "achievements": {
               "Master Hunter": "Obtain all Hunter achievements.",
               "Hunter's trophy": "Gain 7 stacks on Thill of the Hunt.",
               "Predator": "Kill someone using Hunt.",
               "Faade": "Successfully have your mask stop detection."
            }
        },
        "Imp": {
            "alignment": "Evil",
            "description": "A trickster of the demonic world, looking for fun!",
            "abilities": {
               "Mischief": {
                  "charges": 3,
                  "rarity": "Rare",
                  "effect": "Reverse someone's coin percentage for 48 hours. If you are Imp, gain a charge for every 2 times you use Luck Up."
               },
               "Luck Up": {
                  "charges": 2,
                  "rarity": "Uncommon",
                  "effect": "Select someone giving them lucky, if they have lucky, give them unlucky and restrained. If you are Imp, gain a charge of this every time someone you have visited before dies."
               },
               "Gathering Trick": {
                  "charges": 1,
                  "rarity": "Epic",
                  "effect": "Select someone, steal all coin percentages and positive statuses from them and their alliance members for next coin phase. You get half the coin bonus % stolen."
               },
               "Impish Grin": {
                  "charges": 2,
                  "rarity": "Rare",
                  "effect": "Select someone, doubling their current coin bonus until next coin phase. Cannot self select."
               }
            },
            "perks": {
               "Background Laughter": "If someone puts a negative status on you or an ally, you'll know who did it, and when using Mischief on them, they'll gain the same status back.",
               "Trickster": "Upon being investigated in any way shape or form, you will know and can decide to 0 their coin bonuses for next coin phase. Mass invest effects do not activate this.",
               "Money Dump": "Any coins people lose due to your abilities, you gain.",
               "Chaotic Nature": "You are immune to Despaired and Paralysed",
               "Double Edged Smile": "Upon death, pick someone. If you died via elimination and the selected had voted you, double all votes upon them from your original allies and their allies. If you died via an ability/item and the selected is who attacked you, strip them of all positive effects and inflict them with any of your remaining abilities of  choice - using up charges."
            },
            "achievements": {
               "Master Imp": "Obtain all Imp achievements.",
               "Mania": "At any point have a total of +100% coin bonuses due to gathering trick.",
               "Broke": "Get someone to -100% or more coin bonuses.",
               "Yoink": "Gain a total of atleast 100 coins via Money Dump."
            }
        },
        "Jester": {
            "alignment": "Evil",
            "description": "Your whole life is a joke. You're such a worthless being that all you do is spread chanting and haunting laughters.",
            "abilities": {
               "Jokester": {
                  "charges": 2,
                  "rarity": "Common",
                  "effect": "Give someone Despaired, removing all other status effects other than cursed. Lasts until you die."
               },
               "Depressing Ballad": {
                  "charges": 1,
                  "rarity": "Rare",
                  "effect": "Select a target, everyone within their alliance will be inflicted with Paralyzed and Despaired for 24 hours."
               },
               "Entire Circus": {
                  "charges": 1,
                  "rarity": "Epic",
                  "effect": "Everyone who has visited you or a current ally during the game will have their vote count as 0 if it's placed on you, and you will give them Blackmailed upon the elimination phase ending."
               }
            },
            "perks": {
               "Last Laugh": "Upon elimination, everyone who voted you will become Despaired. If you got the most votes but survived, they will all become Despaired for the next 24 hours, and remove despair immunity from anyone who had it, permanently - you learn the roles that lost immunity.",
               "Party Trick": "If you gain a negative status, you will share it with all visitors while its active on you. You can turn this off.",
               "Loose Noose Lasso": "If attacked, redirect it to a random despaired person, if this fails, your killer will become despaired and blackmailed. If immune to these, remove the immunity only."
            },
            "achievements": {
               "Master Jester": "Obtain all Jester achievements.",
               "Circus Show": "Have Entire Circus blackmail 5 people.",
               "Jest a prank": "Activate Last Laugh and survive.",
               "Spread the Love": "Have Party trick share the Despair status."
            }
        },
        "Juggernaut": {
            "alignment": "Evil",
            "description": "You're a beast, and all you do is become more powerful as the days go by, but you also become more evil and more of a threat to those around you.",
            "abilities": {
               "Peek of the Grave": {
                  "charges": 0,
                  "rarity": "Uncommon",
                  "effect": "Find the exact role of a player who is dead. If Juggernaut - Gain an extra use for Peek of the Living when used."
               },
               "Peek of the Living": {
                  "charges": 1,
                  "rarity": "Uncommon",
                  "effect": "Find the exact role of a player. If Juggernaut -  When the player you investigated dies, you gain an extra use for Peek of the Grave."
               },
               "Resilient Aura": {
                  "charges": 1,
                  "rarity": "Legendary",
                  "effect": "If you are voted to be eliminated next elimination, a player of your choice instead will be eliminated. You stay anonymous during this. If successful, you become immune to the next Elimination too."
               }
            },
            "perks": {
               "Power Up": "When 85% players are left you get: Cursed immunity, +1 inventory space, +1 item per item rain, and 25% added coin bonus.",
               "Power Up Mega": "When 60% players are left you get: Cursed, Frozen & Paralysed immunity, +2 inventory space, +2 items per item rain, 50% added coin bonus and your vote counts as 2. Disables Power Up if active.",
               "Final Gambit": "When 30% players are left you get: Immunity to bad status effects, death immunity, +2 inventory space, +2 items per item rain, 50% added coin bonus and your vote counts as 3. Disables Power Up & Power Up Mega if active."
            },
            "achievements": {
               "Master Juggernaut": "Obtain all Juggernaut achievements.",
               "Peeping Tom": "Use Peek of the Living and Grave 5 times in a game.",
               "Unstoppable": "Have all perks activate.",
               "Ping pong": "Use Resilient Aura to eliminate one of your voters."
            }
        },
        "Overlord": {
            "alignment": "Evil",
            "description": "You're extreme. You're the leader of all evil, you have power over all the evil, you're what created the word evil. And evil is how you survive.",
            "abilities": {
               "Demon Hunt": {
                  "charges": 9,
                  "rarity": "Common",
                  "effect": "Find out if a player is evil or not."
               },
               "Reanimate": {
                  "charges": 1,
                  "rarity": "Legendary",
                  "effect": "Reanimate a dead player and be able to use any abilities they didn't use."
               },
               "Discover": {
                  "charges": 1,
                  "rarity": "Rare",
                  "effect": "Find the exact role of a player ignoring everything."
               }
            },
            "perks": {
               "Evil Aura": "You get x1.5 higher Immunity Card chances and +2 Luck if everyone in your alliance is not opposite your alignment.",
               "Legion": "You may have 1 additional person in your alliance, should you choose to allow it.",
               "Seize": "You'll find out your alliance gets an Immunity Card before everyone else and may choose to take it without anyone knowing."
            },
            "achievements": {
               "Master Overlord": "Obtain all Overlord achievements.",
               "Hunting Haul": "Find 9 or all evil players in a game.",
               "Uniquely Deceased": "Use a non-AA with reanimate.",
               "All for One": "Successfully Seize an immunity card."
            }
        },
        "Phantom": {
            "alignment": "Evil",
            "description": "Inflicting special curses on many, the days go by, their life ticks down.",
            "abilities": {
               "Abyssal Curse": {
                  "charges": "inf",
                  "rarity": "Epic",
                  "effect": "Select someone, gain a use of this every day. The person will suffer the longer the curse is on them. Refer to perks."
               },
               "Shadowed Hands": {
                  "charges": 1,
                  "rarity": "Rare",
                  "effect": "Speed up all Abyssal effected by a day. Gain a charge if someone dies once past/at 6 days."
               },
               "Abyssal Blessings": {
                  "charges": "inf",
                  "rarity": "Common",
                  "effect": "Free someone of choice from the Abyssal curse, giving them lucky."
               }
            },
            "perks": {
               "Abyssal Cursing": "The longer it goes on, the more they suffer:\n0 Days - Inflict a status of choice [excluding DC/Emp].\n1 Day - Inflicted with 2 statuses of choice [^] that they are not immune to, if immune to all, remove 2 immunities.\n[Cannot inflict blackmail twice in a row to the same target]\n2 Days - Their actions have a 10% chance to effect someone random.\n3 Days - They have a ability degraded of their choice. \n4 Days - They have a  perk degraded of their choice. 10% more chance to effect someone random.\n5 Days - All abilities, including AAs are degraded.\n6 Days - All perks are degraded. 10% more chance to effect someone random.\n7 Days - Completely wipe their coins and items. 20% more chance to effect someone random.\n8 Days - Their entire role and AAs are disabled. \n9 Days+ - Additional 10% per day to effect someone random.",
               "Abyssal Bound": "Abyss curse victims cannot vote you from Day 2+.",
               "Phantom's Grasp": "If you die, all abyssal curses will stop functioning, but will come back if you are revived.",
               "Abyssal Shadow": "You may gain the investigation results of an abyssal cursed person of choice."
            },
            "achievements": {
               "Master Overlord": "Obtain all Overlord achievements.",
               "Hunting Haul": "Find 9 or all evil players in a game.",
               "Uniquely Deceased": "Use a non-AA with reanimate.",
               "All for One": "Successfully Seize an immunity card."
            }
        },
        "Psychotherapist": {
            "alignment": "Evil",
            "description": "A name given to those who help psychos and the like",
            "abilities": {
               "Gaslighted Discussion": {
                  "charges": 3,
                  "rarity": "Rare",
                  "effect": "Select someone, inflicting despair and disable, but also giving elimination immunity. Next elimination they will have x2 votes against them."
               },
               "Silver-Tongue": {
                  "charges": 3,
                  "rarity": "Uncommon",
                  "effect": "Select someone, inflicting despair and disable."
               },
               "Ignorance Bubble": {
                  "charges": 1,
                  "rarity": "Rare",
                  "effect": "Your alliance blocks votes from outside of the alliance. Everyone in your alliance other than you has votes on them worth x5."
               }
            },
            "perks": {
               "Strong Manipulator": "You ignore alliance-wide negative abilities.",
               "Abusive": "If someone uses a negative item on you more than once, inflict paralysis and burn on them, along with finding out their identity.",
               "Corruption": "Each time you save someone with your abilities, gain +3 luck. Each time your abilities assist in killing someone, gain +30% coins.",
               "Watchful Eye": "The second time and onwards somebody votes for you; you will be told their identity after the elimination."
            },
            "achievements": {
               "Master Psychotherapist": "Obtain all Psychotherapist achievements."
            }
        },
        "Slaughterer": {
            "alignment": "Evil",
            "description": "Puts the laughter in slaughter.",
            "abilities": {
               "Double Edged": {
                  "charges": 1,
                  "rarity": "Not an Any Ability",
                  "effect": "Select 2 people, both will be forced into a public duel, much like that of an excal duel. The first 2 rounds cannot get external help effects. You claim the coins, items and AAs of whoever dies, potentially both. If Slaughterer - if you enter the duel yourself, your opponent will have external help do nothing for them."
               },
               "Skinning": {
                  "charges": 2,
                  "rarity": "Rare",
                  "effect": "Select someone, stripping them of all their AA's, you gain a random one."
               },
               "Bone Breaker": {
                  "charges": 1,
                  "rarity": "Rare",
                  "effect": "Smash someone up, giving unlucky, burning, paralysing, disable, frozen, despairing and restraining them. The permanent effects are removed when you die."
               },
               "Corpse Shield": {
                  "charges": 1,
                  "rarity": "Uncommon",
                  "effect": "Pick someone, once they die, they will take any hits from lethal actions for you for 1 hit. Upon target hit, regain a charge if you are Slaughterer."
               }
            },
            "perks": {
               "Freakish Nature": "Your non-aligned allies do not gain any luck in your alliance, you instead have theirs added to yours. This is added before your own lucky/unlucky but after their lucky/unlucky/perk calculations.",
               "Blood Luster": "Killing items cannot kill you when you use them, and can be manipulated by you to a degree.",
               "Body Count": "Each time you murder someone / cause a murder, gain an immunity of choice, including 1 time elim immunity, along with +30% coin bonuses."
            },
            "achievements": {
               "Master Slaughterer": "Obtain all Slaughterer achievments.",
               "Meat Shield": "Successfully redirect 2 attacks through the use of Corpse Shield.",
               "Last Laugh": "Murder someone with Double Edged.",
               "Flayed": "Destroy 5 AA's with the use of Skinning."
            }
        },
        "Threatener": {
            "alignment": "Evil",
            "description": "Your only way of living is by threatening over people to do what you want.",
            "abilities": {
               "Steal": {
                  "charges": 3,
                  "rarity": "Rare",
                  "effect": "If player you chose has any items, you will take them all."
               },
               "Shutdown": {
                  "charges": 1,
                  "rarity": "Epic",
                  "effect": "Target a player, blackmail them and prevent their alliance from voting at the next elimination."
               },
               "Redirect": {
                  "charges": 3,
                  "rarity": "Uncommon",
                  "effect": "Redirect a player to visit a player of your choice next time they visit somebody. They will not be informed."
               },
               "Survivalists Threaten": {
                  "charges": 1,
                  "rarity": "Epic",
                  "effect": "Prevent two players from voting two players of your choice for the next elimination. Can prevent players from voting yourself."
               }
            },
            "perks": {
               "Dealer": "Allows you to transfer coins to somebody. Anyone in the Threatener's alliance can also transfer money to each other. The Threatener can choose who within the alliance can do this.",
               "Broker": "Has +2 item count."
            },
            "achievements": {
               "Master Threatener": "obtain all Threatener achievements.",
               "Thief": "Steal a total of 5 items.",
               "Bully": "Shutdown an alliance with a member that was voting you.",
               "Takeover": "Use Survivalist's Threaten in the Final 5 or lower."
            }
        },
        "Witchdoctor": {
            "alignment": "Evil",
            "description": "You were born with crazy magicial healing powers, but instead of making good use of them, you decided you abuse them. Your abusing has made you into a devious Sorcereress who causes chaos and disruption.",
            "abilities": {
               "Soul Binding": {
                  "charges": 1,
                  "rarity": "Legendary",
                  "effect": "Choose 2 players. Those players are now connected, and if one of them dies the other does too. All status ailments/effects and buffs are shared as well. Link is broken when you die."
               },
               "Voodoo Doll": {
                  "charges": 1,
                  "rarity": "Legendary",
                  "effect": "Make a Voodoo Doll of someone, anything that happens to you will also happen to them, aside from receiving votes and being eliminated. This Voodoo Doll becomes an item in your inventory and whoever holds the item has this power."
               },
               "Hex": {
                  "charges": 1,
                  "rarity": "Epic",
                  "effect": "Whoever is affected by the Hex, can use their next item twice. You cannot loop this ability via empower giving items."
               }
            },
            "perks": {
               "Insane": "You cannot become Despaired, Drunk or Blackmailed.",
               "Magic Mind": "Your actions and votes cannot be controlled by anyone or anything."
            },
            "achievements": {
               "Master Witchdoctor": "Obtain all Witchdoctor achievements.",
               "Blood Bound": "Kill someone via Soul Binding.",
               "Hexed": "Have someone use an item twice due to your Hex.",
               "Play Time": "Transfer 3 effects due to Voodoo Doll."
            }
        },
        "Ball": {
            "alignment": "Ball",
            "description": "Let's get rolling, let's get going, once it's rolling, you can't stop it-",
            "abilities": {
                "Rolling": {
                    "charges": "inf",
                    "rarity": "Rare",
                    "effect": "Send a notification to the game that a ball is rolling. Gain immunity to a status of choice, and +1 vote power at the next elimination. 12 hour cooldown."
                },
                "Bouncing ": {
                    "charges": 1,
                    "rarity": "Not an Any Ability",
                    "effect": "It will be publically announced that *you* are the ball, however 12 hours from using this ability, you gain permanent death immunity."
                },
                "Speed Up": {
                    "charges": "inf",
                    "rarity": "Epic",
                    "effect": "Activates once you have used bouncing, +1 vote power permanently. 24 hour cool down."
                }
            },
            "perks": {
                "Obviously a Ball": "You cannot obtain investigation immunity in any way.",
                "Uncontrolable": "Once you have used bouncing, your actions cannot be redirected or blocked in any way."
            },
            "achievements": {
                "Master Ball": "Obtain all Ball achievements."
             }
        },
        "Executioner": {
            "alignment": "Traveller",
            "description": "Off with their head.",
            "abilities": {
                "Half-Swording":  {
                    "charges": 2,
                    "rarity": "Not an Any Ability",
                    "effect": "Select someone, if they attempt to harm you, you will render them unable to act for 12 hours."
                },
                "Hand Off":  {
                    "charges": "inf",
                    "rarity": "Not an Any Ability",
                    "effect": "You may decide to give whoever is most in the lead in your chosen requirement for end elimination, the ability to pick who dies instead of yourself. They can also choose to kill you instead, bypassing your elim immunity."
                }
            },
            "perks": {
                "Exectuioner's Blade": "While alive, every elimination is a double elimination, but the 2nd elimination will have candidates put up for you to pick from, based on terms you put up at day start. You do not need to kill someone.",
                "Pen & Blade": "You may not vote, you learn who is voting you. You survive one elimination. You may publicly reveal who voted you upon your death.",
                "Intimidating Aura": "You may join alliances, not taking up a slot. You increase immunity card chances by 1.25, but you decide who gets it, based on whom in the alliance is top of the previous requirement (top 50% of alliance)."
            },
            "achievements": {
                "Master Exectuioner": "Obtain all Exectuioner achievements."
            }
        },
        "Merchant": {
            "alignment": "Traveller",
            "description": "I'm here to talk to you about your car's extended warranty.",
            "abilities": {
                "The Deal":  {
                    "charges": "inf",
                    "rarity": "Not an Any Ability",
                    "effect": "Players may start trades with you for your items. You may trade what you deem to be of equal value. "
                },
                "Swindle":  {
                    "charges": 3,
                    "rarity": "Not an Any Ability",
                    "effect": "Upon use, the next deal received, you may totally rip the person off. "
                }
            },
            "perks": {
                "Bribery Benefits": "Your vote is worth 2, you may vote 3 times, but only with whoever gave you the most in:\nMoney (coin total)\nItems (based on value)\nAbilities (based on positiveness/rarity)\nPeople may hand you money and aas freely. Draws mean neither get it, and every new day the totals are reset.",
                "Many Wares": "You have infinite inventory space. You gain 2 items every day and start with 6 items. Your luck is randomly between 5-15 every time it is rolled.",
                "Cargo Cart": "You may join multiple alliances not taking a slot. Alliance members have -25% luck but gain 1-2 additional items in item rains, and -50% luck in power drops but gain an additional aa.",
                "Banker's Jeaolusy": "While alive all shop items cost 10% more. You may make 2 items you have cost 25% more."
            },
            "achievements": {
                "Master Merchant": "Obtain all Merchant achievements."
            }
        }
    }
}
