{
    "statuses": {
        "Cursed": {
            "effect": "If this isn't removed within three days, you will die.",
            "upgrade": "",
            "degrade": ""
        },
        "Frozen": {
            "effect": "You can't use any abilities until you thaw out. 1/3 chance you'll thaw every day. Thaws out in 3 days if not thawed out.",
            "upgrade": "",
            "degrade": ""
        },
        "Paralyzed": {
            "effect": "You have a 48 hour cooldown before you can use another ability and item. Permanent until cured.",
            "upgrade": "",
            "degrade": ""
        },
        "Burned": {
            "effect": "Every 24 hours from when you're inflicted, you will lose an item from rarity descending. You cant pass items whilst burning Permanent until cured.",
            "upgrade": "",
            "degrade": ""
        },
        "Empowered": {
            "effect": "You can use any one of your abilities for 2 days, even if you ran out of them. When you use an ability, it's a 12 hour cooldown before you can use another (this cooldown applies even if Empower is lost and reapplied). Using a killing ability will make you lose Empowered on use.",
            "upgrade": "",
            "degrade": ""
        },
        "Drunk": {
            "effect": "25% chance to target a random person instead when using an item or an ability. Wears off after 48 hours. This effect stacks.",
            "upgrade": "",
            "degrade": ""
        },
        "Restrained": {
            "effect": "Cannot use abilities. If Restrained by the Gatekeeper, forced to use the abilities they use on you. Permanent until cured.",
            "upgrade": "",
            "degrade": ""
        },
        "Disabled": {
            "effect": "You can't vote at the Elimination Phases. Permanent until cured.",
            "upgrade": "",
            "degrade": ""
        },
        "Blackmailed": {
            "effect": "You can't talk for a day and you can't vote at that Elimination Phase. Removes after 24 hours.",
            "upgrade": "",
            "degrade": ""
        },
        "Despaired": {
            "effect": "You always vote for yourself during an Elimination Phase.",
            "upgrade": "",
            "degrade": ""
        },
        "Lucky": {
            "effect": "Your coins value is now x1.5 your regular coins value and your luck is doubled. Permanent until you gain a new status effect.",
            "upgrade": "",
            "degrade": ""
        },
        "Unlucky": {
            "effect": "Your coins bonus is halved and your luck is halved. Permanent until you gain a new status effect.",
            "upgrade": "",
            "degrade": ""
        }
    },
    "items": {
        "Cursed Shadow": {
            "rarity": "Common",
            "cost": 1000,
            "effect": "Inflict a player of your choice with Cursed.",
            "upgrades": [
                "Inflict a player of your choice with a 2 day Cursed.",
                "Inflict 2 players of your choice with Cursed."
            ],
            "targeting": "Single",
            "actionTypes": ["Negative", "Status"],
            "additionalInfo": ""
        },
        "Ice Wand": {
            "rarity": "Common",
            "cost": 1000,
            "effect": "Inflict a player of your choice with Frozen.",
            "upgrades": [
                "Inflict a player of your choice with a 4 day Frozen.",
                "Inflict 2 players of your choice with Frozen.",
                "Inflict a player of your choice with a 1/4 thawing chance Frozen."
            ],
            "targeting": "Single",
            "actionTypes": ["Negative", "Status"],
            "additionalInfo": ""
        },
        "Lightning Staff": {
            "rarity": "Common",
            "cost": 1000,
            "effect": "Inflict a player of your choice with Paralyzed.",
            "upgrades": [
                "Inflict a player of your choice with Paralysed that has a 96 hour cooldown.",
                "Inflict 2 players of your choice with Paralysed."
            ],
            "targeting": "Single",
            "actionTypes": ["Negative", "Status"],
            "additionalInfo": ""
        },
        "Flint & Steel": {
            "rarity": "Common",
            "cost": 1000,
            "effect": "Inflict a player of your choice with Burned.",
            "upgrades": [
                "Inflict a player of your choice with 12 hour Burned.",
                "Inflict 2 players of your choice with Burned."
            ],
            "targeting": "Single",
            "actionTypes": ["Negative", "Status"],
            "additionalInfo": ""
        },
        "Doggo Treat": {
            "rarity": "Common",
            "cost": 400,
            "effect": "If you feed your Doggo a treat, it will be more loyal and give more useful information more often. You can also consume it yourself which gives you 200 coins.",
            "upgrades": [
                "If you feed your Doggo a treat, it will be more loyal and give more useful information more often. You can also consume it yourself which gives you 400 coins.",
                "If you feed your Doggo a treat, it will be more loyal and give more useful information more often. You can also consume it yourself which gives you 200 coins. Worth x2 on doggo loyalty"
            ],
            "targeting": "Self",
            "actionTypes": ["Positive"],
            "additionalInfo": "A Doggo starts with a 1/11 chance to give useful information. Each treat increases the odds by 1/11 to a max of 100%"
        },
        "Beer": {
            "rarity": "Common",
            "cost": 1000,
            "effect": "Inflict a player of your choice with Drunk.",
            "upgrades": [
                "Inflict 2 players of your choice with Drunk.",
                "Inflict a player of your choice with 2 stack Drunk"
            ],
            "targeting": "Single",
            "actionTypes": ["Negative", "Status"],
            "additionalInfo": ""
        },
        "Seed": {
            "rarity": "Common",
            "cost": 500,
            "effect": "Plant a seed, every 36 hours you'll gain a 5% coin bonus for every seed planted. At 50%, fertilizers will not double the seed %, and instead give 5%.",
            "upgrades": [],
            "targeting": "Self",
            "actionTypes": ["Positive"],
            "additionalInfo": ""
        },
        "Money Bag": {
            "rarity": "Common",
            "cost": 0,
            "effect": "Gives you 500 coins.",
            "upgrades": [
                "Gives you 1000 coins.",
                "Gives you and someone else of choice 500 coins."
            ],
            "targeting": "Self",
            "actionTypes": ["Positive"],
            "additionalInfo": ""
        },
        "Role Scanner": {
            "rarity": "Common",
            "cost": 1000,
            "effect": "Receive seven roles your target could be, with one being their actual role. The other six roles are selected by how that player has been acting throughout the game.",
            "upgrades": [
                "Receive seven roles your target could be, with one being their actual role. The other six roles are selected by how that player has been acting throughout the game, and all in the same alignment.",
                "Receive six roles your target could be, with one being their actual role. The other five roles are selected by how that player has been acting throughout the game.",
                "Receive seven roles your 2 targets could be, with one being their actual role (seperate list for each target). The other six roles are selected by how that player has been acting throughout the game."
            ],
            "targeting": "Single",
            "actionTypes": ["Neutral"],
            "additionalInfo": ""
        },
        "Status Scanner": {
            "rarity": "Common",
            "cost": 1000,
            "effect": "Tells you any and all status effects your target currently has.",
            "upgrades": [
                "Tells you any and all status effects your 2 targets have (seperate status list for each target)."
            ],
            "targeting": "Single",
            "actionTypes": ["Neutral"],
            "additionalInfo": ""
        },
        "Immunity Scanner": {
            "rarity": "Common",
            "cost": 1500,
            "effect": "Tells you any and all immunities your target currently has.",
            "upgrades": [
                "Tells you any and all immunities your 2 targets have (seperate immunity list for each target)."
            ],
            "targeting": "Single",
            "actionTypes": ["Neutral"],
            "additionalInfo": ""
        },
        "Tip": {
            "rarity": "Common",
            "cost": 200,
            "effect": "Gives you a relatively useful piece of information you may find useful.",
            "upgrades": [
                "Gives you a relatively useful piece of information you may find useful. Can be sold for 100 coins.",
                "Gives you a relatively useful piece of information you may find useful. You pick what info it gives."
            ],
            "targeting": "Self",
            "actionTypes": [],
            "additionalInfo": "Each tip has a 1/10 chance of giving useful information of the host's choice."
        },
        "Hangover Pills": {
            "rarity": "Common",
            "cost": 750,
            "effect": "Removes one stack of the Drunk status effect on use.",
            "upgrades": [],
            "targeting": "Single",
            "actionTypes": ["Positive"],
            "additionalInfo": ""
        },
        "Cheque": {
            "rarity": "Common",
            "cost": 500,
            "effect": "Allows you to transfer coins to another player.",
            "upgrades": [],
            "targeting": "Single",
            "actionTypes": [],
            "additionalInfo": "Cannot be duplicated via soul bind or similar effects."
        },
        "Aura Veil": {
            "rarity": "Common",
            "cost": 1000,
            "effect": "Choose a negative status effect to become immune to. When inflicted or attempted to be inflicted with a negative status effect, this effect wears off.",
            "upgrades": [
                "Choose a negative status effect to become immune to. When inflicted or attempted to be inflicted with a negative status effect 2 times, this effect wears off.",
                "Choose 2 negative status effects to become immune to. When inflicted or attempted to be inflicted with a negative status effect, this effect wears off."
            ],
            "targeting": "Self",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Decurse": {
            "rarity": "Uncommon",
            "cost": 750,
            "effect": "Removes the Cursed status effect on use.",
            "upgrades": [
                "Removes the Cursed status effect on use from 2 people of choice.",
                "Removes the Cursed status effect on use for everyone in your alliance.",
                "Removes the Cursed status effect and one other status of your choice on use."
            ],
            "targeting": "Single",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Thaw Claw": {
            "rarity": "Uncommon",
            "cost": 750,
            "effect": "Removes the Frozen status effect on use.",
            "upgrades": [
                "Removes the Frozen status effect on use from 2 people of choice.",
                "Removes the Frozen status effect on use for everyone in your alliance.",
                "Removes the Frozen status effect and one other status of your choice on use."
            ],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Nerve Master": {
            "rarity": "Uncommon",
            "cost": 750,
            "effect": "Removes the Paralyzed status effect on use.",
            "upgrades": [],
            "targeting": "",
            "actionTypes": [
                "Removes the Paralyzed status effect on use from 2 people of choice.",
                "Removes the Paralyzed status effect on use for everyone in your alliance.",
                "Removes the Paralyzed status effect and one other status of your choice on use."
            ],
            "additionalInfo": ""
        },
        "Fertilizer": {
            "rarity": "Uncommon",
            "cost": 1500,
            "effect": "Double all seed giving % in alliance. If 0%, add 10%.",
            "upgrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Holy Water": {
            "rarity": "Uncommon",
            "cost": 750,
            "effect": "Removes the Burned status effect on use. Cannot be burnt.",
            "upgrades": [
                "Removes the Burned status effect on use from 2 people of choice. Cannot be burnt.",
                "Removes the Burned status effect on use for everyone in your alliance. Cannot be burnt.",
                "Removes the Burned status effect and one other status of your choice on use. Cannot be burnt."
            ],
            "targeting": "Single",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Jailbreaking Device": {
            "rarity": "Uncommon",
            "cost": 1000,
            "effect": "Removes the Disabled status effect on use.",
            "upgrades": [
                "Removes the Disabled status effect on use from 2 people of choice.",
                "Removes the Disabled status effect on use for everyone in your alliance.",
                "Removes the Disabled status effect and one other status of your choice on use."
            ],
            "targeting": "Single",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Lillie's Blood": {
            "rarity": "Uncommon",
            "cost": 1500,
            "effect": "Makes a person of choice immune to status effects for 2 days. Suppresses current statuses and their timers.",
            "upgrades": [
                "Makes a person of choice immune to status effects for 3 days. Suppresses current statuses and their timers.",
                "Makes a person of choice immune to status effects for 2 days. Cures current statuses.",
                "Makes two people of choice immune to status effects for 2 days. Suppresses current statuses and their timers."
            ],
            "targeting": "Single",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Vortex Liquid": {
            "rarity": "Uncommon",
            "cost": 1000,
            "effect": "Gives you 1/X chance of being immune to elimination, rolls on day start and use until triggered. X = Living participants.",
            "upgrades": [
                "Gives you 1/X chance of being immune to elimination, rolls on day start and use until triggered twice. X = Living participants.",
                "Gives you 2/X chance of being immune to elimination, rolls on day start and use until triggered twice. X = Living participants."
            ],
            "targeting": "Self",
            "actionTypes": [],
            "additionalInfo": "Living participants includes reanimated players and excludes buried alive players."
        },
        "Iron Ball": {
            "rarity": "Uncommon",
            "cost": 0,
            "effect": "Does absolutely nothing but takes up an item slot and cannot be used. Removes after 48 hours.",
            "upgrades": [
                "Does absolutely nothing but takes up an item slot and cannot be used. Removes after 72 hours.",
                "Does absolutely nothing but takes up an item slot and cannot be used. Removes after 24 hours.",
                "Does absolutely nothing but takes up an item slot and can be used, passing it to another player. Removes after 72 hours."
            ],
            "targeting": "Not Applicable",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Down Syndromer": {
            "rarity": "Uncommon",
            "cost": 1200,
            "effect": "Inflict a player of your choice with Disabled for 24 hours.",
            "upgrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Imprisoning Key": {
            "rarity": "Uncommon",
            "cost": 1500,
            "effect": "Inflict a player of your choice with Restrained for 24 hours.",
            "upgrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Sad Story": {
            "rarity": "Uncommon",
            "cost": 1500,
            "effect": "Inflict a player of your choice with Despaired for 24 hours.",
            "upgrades": [
                "Inflict a player of your choice with Despaired and another negative status of your choice for 24 hours.",
                "Inflict 2 players of your choice with Despaired for 24 hours.",
                "Inflict a player of your choice with Despaired for 48 hours."
            ],
            "targeting": "Single",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Duct Tape": {
            "rarity": "Uncommon",
            "cost": 1800,
            "effect": "Inflict a player of your choice with Blackmailed.",
            "upgrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Catapult": {
            "rarity": "Uncommon",
            "cost": 2500,
            "effect": "Fire an item of choice at someone else - will destroy the item and an item of same rarity in their inventory, if not present, destroys the next closest tier item that is lower.",
            "upgrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Magnetic Cuffs": {
            "rarity": "Uncommon",
            "cost": 2500,
            "effect": "Select 2 people, they will now be forced to stay in the same alliance if already together, if not in the same alliance, they will be unable to join the same alliance. Can be removed with Jailbreaking device",
            "upgrades": [
                "Select 3 people - they will now be forced to stay in the same alliance if already together, if not in the same alliance, they will be unable to join the same alliance. Can be removed with Jailbreaking device"
            ],
            "targeting": "Multiple (2)",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Ankh": {
            "rarity": "Uncommon",
            "cost": 750,
            "effect": "Give yourself or someone else a spell of bad luck, giving them Unlucky.",
            "upgrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Four-Leaf Clover": {
            "rarity": "Uncommon",
            "cost": 750,
            "effect": "Give yourself or someone else immense luck, giving them Lucky.",
            "upgrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Scarlet Potion": {
            "rarity": "Uncommon",
            "cost": 1200,
            "effect": "Make somebody immune to a status effect of your choice. If they're already immune to that status effect, they lose it instead. If you use it on yourself, you will kill yourself, but still become immune to a status effect of your choice.",
            "upgrades": [
                "Make somebody immune to a status effect of your choice. If they're already immune to that status effect, they lose it instead.",
                "Make somebody immune to a status effect of your choice. If they're already immune to that status effect, they lose it instead. If you use it on yourself, you will kill yourself, bypassing immunties while still gaining an immunity.",
                "Make somebody immune to 2 status effects of your choice. If they're already immune to those status effects, they lose it instead. If you use it on yourself, you will kill yourself while still gaining 2 immunities."
            ],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Lucky Trinket": {
            "rarity": "Uncommon",
            "cost": 400,
            "effect": "While holding get +1 luck. This item cannot be put into a Hellforge.",
            "upgrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Mirror Shard": {
            "rarity": "Uncommon",
            "cost": 400,
            "effect": "Target a player, they get -1 luck for 24h. This item cannot be put into a Hellforge.",
            "upgrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Freedom Ring": {
            "rarity": "Rare",
            "cost": 1000,
            "effect": "Removes the Restrained status effect on use.",
            "upgrades": [
                "Removes the Restrained status effect on use from 2 people of choice.",
                "Removes the Restrained status effect on use for everyone in your alliance.",
                "Removes the Restrained status effect and one other status of your choice on use."
            ],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Megaphone": {
            "rarity": "Rare",
            "cost": 1200,
            "effect": "Removes the Blackmailed status effect on use.",
            "upgrades": [
                "Removes the Blackmailed status effect on use from 2 people of choice.",
                "Removes the Blackmailed status effect on use for everyone in your alliance.",
                "Removes the Blackmailed status effect and one other status of your choice on use."
            ],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Magic Mirror": {
            "rarity": "Rare",
            "cost": 1200,
            "effect": "Choose a negative status effect. Next time you're inflicted by that status you will reflect it back upon the inflictor.",
            "upgrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Hope Antenna": {
            "rarity": "Rare",
            "cost": 1000,
            "effect": "Removes the Despaired status effect on use.",
            "upgrades": [
                "Removes the Despaired status effect on use from 2 people of choice.",
                "Removes the Despaired status effect on use for everyone in your alliance.",
                "Removes the Despaired status effect and one other status of your choice on use."
            ],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Energiser": {
            "rarity": "Rare",
            "cost": 3200,
            "effect": "Allow one extra use for any one of your own or an ally's non-killing abilities.",
            "upgrades": [
                "Allow two extra uses for any one of your own or an ally's non-killing abilities.",
                "Allow one extra use for your own and 1 ally's non-killing  abilities"
            ],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Doggo": {
            "rarity": "Rare",
            "cost": 2000,
            "effect": "Gives you a pet doggo which gives you useless information once a day. The more you feed it, the more useful it becomes [X+1/11 chance of useful info, X being dog treats given]. Can be released which gives 500 coins on release.",
            "upgrades": [
                "Gives you a pet doggo which gives you useless information. The more you feed it, the more useful it becomes [X+1/11 chance of useful info, X being dog treats given]. Can be released which gives 1000 coins on release.",
                "Gives you a pet doggo which gives you useless information. The more you feed it, the more useful it becomes [2*X+1/11 chance of useful info, X being dog treats given]. Can be released which gives 500 coins on release."
            ],
            "targeting": "Not Applicable",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Light Eye": {
            "rarity": "Rare",
            "cost": 0,
            "effect": "Publicly shows who voted for who and what voting perks were used excluding immunities.",
            "upgrades": [
                "Publicly shows who voted for who and what voting perks were used.",
                "Publicly shows who voted for who and what voting perks were used for the past 2 eliminations, excluding immunities.",
                "Publicly shows who voted for who and what voting perks / items were used excluding immunities."
            ],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Unreliable Wish": {
            "rarity": "Rare",
            "cost": 0,
            "effect": "Gain a random any ability based off your luck upon use.",
            "upgrades": [
                "Gain 2 random aby abilities based off your luck upon use."
            ],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Storage Box": {
            "rarity": "Rare",
            "cost": 2400,
            "effect": "Gain +1 item slots, this item does not count for an item slot.",
            "upgrades": [
                "Gain +2 item slots, this item does not count for an item slot."
            ],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": "You by default have 4 item slots."
        },
        "Liquid Nitrogen Grenade": {
            "rarity": "Rare",
            "cost": 2500,
            "effect": "Gives your target and all of their alliance members Frozen.",
            "upgrades": [
                "Gives your target and all of their alliance members a 4 day Frozen.",
                "Gives your target and all of their alliance members a 1/4 thawing chance Frozen."
            ],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Shock Grenade": {
            "rarity": "Rare",
            "cost": 2500,
            "effect": "Gives your target and all of their alliance members Paralyzed.",
            "upgrades": [
                "Gives your target and all of their alliance members Paralyzed that has a 96 hour cooldown."
            ],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Incendiary Grenade": {
            "rarity": "Rare",
            "cost": 2500,
            "effect": "Gives your target and all of their alliance members Burned.",
            "upgrades": [
                "Gives your target and all of their alliance members 12 hour Burned."
            ],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Cannon": {
            "rarity": "Rare",
            "cost": 2500,
            "effect": "Can fire Iron & Steel Balls & 6 Point Bombs into other players inventories. If their inventory is full, destroys the highest tier item and takes its place. Upon having this, can buy Iron Balls for 750 coins and Steel Balls for 1500 coins.",
            "upgrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Steel Ball": {
            "rarity": "Rare",
            "cost": 0,
            "effect": "Does absolutely nothing but takes up an item slot and cannot be used. Cannot be removed unless stolen or burned.",
            "upgrades": [
                "Does absolutely nothing but takes up an item slot and cannot be used. Cannot be removed unless stolen.",
                "Does absolutely nothing but takes up an item slot and cannot be used. Cannot be removed unless burned.",
                "Does absolutely nothing but takes up an item slot and cannot be used. Removes after 72 hours."
            ],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Seed Gun": {
            "rarity": "Uncommon",
            "cost": 800,
            "effect": "Fire a seed you have at someone of choice, reducing target coin % by double what the seed is giving you for 72 hours. Can go under 0%. If held, can buy seeds that can only be used to fire and start at 10% for 200 coins.",
            "upgrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Cursed Relic": {
            "rarity": "Rare",
            "cost": 2500,
            "effect": "Gives your target and any of their alliance members Cursed.",
            "upgrades": [
                "Gives your target and all of their alliance members 2 day Cursed "
            ],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Depower": {
            "rarity": "Epic",
            "cost": 2000,
            "effect": "Removes the Empowered status effect on use. When held, it notifies you every time someone becomes Empowered, but not who.",
            "upgrades": [
                "Removes the Empowered status effect on use. When held, it notifies you every time someone becomes Empowered and who it is.",
                "Removes the Empowered status effect on use for 2 people of choice. When held, it notifies you every time someone becomes Empowered, but not who."
            ],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Immunity Card": {
            "rarity": "Epic",
            "cost": 0,
            "effect": "Makes you immune for a Elimination phase on use.",
            "upgrades": [
                "Makes 2 people of your choice immune for an Elimination phase on use."
            ],
            "targeting": "Self",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Fake Card": {
            "rarity": "Epic",
            "cost": 2500,
            "effect": "Allows you to vote twice for a Elimination phase when used.",
            "upgrades": [
                "Allows you to vote three times for an Elimination phase when used."
            ],
            "targeting": "Self",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Awful Orb": {
            "rarity": "Epic",
            "cost": 0,
            "effect": "Inflict a player of your choice with any negative status effect.",
            "upgrades": [
                "Inflict a player of your choice with any status effect.",
                "Inflict a player of your choice with any 2 negative status effects.",
                "Inflict 2 players of your choice with any negative status effect."
            ],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Spirit Cage": {
            "rarity": "Epic",
            "cost": 7500,
            "effect": "Inflict a player of your choice with a special Cursed which can only be cured by Bless.",
            "upgrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": "Can be moved by things such as Ethereal Healing."
        },
        "Dark Eye": {
            "rarity": "Epic",
            "cost": 0,
            "effect": "Publicly shows the exact role of a player to everyone, cannot be used on yourself.",
            "upgrades": [
                "Publicly shows the exact role of a player to everyone.",
                "Publicly shows the exact role of 2 players to everyone, cannot be used on yourself."
            ],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Six Point Bomb": {
            "rarity": "Epic",
            "cost": 4000,
            "effect": "A bomb with six numbered switches. Whoever is in possession of the bomb has to pull a switch within 24 hours or explode. Once they pulled one they can pass the bomb to another player. One of the switches will blow it up, killing the holder.",
            "upgrades": [
                "A bomb with five numbered switches. Whoever is in possession of the bomb has to pull a switch within 24 hours or explode. Once they pulled one they can pass the bomb to another player. One of the switches will blow it up, killing the holder.",
                "A bomb with seven numbered switches. Whoever is in possession of the bomb has to pull a switch within 24 hours or explode. Once they pulled one they can pass the bomb to another player. One of the switches will blow it up, killing the holder.",
                "A bomb with six numbered switches. Whoever is in possession of the bomb has to pull a switch within 24 hours or explode, unless they are the first holder. Once they pulled one they can pass the bomb to another player. One of the switches will blow it up, killing the holder.",
                "A bomb with six numbered switches. Whoever is in possession of the bomb has to pull a switch within 24 hours or explode. Once they pulled one they can pass the bomb to another player. Two of the switches will blow it up, killing the holder."
            ],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Military Vest": {
            "rarity": "Epic",
            "cost": 3600,
            "effect": "On use, makes you survive a lethal attack.",
            "upgrades": [
                "On use, makes you survive 2 lethal attacks."
            ],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Beer Barrel": {
            "rarity": "Epic",
            "cost": 2000,
            "effect": "Gives your target and any of their alliance members Drunk.",
            "upgrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Velvet Glove": {
            "rarity": "Epic",
            "cost": 4000,
            "effect": "Pick a player, you will see their inventory and will steal an item of your choice from them",
            "upgrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Roulette Wheel": {
            "rarity": "Epic",
            "cost": 0,
            "effect": "When this item is used, there is multiple results that can occur:\n1/10 - You gain an extra ability charge of choice\n2/10 - Nothing Happens\n1/10 - Your Inventory is destroyed\n1/10 - You kill yourself\n1/10 - You gain 2500 coins\n1/10 - You get a random item\n1/10 - You and someone else of choice become Disabled\n1/10 - You get to shoot another player\n1/10 - You gain a random AA Ability",
            "upgrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Polymorph": {
            "rarity": "Legendary",
            "cost": 0,
            "effect": "Transform into a random role which isn't currently in the game. In addition, you gain the eternal enmity of Sh99er.",
            "upgrades": [
                "Transform into a role of your choice which isn't currently in the game.",
                "Transform into a random role."
            ],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Platinum Crown": {
            "rarity": "Legendary",
            "cost": 6200,
            "effect": "Inflict a player of your choice with Empowered.",
            "upgrades": [
                " Inflict a player of your choice with Empowered and cure all negative status effects."
            ],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Rebound Card": {
            "rarity": "Legendary",
            "cost": 0,
            "effect": "If you are to be eliminated at next Elimination, you may instead choose eliminate someone of choice. If successful, you survive.",
            "upgrades": [
                "If you have the most or second most votes during the next Elimination on use, you may eliminate any other player of your choice."
            ],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Gold Card": {
            "rarity": "Legendary",
            "cost": 3500,
            "effect": "Allows you to vote three times for a Elimination phase when used.",
            "upgrades": [
                "Allows you to vote four times for an Elimination phase when used."
            ],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Danger Zone": {
            "rarity": "Legendary",
            "cost": 4500,
            "effect": "Your target and their allies will have their votes doubled on them next Elimination.",
            "upgrades": [
                "Your target and their allies will have their votes tripled on them next Elimination.",
                "Your target will have their votes doubled on them next Elimination."
            ],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Dusk Eye": {
            "rarity": "Legendary",
            "cost": 0,
            "effect": "Publicly shows who visited who within the time after the previous Elimination. Doesn't show self-visits.",
            "upgrades": [
                "Publicly shows who visited who within the time after the previous Elimination.",
                "Publicly shows who visited who within the time after the previous 2 Eliminations. Doesn't show self-visits."
            ],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Reliable Wish": {
            "rarity": "Legendary",
            "cost": 0,
            "effect": "On use, get an Any Ability of your choice.",
            "upgrades": [
                "On use, get an Any Ability of your choice as well as a random Any Ability based on your luck.",
                "On use, get two charges of an Any Ability of your choice."
            ],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Russian Revolver": {
            "rarity": "Legendary",
            "cost": 4500,
            "effect": "A crazy gun that you can attempt to shoot someone with. 1/6 chance to kill the holder, 1/6 chance to kill your target, 2/6 chance to miss and lose the item, 2/6 chance for nothing to happen.",
            "upgrades": [
                "A crazy gun that you can attempt to shoot someone with. 1/5 chance to kill your target, 2/5 chance to miss and lose the item, 2/5 chance for nothing to happen.",
                "A crazy gun that you can attempt to shoot someone with. 1/5 chance to kill the holder, 2/5 chance to miss and lose the item, 2/5 chance for nothing to happen.",
                "A crazy gun that you can attempt to shoot someone with. 1/5 chance to kill the holder, 1/5 chance to kill your target, 2/5 chance to miss and lose the item, 1/5 chance for nothing to happen.",
                "A crazy gun that you can attempt to shoot someone with. 1/5 chance to kill the holder, 1/5 chance to kill your target, 1/5 chance to miss and lose the item, 2/5 chance for nothing to happen."

            ],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Flamethrower": {
            "rarity": "Legendary",
            "cost": 4000,
            "effect": "Completely destroys the inventory of a player of your choice and gives them Burned.",
            "upgrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Excalibur": {
            "rarity": "Mythical",
            "cost": 0,
            "effect": "This item will kill; bypassing protection when used on somebody. If both players have Excalibur, it will be an epic Duel to the death",
            "upgrades": [],
            "targeting": "Single",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Doggo v2": {
            "rarity": "Mythical",
            "cost": 0,
            "effect": "This mythical doggo will tell you accurate information to 2 questions a day! Asking the same question too many times may cause the doggo to bite you, inflicting a status, removing an immunity, or lowering your coin bonus. Alternatively, it may fall asleep, requiring treats to wake it again.",
            "upgrades": [
                "This mythical doggo will tell you accurate information to 3 questions a day!"
            ],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Magic Triangle": {
            "rarity": "Mythical",
            "cost": 0,
            "effect": "You and two other players of your choice get +50% coins value and a better chance of getting more and better items during an Item Rain. The more items effect is reversing item drop chance. 1 item is 1/6, 2 is 2/6 and 3 is 3/6.",
            "upgrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Angel Wings": {
            "rarity": "Mythical",
            "cost": 0,
            "effect": "Upon use and for the next 24h, clear/prevent all negative status effects on you/allies and gain an Unreliable Wish per status cleared that was inflicted with intent to harm. If an ally/yourself has no statuses prevented, you and they gain elim immunity for the upcoming elim. Upon preventing/clearing 3+ or if 2 allies gain immunity, gain a Reliable Wish.",
            "upgrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Dawn Eye": {
            "rarity": "Mythical",
            "cost": 0,
            "effect": "On use, publicly reveals to everyone all of the alliances and group chats. The holder may also peek at one of these and see all of the chats contents.",
            "upgrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Hellforge": {
            "rarity": "Mythical",
            "cost": 0,
            "effect": "Sacrifice an item into the Hellforge. Commons are worth 1 point going up 1 per rarity, with Mythical as 6. At 200% of an items value, you can create one of that kind. Max 2 Mythical, 3 Legendary and 4 Epic. Energiser counts as an Epic for the sake of Hellforge. RW and 6PB take up 2 creation slots. Hellforge takes different times to melt items down. Common - 9 hours. -2 hours every rarity up, with Mythical being 0.",
            "upgrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": "Special Interactions: Sacrificing a Voodoo Doll to the Hellforge will give randomly give 0-5 points and take 11 - 2 * # of points hours to melt, as well as burning and destroying the items of whoever the doll is of."
        },
        "Lucky Charm": {
            "rarity": "Mythical",
            "cost": 0,
            "effect": "As long as this item is in your inventory, you will know exactly what your luck is, and it will be +3 of that. You will be guaranteed at least +1 more items in an item rain making maxing out at 4. If this charm is stolen you will know who did it. This item does not count towards your inventory space, but can be stolen / burned.",
            "upgrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Wishing Star": {
            "rarity": "Mythical",
            "cost": 0,
            "effect": "Choose 3 people including yourself, you will all receive at least a rare and another random AA. Along with this, you will be able to gain an extra AA every power drop from time of use.",
            "upgrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Lucky Coin": {
            "rarity": "Unique",
            "cost": 0,
            "effect": "Someone receives this from their Care Package, increasing their Luck value by 4 when holding it. You may pass this item to someone else and have to pass it to someone else when you die. If you're killed, the killer gets the item.",
            "upgrades": [
                "Someone receives this from their Care Package, increasing their Luck value by 6 when holding it. You may pass this item to someone else and have to pass it to someone else when you die. If you're killed, the killer gets the item.",
                "Someone receives this from their Care Package, increasing their Luck value by 4 when holding it. You may pass this item to someone else. If you're killed, it gets destroyed."
            ],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        }
    },
    "roles": {
        "Agent": {
            "alignment": "Good",
            "description": "Your whole life, you've been watching others. Your scouting skills have stayed intact and led you to prepare for a life-threatening moment like this.",
            "abilities": {
                "Follow": 3,
                "Spy": 3,
                "Hidden": 2
            },
            "perks": [
                "Hawkeye",
                "Organised",
                "Tracker"
            ]
        },
        "Analyst": {
            "alignment": "Good",
            "description": "You're a street smart people person, capable of using signs and signals to see past the surface. You might just be the smartest there ever was, or at least you think so.",
            "abilities": {
                "Chemistry": 3,
                "Vibe Check": 5,
                "Subtraction": 3,
                "Inspection Zone": 1
            },
            "perks": [
                "Face Reader",
                "That Much Smarter",
                "X-Ray Vision"
            ]
        },
        "Biker": {
            "alignment": "Good",
            "description": "Apparently nobody else in this damn game owns a vehicle, all you want is the wind in your hair though. Who cares if a few people get run over?",
            "abilities": {
                "Burning Rubber": 3,
                "Road Rage": 3,
                "Lunch Break": 1
            },
            "perks": [
                "Motor Gang",
                "Rider of the Storm",
                "Rev Up",
                "Full-Throttle Slam"
            ]
        },
        "Cerberus": {
            "alignment": "Good",
            "description": "A demon tasked with protecting the gates of hell, having followed the overlord, takes up protecting others as its main task.",
            "abilities": {
                "Fire Guard": 2,
                "Ethereal Healing": 2,
                "Lava Wall": 2
            },
            "perks": [
                "Spare Heads",
                "Hades' Hound",
                "Ash Formation"
            ]
        },
        "Detective": {
            "alignment": "Good",
            "description": "Your life revolves around finding information and using it to your advantage, and that's what you plan to do.",
            "abilities": {
                "Search": 5,
                "Interrogate": 2,
                "Solve": 0
            },
            "perks": [
                "Clever",
                "Self-Defence"
            ]
        },
        "Fisherman": {
            "alignment": "Good",
            "description": "You're a relaxed, level-handed guy who just likes to catch fish, so much that you can use your fishing skills for various other things.",
            "abilities": {
                "Reel": 2,
                "Fishing Trip": 2,
                "Hooked": 2,
                "Bait": 1
            },
            "perks": [
                "Fishing Buddies",
                "Barrels"
            ]
        },
        "Gunman": {
            "alignment": "Good",
            "description": "You want to stop evil and prove yourself worthy, that is your only goal. You only have one shot at life, literally. Make sure it's worth it or it will really haunt you.",
            "abilities": {
                "Fire": 1
            },
            "perks": [
                "Confidence",
                "Ignorant",
                "Justice's Gift"
            ]
        },
        "Hero": {
            "alignment": "Good",
            "description": "Your ambition was always to do something magnificent and brave. It's always what you wanted to do, and you will try as hard as you can to achieve that goal.",
            "abilities": {
                "Venture": 9,
                "Mentor": 1,
                "Protection": 3
            },
            "perks": [
                "Heroic Power",
                "Legion",
                "Guilded"
            ]
        },
        "Hydra": {
            "alignment": "Good",
            "description": "A multi-headed beast out on a quest to redeem itself for a place with God.",
            "abilities": {
                "Head Slam": 0,
                "Chomp": 0,
                "Tear-Out": 0,
                "Head-Shield": 0,
                "Visceral Roar": 0
            },
            "perks": [
                "Regenerative",
                "Rejuvenative Aura",
                "Head Growing"
            ]
        },
        "Judge": {
            "alignment": "Good",
            "description": "You want the world to be a utopia, where it's free of crime, poverty and hatred. You want the evils gone, but if you fail you will gradually weaken yourself.",
            "abilities": {
                "Lawful": 1,
                "Overrule": 2,
                "The Hammer": 1
            },
            "perks": [
                "Justice",
                "Dystopia",
                "Golden Gavel"
            ]
        },
        "Manager": {
            "alignment": "Good",
            "description": "You're experienced at organization and managing people and will do whatever it takes to create the perfect alliance.",
            "abilities": {
                "Kick": 4,
                "Contract": 2,
                "Discount": 4,
                "Ban": 1
            },
            "perks": [
                "Tradesman",
                "Money Transfer"
            ]
        },
        "Mecha": {
            "alignment": "Good",
            "description": "You are a defensive robotic machine that takes pleasure in military and undercover procedures.",
            "abilities": {
                "Entrapment": 0,
                "Target Fire": 1,
                "Smoke Grenade": 0,
                "Last Resort": 1
            },
            "perks": [
                "Enhanced Learning",
                "Lock On",
                "Loadout Change"
            ]
        },
        "Medium": {
            "alignment": "Good",
            "description": "You're a quiet, passionate and lonely soul who has the ability to talk to the dead.",
            "abilities": {
                "Bury Alive": 2,
                "Preserve": 2,
                "Soul Seer": "inf"
            },
            "perks": [
                "Service",
                "Haunted Tombstone",
                "Spiritual"
            ]
        },
        "Nurse": {
            "alignment": "Good",
            "description": "Your only desire in life is to heal others and help the ones you need to survive yourself.",
            "abilities": {
                "Heal": 3,
                "Vaccinate": 3,
                "Cure": 3
            },
            "perks": [
                "Powerful Immunity",
                "Medical Bills"
            ]
        },
        "Seraph": {
            "alignment": "Good",
            "description": "You believe yourself to be a higher angel incarnated in physical form, here to show sinners the correct path.",
            "abilities": {
                "Purification": 2,
                "Ascend": 2,
                "Holy Light": 2
            },
            "perks": [
                "Cleansing Aura",
                "Angelic",
                "Golden Thread"
            ]
        },
        "Terminal": {
            "alignment": "Good",
            "description": "Once one of the greats, your time is nearing, power dwindling due to the falling of others, but you wont give up just yet.",
            "abilities": {
                "Emotional Surge": 1,
                "Final Swing": 1,
                "Saving Grace": 3,
                "Body Shield": 1
            },
            "perks": [
                "Hourglass of Life",
                "Heartbeats",
                "Spiritual Remains",
                "Shaking Hands",
                "Shallow Breaths",
                "Level Headed"
            ]
        },
        "Time Traveller": {
            "alignment": "Good",
            "description": "You have mastered the element of time, you know it's entire construct and can control it as much as you want.",
            "abilities": {
                "Double Time": 1,
                "Rewind": 2,
                "Loop": 1
            },
            "perks": [
                "Timelines",
                "Time Zoned"
            ]
        },
        "Undercover": {
            "alignment": "Good",
            "description": "You want to stay a secret to everyone, if you get exposed to what you really are, then the future will not be bright for you.",
            "abilities": {
                "Black Cloak": 7,
                "Deduct": "inf",
                "Investigate": 3
            },
            "perks": [
                "Exposed",
                "Paranoia",
                "White Clues"
            ]
        },
        "Wizard": {
            "alignment": "Good",
            "description": "You're the master of spells. You've been practicing magic ever since you were young, and you will use the magic to your advantage.",
            "abilities": {
                "Freeze": 1,
                "Electrify": 1,
                "Empower": 1,
                "Fireball": 1,
                "Bless": 2
            },
            "perks": [
                "Magic Barrier"
            ]
        },
        "Yeti": {
            "alignment": "Good",
            "description": "You are a monster that thrives off sticking around in cold environments, you decided to help the person who helped you from a fateful encounter.",
            "abilities": {
                "Encapsulate": 3,
                "Sheltered in Ice": 2,
                "Nomadic Tribute": 2
            },
            "perks": [
                "Winter Coat",
                "Nomadic",
                "Icicles",
                "Glacial Wall",
                "Snow Globes"
            ]
        },
        "Amalgamation": {
            "alignment": "Neutral",
            "description": "A creation of terror, roaming around the battlefield waiting for its next victim.",
            "abilities": {
                "Absorption": 1
            },
            "perks": [
                "Eternal Hunger"
            ]
        },
        "Backstabber": {
            "alignment": "Neutral",
            "description": "You're a strong guy, and you can choose to help anyone you want, but you can also backstab anyone you want at any time. This is how you interpret life, betraying to survive.",
            "abilities": {
                "Man's Blessing": 1,
                "Decode": 2,
                "Fatality": 1
            },
            "perks": [
                "Manipulator",
                "Finger of Death",
                "Counting Stars"
            ]
        },
        "Banker": {
            "alignment": "Neutral",
            "description": "You love numbers, and really big ones at that. Even better if they're YOUR big numbers, and you will do anything you can to raise them.",
            "abilities": {
                "Inheritance Tax": 1,
                "Last Will": 4,
                "Payday": 1,
                "Inflate": 1
            },
            "perks": [
                "Bank Loans",
                "Greedy",
                "Shopkeeper"
            ]
        },
        "Bard": {
            "alignment": "Neutral",
            "description": "*Panicked flute sounds as boss approaches*",
            "abilities": {
                "Charisma Chant": 3,
                "Damage Dance": 2,
                "Protective Prance": 2,
                "Tactical Tune": 1
            },
            "perks": [
                "Bards Charisma",
                "Lullaby",
                "On Deaf Ears"
            ]
        },
        "Bomber": {
            "alignment": "Neutral",
            "description": "You are a mad explosives expert, whose actions are very hard to track.",
            "abilities": {
                "Sticky Bomb": 1,
                "Gas Bomb": 1,
                "Tagger Bomb": 1
            },
            "perks": [
                "Bomber's Mask",
                "Cautious Nature",
                "Resistant Vest"
            ]
        },
        "Cheater": {
            "alignment": "Neutral",
            "description": "You're a crazy maniac who'll do anything to win, and doesn't play by the rules.",
            "abilities": {
                "Bend": 2,
                "Interception": 5,
                "Break": 1
            },
            "perks": [
                "Rulebreaker",
                "Wilful Ignorance"
            ]
        },
        "Cyborg": {
            "alignment": "Neutral",
            "description": "You're a human swarming with nanobots and mechanical parts, upgrading and destroying to better yourself and others around you.",
            "abilities": {
                "Upgrade": 3,
                "Overclock": 3,
                "Hyperdrive": 1,
                "Degrade": 1
            },
            "perks": [
                "Perfection",
                "Tinkering",
                "Robotic Nature",
                "Cybernetic Link"
            ]
        },
        "Entertainer": {
            "alignment": "Neutral",
            "description": "Put on a show, for public and private audiences!",
            "abilities": {
                "Opening Act": 4,
                "Side-Show": 3,
                "The Twist": 2,
                "Finale": 1
            },
            "perks": [
                "Legion",
                "Lead Actor",
                "Top-Hat Tip",
                "False-Smile",
                "Forced Performance"
            ]
        },
        "Ghost": {
            "alignment": "Neutral",
            "description": "You're not really a human. You're just a lone spirit casting an illusion unknown to the others. Your spirit is still alive, and it doesn't want to be around others.",
            "abilities": {
                "Invisibility": 4,
                "Curse": 4,
                "Death Curse": 1,
                "Disappear": 1
            },
            "perks": [
                "Ghost's Blood",
                "Secret Spirit",
                "Confusion"
            ]
        },
        "Goliath": {
            "alignment": "Neutral",
            "description": "You're a skilled ring fighter, great at exploiting weakness, shaking up fights, and punching the hell out of things in general.",
            "abilities": {
                "Bloody Knuckles": 2,
                "Wall Breaker": 2,
                "Dimensional Shatter": 0
            },
            "perks": [
                "Rage",
                "God's Fist",
                "Crippling Strike",
                "Scrying"
            ]
        },
        "Incubus": {
            "alignment": "Neutral",
            "description": "Charm magic isn't needed so much when your way with words bends the mind of mortals alone.",
            "abilities": {
                "Demonic Embrace": "inf",
                "Sinister Smile": "inf",
                "Hair Pulling": 3,
                "Gentle Holdings": 3
            },
            "perks": [
                "Sexual Findings",
                "Kiss Of Death",
                "Master",
                "Utter Affection",
                "Hard-On",
                "Love-Hate Duet",
                "Lick-Up"
            ]
        },
        "Leech": {
            "alignment": "Neutral",
            "description": "You're a leech idk what to tell you.",
            "abilities": {
                "Siphoning ": 3,
                "Prying Eyes": 1,
                "Digestion": 1,
                "Absolution": 1,
                "Shedding": 1,
                "Wriggling Alone": 1
            },
            "perks": [
                "Attachment",
                "Mood Altering",
                "Immunity System Breeching"
            ]
        },
        "Masochist": {
            "alignment": "Neutral",
            "description": "You love attention, especially the kind to cause you torment. Votes on you gives you pleasure, among other things",
            "abilities": {
                "Allure": 5,
                "Repulse": 0,
                "Submission": 0,
                "Cross Eyes": 0
            },
            "perks": [
                "Pleasure",
                "Masochism",
                "Bliss",
                "Euphoria",
                "Pain Chaser",
                "One Track Mind",
                "Master Bound"
            ]
        },
        "Mimic": {
            "alignment": "Neutral",
            "description": "You have no identity, you live your life imitating other people, being behind other peoples shadows.",
            "abilities": {
                "Re-enact": 3,
                "Replay": 1,
                "Reaction": 3,
                "Reuse": 3
            },
            "perks": [
                "Blend In",
                "Personal Mimicry",
                "Shifting"
            ]
        },
        "Nephilim": {
            "alignment": "Neutral",
            "description": "Born from the gods, but not one to walk with them.",
            "abilities": {
                "Spacial Followings": 2,
                "Ready-Stance": 2,
                "Brute Force": 1,
                "Iron Will": 1
            },
            "perks": [
                "Stinging Serenity",
                "Stable enough",
                "Bloodied",
                "Iron-body"
            ]
        },
        "Pathologist": {
            "alignment": "Neutral",
            "description": "You're interested in the dead and you enjoy examining dead bodies. It's all you do, even in your free time. You're so obsessed with it that you want others to be killed just to be examined.",
            "abilities": {
                "Body Examine": 4,
                "Act Out": 1,
                "Disrespectful Peek": 6,
                "Confiscate": 3
            },
            "perks": [
                "Dead Inside",
                "Corpse Raider"
            ]
        },
        "Sidekick": {
            "alignment": "Neutral",
            "description": "You are an amazing team player and will always help others, making you a strong ally. Helping others allows you to help yourself too.",
            "abilities": {
                "Safeguard": 3,
                "Surveillance": 3,
                "Steel Guard": 0,
                "Silver Finger": 1
            },
            "perks": [
                "Security",
                "Sympathetic"
            ]
        },
        "Succubus": {
            "alignment": "Neutral",
            "description": "You're a mass seducer, but not so good at hiding what you do.",
            "abilities": {
                "Charm": "inf",
                "Gag": 3,
                "Contract Break": "inf"
            },
            "perks": [
                "Sexual Encounter",
                "Sadistic",
                "Chain Puller",
                "Soul Sucker",
                "Muffled Moans",
                "Blinding Desire",
                "Dominatrix"
            ]
        },
        "Tinkerer": {
            "alignment": "Neutral (Removed)",
            "description": "Alteration of everything and anything to get a step ahead the others, even power itself.",
            "abilities": {
                "Override": 3,
                "Matter Reconstruction": 2,
                "Upsurge": 2,
                "Down-surge": 2,
                "Assimilate": 2
            },
            "perks": [
                "Power Handling",
                "Low-Power Hotwire",
                "Assimilation Copy",
                "Eye of Power"
            ]
        },
        "Villager": {
            "alignment": "Neutral",
            "description": "You're just a villager who wants to survive. You may have to fight for survival, but it's your desire to live and get back to your village, everyone loves you.",
            "abilities": {
                "Bond": 4
            },
            "perks": [
                "Loveable",
                "Jack of All Trades"
            ]
        },
        "Apex Predator": {
            "alignment": "Neutral (Removed)",
            "description": "You improvise. You adapt. You overcome.",
            "abilities": {
                "Apex": 1,
                "Upsurge": 2,
                "Downsurge": 3,
                "Power Grasp": 4
            },
            "perks": [
                "Constantly Evolving",
                "Remove Weakness"
            ]
        },
        "Vizier": {
            "alignment": "Neutral (Removed)",
            "description": "Relax, sire. Leave everything... to me. (No I didn't take this from BotC and you can't prove otherwise)",
            "abilities": {
                "Opening Speech": 1,
                "Subliminal Messaging": 3,
                "Maddening Whisper": 2
            },
            "perks": [
                "Throne of Lies",
                "Crown of Thorns",
                "Blade of Truth"
            ]
        },
        "Wanderer": {
            "alignment": "Neutral",
            "description": "You're a level headed loner, trying to get away from the chaos.",
            "abilities": {
                "Serene State": 3,
                "Forceful Resignation": 2,
                "Off The Beaten Path": 3
            },
            "perks": [
                "Lonesome",
                "Calming Silence",
                "Observant",
                "Wolf"
            ]
        },
        "Anarchist": {
            "alignment": "Evil",
            "description": "You believe democracy oppresses the will of the individual. You like to cause anarchy, switching things up and making the battlefield change.",
            "abilities": {
                "Purge": 7,
                "Imperium": 1,
                "Isolate": 1,
                "Sunder": 1
            },
            "perks": [
                "One Step Ahead"
            ]
        },
        "Arsonist": {
            "alignment": "Evil",
            "description": "Some men just want to watch the world burn.",
            "abilities": {
                "Douse": "inf",
                "Incineration": 2,
                "Ignite": 3,
                "Chemical Burning": 1
            },
            "perks": [
                "Ashes to Ashes",
                "Flamed",
                "Gasoline Fumes",
                "Hellish Landscape",
                "Heat Vision"
            ]
        },
        "Bartender": {
            "alignment": "Evil",
            "description": "You're completely obsessed with alcohol, all you do is drink and pressure others into drinking a lot.",
            "abilities": {
                "On the House": 1,
                "Intoxication": 2,
                "Clink": 1,
                "Moonshine": 1
            },
            "perks": [
                "Drinking Buddies",
                "Alcoholic",
                "Staggering Suggestions"
            ]
        },
        "Consort": {
            "alignment": "Evil",
            "description": "Your charm, charisma and good looks gets you anything you want and you will manipulate that as much as you possibly can.",
            "abilities": {
                "Private Show": 3,
                "Public Display": 1,
                "Revealing Attraction": 2
            },
            "perks": [
                "Backstage Practise",
                "Tips for Tips",
                "Viruses",
                "Redressing"
            ]
        },
        "Cultist": {
            "alignment": "Evil",
            "description": "A dark minded individual who 'gifts' their targets with a secret incantation that marks them as a sacrifice to dark powers.",
            "abilities": {
                "Mark of the Fallen": 1,
                "Forbidden Knowledge": 3,
                "Sacrifice": "1"
            },
            "perks": [
                "Mob Mentality",
                "Dark Company",
                "Martyr"
            ]
        },
        "Doll": {
            "alignment": "Evil",
            "description": "You're a husk, empty on the inside, but seemingly perfect on the outside.",
            "abilities": {
                "Soul Seeking": "inf",
                "Soul Swap": 3,
                "Coin Flip": 2,
                "Luck Transfer": 2,
                "Survival Swap": 1,
                "Body Swap": 1
            },
            "perks": [
                "Facade",
                "Breakable"
            ]
        },
        "Forsaken Angel": {
            "alignment": "Evil",
            "description": "Not everything from paradise is friendly.",
            "abilities": {
                "Blackened Chains": 5,
                "Erasure": 1,
                "Broken Blade": 1,
                "Wing Tear": 0
            },
            "perks": [
                "Halo-less",
                "Forsaken Already",
                "Spiteful"
            ]
        },
        "Gatekeeper": {
            "alignment": "Evil",
            "description": "You've always been taking in prisoners, whether they're sickly evil or perfectly innocent and abusing your power by using them. You like to stop your threats by putting them through misery and pain instead of killing them.",
            "abilities": {
                "Restrain": 2,
                "Force Ability": 7,
                "Release": 2
            },
            "perks": [
                "Armoured",
                "Preserved",
                "Spare Cuffs"
            ]
        },
        "Hacker": {
            "alignment": "Evil",
            "description": "You love hacking, and you will try to hack as much as possible to survive, it's your only choice. You can really change results of things, you can mess up anyone you want.",
            "abilities": {
                "False Result": 6,
                "Troll": 1,
                "Silence": 3,
                "Disable": 3
            },
            "perks": [
                "Escapist"
            ]
        },
        "Highwayman": {
            "alignment": "Evil",
            "description": "You're a crazy bandit who goes to insane levels of crazy to make things go your way and increasing your chance of survival.",
            "abilities": {
                "Ruthless Murder": 1,
                "Hold-Up": 2,
                "Armed Friend": 1,
                "Bloody Escape": 1
            },
            "perks": [
                "Suspicious",
                "Daylight Robbery"
            ]
        },
        "Hunter": {
            "alignment": "Evil",
            "description": "You've hid in the shadows, waiting to strike at the right times to benefit yourself. Your life is made of isolation and making risks.",
            "abilities": {
                "Mask": 3,
                "Hunt": 1,
                "Scent Marker": 1
            },
            "perks": [
                "Thrill of the Hunt"
            ]
        },
        "Imp": {
            "alignment": "Evil",
            "description": "A trickster of the demonic world, looking for fun!",
            "abilities": {
                "Mischief": 3,
                "Luck Up": 2,
                "Gathering Trick": 1,
                "Impish Grin": 2
            },
            "perks": [
                "Background Laughter",
                "Trickster",
                "Money Dump",
                "Chaotic Nature",
                "Double Edged Smile"
            ]
        },
        "Jester": {
            "alignment": "Evil",
            "description": "Your whole life is a joke. You're such a worthless being that all you do is spread chanting and haunting laughters.",
            "abilities": {
                "Jokester": 2,
                "Depressing Ballad": 1,
                "Entire Circus": 1
            },
            "perks": [
                "Last Laugh",
                "Party Trick",
                "Loose Noose Lasso"
            ]
        },
        "Juggernaut": {
            "alignment": "Evil",
            "description": "You're a beast, and all you do is become more powerful as the days go by, but you also become more evil and more of a threat to those around you.",
            "abilities": {
                "Peek of the Grave": 0,
                "Peek of the Living": 1,
                "Resilient Aura": 1
            },
            "perks": [
                "Power Up",
                "Power Up Mega",
                "Final Gambit"
            ]
        },
        "Overlord": {
            "alignment": "Evil",
            "description": "You're extreme. You're the leader of all evil, you have power over all the evil, you're what created the word evil. And evil is how you survive.",
            "abilities": {
                "Demon Hunt": 9,
                "Reanimate": 1,
                "Discover": 1
            },
            "perks": [
                "Evil Aura",
                "Legion",
                "Seize"
            ]
        },
        "Phantom": {
            "alignment": "Evil",
            "description": "Inflicting special curses on many, the days go by, their life ticks down.",
            "abilities": {
                "Abyssal Curse": "inf",
                "Shadowed Hands": 1,
                "Abyssal Blessings": "inf",
                "Shadowed Guard": 1
            },
            "perks": [
                "Abyssal Cursing",
                "Abyssal Bound",
                "Phantom's Grasp",
                "Abyssal Shadow"
            ]
        },
        "Psychotherapist": {
            "alignment": "Evil",
            "description": "A name given to those who help psychos and the like",
            "abilities": {
                "Gaslighted Discussion": 3,
                "Silver-Tongue": 3,
                "Ignorance Bubble": 1
            },
            "perks": [
                "Strong Manipulator",
                "Abusive",
                "Corruption",
                "Watchful Eye"
            ]
        },
        "Slaughterer": {
            "alignment": "Evil",
            "description": "Puts the laughter in slaughter.",
            "abilities": {
                "Double Edged": 1,
                "Skinning": 2,
                "Bone Breaker": 1,
                "Corpse Shield": 1
            },
            "perks": [
                "Freakish Nature",
                "Blood Luster",
                "Body Count"
            ]
        },
        "Threatener": {
            "alignment": "Evil",
            "description": "Your only way of living is by threatening over people to do what you want.",
            "abilities": {
                "Steal": 3,
                "Shutdown": 1,
                "Redirect": 4,
                "Survivalists Threaten": 1
            },
            "perks": [
                "Dealer",
                "Broker"
            ]
        },
        "Witchdoctor": {
            "alignment": "Evil",
            "description": "You were born with crazy magicial healing powers, but instead of making good use of them, you decided you abuse them. Your abusing has made you into a devious Sorcereress who causes chaos and disruption.",
            "abilities": {
                "Soul Binding": 1,
                "Voodoo Doll": 1,
                "Hex": 1
            },
            "perks": [
                "Insane",
                "Magic Mind"
            ]
        },
        "Executioner": {
            "alignment": "Traveller",
            "description": "Off with their head.",
            "abilities": {
                "Half-Swording": 2,
                "Hand Off": "inf"
            },
            "perks": [
                "Executioner's Blade",
                "Pen & Blade",
                "Intimidating Aura"
            ]
        },
        "Merchant": {
            "alignment": "Traveller",
            "description": "I'm here to talk to you about your car's extended warranty.",
            "abilities": {
                "The Deal": "inf",
                "Swindle": 3
            },
            "perks": [
                "Bribery Benefits",
                "Many Wares",
                "Cargo Cart",
                "Banker's Jeaolusy"
            ]
        },
        "The Reaper of Souls": {
            "alignment": "Traveller",
            "description": "An undead harbinger of the graveyard.",
            "abilities": {
                "Soul for a Soul": 1,
                "Soul Stasis": 3,
                "Danse Macabre": 1
            },
            "perks": [
                "Relentless Spirits",
                "Fetch me their Souls",
                "Undead Resilience",
                "Grim Resolve",
                "Life & Death",
                "Cold Benevolance",
                "Harbringer",
                "Ethereal Presence"
            ]
        },
        "Ball": {
            "alignment": "Ball",
            "description": "Let's get rolling, let's get going, once it's rolling, you can't stop it-",
            "abilities": {
                "Rolling": "inf",
                "Bouncing": 1,
                "Speed Up": "inf"
            },
            "perks": [
                "Obviously a Ball",
                "Uncontrollable"
            ]
        }
    },
    "abilities": {
        "Follow": {
            "role": "Agent",
            "rarity": "Common",
            "exclusive": false,
            "removed": false,
            "effect": "You will know everything your target does and who to for 24 hours from use, including self visits. Does not include perk-based actions.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Spy": {
            "role": "Agent",
            "rarity": "Common",
            "exclusive": false,
            "removed": false,
            "effect": "You will know everything that happens to your target and who did it 24 hours from use, including self visits.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Hidden": {
            "role": "Agent",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "For 24 hours on use, anything done on you will be reflected back to the user.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Chemistry": {
            "role": "Analyst",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "Select two people, if they share an alliance, you will be told, and can select another person, this loops.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Vibe Check": {
            "role": "Analyst",
            "rarity": "Common",
            "exclusive": false,
            "removed": false,
            "effect": "Select 2 people, you will know if they are the same alignment. You cannot select the same person more than twice.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Subtraction": {
            "role": "Analyst",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "Select someone, view their alliance's items. These items will be shown combined with each other. You also find out about any inventory affecting effects/perks on the player you chose.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Inspection Zone": {
            "role": "Analyst",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "Upon use, you will know everything to effect you within the next 24 hours, and who did it.You evade lethal effects (excluding scarlet/curses). If someone tries to inflict you with a negative status, it will reflect back onto them.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Burning Rubber": {
            "role": "Biker",
            "rarity": "Rare",
            "exclusive": false,
            "removed": false,
            "effect": "Target somebody, clearing all negative statuses on them, and everybody who visits them negatively or neutrally for the next 24 hours will be burned with an 8 hour burn.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Road Rage": {
            "role": "Biker",
            "rarity": "Rare",
            "exclusive": false,
            "removed": false,
            "effect": "Target somebody, burn them with an 8 hour burn, and everybody who visits them positively within the next 24 hours will also burn with an 8 hour burn.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Stick With the Pack": {
            "role": "Biker",
            "rarity": "Epic",
            "exclusive": false,
            "removed": true,
            "effect": "Target an ally, inflicting them with Rev Up permanently. This can't be empowered or energized.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Lunch Break": {
            "role": "Biker",
            "rarity": "Uncommon",
            "exclusive": true,
            "removed": false,
            "effect": "Disable Rev Up, Rider of the Storm, and all uses of Burning Rubber for 48 hours, to gain 24 hours of death immunity and elimination immunity.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Fire Guard": {
            "role": "Cerberus",
            "rarity": "Epic",
            "exclusive": false,
            "removed": false,
            "effect": "Select someone, for 24 hours you will know any negative visits to the person (and what they are), and can decide to undo each effect, burn the visitor, or do nothing at all. This includes all negatives such as death other than elimination.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": "Example of undoing an effect: If somebody shoots a player under fire guard, that player will still die. However, the user of fire guard may then choose to undo that death, reviving the player."
        },
        "Ethereal Healing": {
            "role": "Cerberus",
            "rarity": "Epic",
            "exclusive": false,
            "removed": false,
            "effect": "Select 2 people, removing all negatives from the first and putting them on the second, and removing all positives from the second onto the first. You can select dead people.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Lava Wall": {
            "role": "Cerberus",
            "rarity": "Rare",
            "exclusive": false,
            "removed": false,
            "effect": "When used, if someone in your alliance is visited within the next 24 hours, burns the visitor and destroys their lowest tier item. The visit is blocked if the visitor is already burning, but still has an item destroyed. You may choose if this effects alliance members too. This announces in alliance chat, can be used solo.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Search": {
            "role": "Detective",
            "rarity": "Common",
            "exclusive": false,
            "removed": false,
            "effect": "Find out what type of action your target most recently did (investigative, killing, healing, etc) and the player they used it on.",
            "upgrades": [
                "Find out what type of action your 2 targets most recently did (investigative, killing, healing etc) and the player they used it on, listed seperately for each target."
            ],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Interrogate": {
            "role": "Detective",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "You're given 2 possible roles that the person you select could be, one is a random false role and the other is their actual role.",
            "upgrades": [
                "Learn the role of the person you select.",
                "You're given 2 possible roles that each of the two people you select could be, one is a random false role and the other is their actual role for each."
            ],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Solve": {
            "role": "Detective",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "Figure out any piece of information of your choice about a player. Gain a charge for this every even day if you are Detective.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Reel": {
            "role": "Fisherman",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "Select a person - steal their most recent item - if they are opposite your alignment, you will see their inventory and can choose what item to steal.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Fishing Trip": {
            "role": "Fisherman",
            "rarity": "Rare",
            "exclusive": false,
            "removed": false,
            "effect": "You receive a random common item or AA (you choose which). The more times you use Fishing Trip the higher the rarity of item/AA you will get. Upon mythical loop to common.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Hooked": {
            "role": "Fisherman",
            "rarity": "Epic",
            "exclusive": false,
            "removed": false,
            "effect": "For 24hrs, any items/AAs your target gives or receives, you'll take instead.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Bait": {
            "role": "Fisherman",
            "rarity": "Legendary",
            "exclusive": false,
            "removed": false,
            "effect": "Select someone: For 24 hours any action (excluding votes) people use on another player (excluding you & the target) will redirect towards the target. If the user or the target dies, this ability stops.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Fire": {
            "role": "Gunman",
            "rarity": "Not an Any Ability",
            "exclusive": true,
            "removed": false,
            "effect": "Shoot a player. If you kill someone who is your alignment, you will commit suicide.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Venture": {
            "role": "Hero",
            "rarity": "Common",
            "exclusive": false,
            "removed": false,
            "effect": "Find out if a player is good or not.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Mentor": {
            "role": "Hero",
            "rarity": "Epic",
            "exclusive": false,
            "removed": false,
            "effect": "Learn an alliance members role and learn one charge of an ability of theirs of your choice. Fails if your target is not the same alignment as you.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": "Can copy fake abilities/perks (facade, confusion, etc). May also attempt to blindly take an ability/perk, will succeed if the target's actual role has said ability/perk."
        },
        "Protection": {
            "role": "Hero",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "Make an alliance member completely immune to death including eliminations for 24 hours. If Hero, you can gift a charge of this as an AA to others. Can't self pick. The target learns they are chosen.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Head Slam": {
            "role": "Hydra",
            "rarity": "Rare",
            "exclusive": true,
            "removed": false,
            "effect": "Select someone, destroy their lowest tier item and inflicting a neg status you are immune to. Must cycle through all immunities before re-inflicting.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Chomp": {
            "role": "Hydra",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "Select someone; they will be unable to perform actions to people outside their current alliance members for 12h. If not in an alliance, they will be unable to join one for 12h. Can stack.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Tear-Out": {
            "role": "Hydra",
            "rarity": "Rare",
            "exclusive": true,
            "removed": false,
            "effect": "Select someone, dragging them out of their alliance. Inflict a neg status you are not immune to. Must cycle through all non-immunities before re-inflicting.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Head-Shield": {
            "role": "Hydra",
            "rarity": "Epic",
            "exclusive": true,
            "removed": false,
            "effect": "Select as many players as immunities (if 0, 1). Neg actions on them are blocked, the person using it will keep the charge but will be blocked from voting/acting for 6h. Neutral visits inform you & the target what occured & who did it. Lasts 8h. Can stack. You can bypass this. Gains max 2 per day from perk.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Visceral Roar": {
            "role": "Hydra",
            "rarity": "Epic",
            "exclusive": false,
            "removed": false,
            "effect": "Pick someone, they pick neg statuses they want & will gain VP equal. Will be inflicted with them post-elim. Chosen immunities remove immediately instead. 24h cooldown, must be used 12h before elim (or will carry). If chosen 3+ times, they no longer gain immunity from Hydra perks. Statuses inflicted by this cant be removed on mass by status infliction abilities (instead, cure half rounded up) and when removed dont provide immunities.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Lawful": {
            "role": "Judge",
            "rarity": "Epic",
            "exclusive": false,
            "removed": false,
            "effect": "Changes the day to have two eliminations. Your votes count as 2 for both of them. You become immune to elimination for both. Must be used atleast 12 hours before elimination for full effect. If used past that, double elimination and vote of 2 does not occur, but immunity does.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Overrule": {
            "role": "Judge",
            "rarity": "Epic",
            "exclusive": false,
            "removed": false,
            "effect": "Remove 1 elimination immunities from a player for the upcoming elimination. If none, counts as -1 immunity.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "The Hammer": {
            "role": "Judge",
            "rarity": "Rare",
            "exclusive": false,
            "removed": false,
            "effect": "Use this to completely stop the upcoming elimination phase when the time comes.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Kick": {
            "role": "Manager",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "1 charge - Kick someone from your alliance. - 2 charges - select someone, you will kick them if they are in any alliances. Kicked players lose 25% of their total coins which is evenly spread throughout your alliance and your personal luck goes up by 1. Kicked people cannot re-join their alliance for 36 hours. Dying will stop any active kicks.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Contract": {
            "role": "Manager",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "Give an ally +25% coins value. If they are your alignment, gain +25% for yourself too.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Discount": {
            "role": "Manager",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "Give yourself or an ally a 50% reduced price on every buyable item until you/they buy one. Does not stack to get more reduction.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Ban": {
            "role": "Manager",
            "rarity": "Epic",
            "exclusive": false,
            "removed": false,
            "effect": "Ban all members from a targets alliance if they're in one. They cannot join any alliance nor make one for 36 hours, they cannot be in an alliance with any of the members they got banned from for 72 hours. If you die the ban goes off. This bypasses blocks.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Entrapment": {
            "role": "Mecha",
            "rarity": "Rare",
            "exclusive": false,
            "removed": false,
            "effect": "Select someone, if they attempt to harm you within the next 18 hours, evade it, re-inflict entrapment on them and inflict the harm back on them, along with gaining a charge/item of whatever they used. This can loop.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": "If someone attempts to pass you a 6PB, it will automatically explode on them."
        },
        "Target Fire": {
            "role": "Mecha",
            "rarity": "Epic",
            "exclusive": true,
            "removed": false,
            "effect": "Select 2 people, if one harms the other within the next 36 hours, both get hit by it 3 fold.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": "If one attempts to pass the other a 6PB, it will automatically explode on both (thrice)."
        },
        "Smoke Grenade": {
            "role": "Mecha",
            "rarity": "Rare",
            "exclusive": false,
            "removed": false,
            "effect": "Select someone, if they attempt to harm anyone within your alliance within the next 24 hours, cause it to fail, and give them drunk 3 stack, burned and cursed.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Last Resort": {
            "role": "Mecha",
            "rarity": "Epic",
            "exclusive": false,
            "removed": false,
            "effect": "Select someone, they cannot be eliminated at next elimination. If saved from elimination, all voters on the target will become paralyzed.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Bury Alive": {
            "role": "Medium",
            "rarity": "Rare",
            "exclusive": false,
            "removed": false,
            "effect": "Bury someone for 24 hours, making them count as dead and finding out their role. They cannot act outside of what they could do when dead, except talk. Abilities that work on dead players will now work on your targets.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": "Can copy fake abilities/perks (facade, confusion, etc). May also attempt to blindly take an ability/perk, will succeed if the target's actual role has said ability/perk."
        },
        "Preserve": {
            "role": "Medium",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "If someone died, within 24 hours of the death you can use this on them to make them their body survive for 24 more hours. If they have heal, ethereal heal, break, saving grace, protection, holy light, or bless used on them within that time they will come back to life, if not, you take any money they have on them.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Soul Seer": {
            "role": "Medium",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "Select a player, upon their death, you can see their role, their items, money and their last actions. You gain a charge upon the selected player dying. If Medium and used on yourself and you die, you may continue to make chats with the living.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Heal": {
            "role": "Nurse",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "Heal your target from the next fatal effect that happens to them aside from being eliminated.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Vaccinate": {
            "role": "Nurse",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "Your target becomes immune to a status effect of your choice.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Cure": {
            "role": "Nurse",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "Cures your target of any status effect[s] of your choice.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Purification": {
            "role": "Seraph",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "Select someone, all negative statues on them are inflicted back on the original users.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Ascend": {
            "role": "Seraph",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "Soar into the air, and see who visits yourself and allies for the next 12 hours. You will avoid negatives while this is active.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Holy Light": {
            "role": "Seraph",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": " Select someone, returning any positives lost within the previous 18 hours. If they hadn't lost any positives, the next positive performed by them and done to them is 2 fold.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Emotional Surge": {
            "role": "Terminal",
            "rarity": "Not an Any Ability",
            "exclusive": true,
            "removed": false,
            "effect": "Inflict someone of choice with statuses that you have lost immunity to.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Final Swing": {
            "role": "Terminal",
            "rarity": "Not an Any Ability",
            "exclusive": true,
            "removed": false,
            "effect": "Cannot be empowered or energized. While having less than or equal to 3 regrets, you can disable someone's perks and abilities until you die. If you have 4 or more, you can disable someone's perks or abilities until you die. Using this will add 3 regrets.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Saving Grace": {
            "role": "Terminal",
            "rarity": "Not an Any Ability",
            "exclusive": true,
            "removed": false,
            "effect": "Select someone, saving them from elimination and negative effects for the next 24 hours. If they are not struck by elimination, gain a regret, else, lose a regret. If you de-activate this, you gain a non-negative removing version to use. Does not inform target.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Body Shield": {
            "role": "Terminal",
            "rarity": "Not an Any Ability",
            "exclusive": true,
            "removed": false,
            "effect": "Select someone, if they are attacked, they survive, however, you lose an active perk of choice; but also lose 3 regrets. Cannot remove Hourglass of life or be self-used unless reflected/redirected.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Double Time": {
            "role": "Time Traveller",
            "rarity": "Not an Any Ability",
            "exclusive": true,
            "removed": false,
            "effect": "Everyone in your alliance will have their next ability happen twice, or if it involves time, either twice as fast or twice as long (refer to ECO). Double time won't work on double time. Announces in alliance, can be used solo.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Rewind": {
            "role": "Time Traveller",
            "rarity": "Rare",
            "exclusive": false,
            "removed": false,
            "effect": "Select someone, any statuses they had and items they used in the past 24 hours, they regain. Cannot use on same person within 24 hours - Global Cooldown",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Loop": {
            "role": "Time Traveller",
            "rarity": "Not an Any Ability",
            "exclusive": true,
            "removed": false,
            "effect": "Select someone - Any negative abilities or item effects that have effected them within the past 24 hours and the next 24 hours, will effect them again, every 24 hours, 3 times.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Black Cloak": {
            "role": "Undercover",
            "rarity": "Common",
            "exclusive": false,
            "removed": false,
            "effect": "Next time someone visits you, they get redirected to a target of your choice. Can be cancelled and regained.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Deduct": {
            "role": "Undercover",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "Find the exact role of a player of your choice, has a 24 hour cooldown after use if you are Undercover.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Investigate": {
            "role": "Undercover",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "Find out who voted your target at the previous elimination and who your target is voting for the upcoming elimination.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Freeze": {
            "role": "Wizard",
            "rarity": "Common",
            "exclusive": false,
            "removed": false,
            "effect": "Freeze somebody, giving them a special 4 day, 1/4 thaw chance Frozen. Can choose if it removes any other status effect they have apart from Cursed.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Electrify": {
            "role": "Wizard",
            "rarity": "Common",
            "exclusive": false,
            "removed": false,
            "effect": "Electrify somebody, giving them a special Paralysed which stuns for 56 hours. Can choose if it removes any other status effect they have apart from Cursed.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Empower": {
            "role": "Wizard",
            "rarity": "Legendary",
            "exclusive": false,
            "removed": false,
            "effect": "Empower somebody, giving them Empowered. Removes any other status effect they have apart from Cursed. If you empower yourself, you cannot use empower again. Empower cannot be used with empower charges, unless you are Wizard.",
            "upgrades": [
                "Empower somebody, giving them Empowered. Removes any other status effect they have. If you empower yourself, you cannot use empower again. Empower cannot be used with empower charges, unless you are Wizard.",
                "Empower somebody, giving them Empowered. If you empower yourself, you cannot use empower again. Empower cannot be used with empower charges, unless you are Wizard."
            ],
            "degrades": [],
            "targeting": "Single",
            "actionTypes": ["Positive", "Status"],
            "additionalInfo": ""
        },
        "Fireball": {
            "role": "Wizard",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "Burn somebody, giving them a special Burned which burns every 16 hours. Can choose if it removes any other status effect they have apart from Cursed.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Bless": {
            "role": "Wizard",
            "rarity": "Rare",
            "exclusive": false,
            "removed": false,
            "effect": "Bless somebody, removing all curses from them if they have any. It can also revive a dead player if they're preserved.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Encapsulate": {
            "role": "Yeti",
            "rarity": "Rare",
            "exclusive": false,
            "removed": false,
            "effect": "Target a player. Inflict them with Frozen, bypassing immunities. While Frozen, they are unable to be visited by anyone outside of their alliance and you. However, they can be visited by anyone to cure Frozen.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Sheltered in Ice": {
            "role": "Yeti",
            "rarity": "Rare",
            "exclusive": false,
            "removed": false,
            "effect": "Inflict Frozen on everyone in your alliance. While they are Frozen, they are immune to negatives. If they are immune to Frozen, you will learn and may choose to bypass it. You may choose to unfreeze them at any time. Can be used solo.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Nomadic Tribute": {
            "role": "Yeti",
            "rarity": "Not an Any Ability",
            "exclusive": true,
            "removed": false,
            "effect": "Anyone currently Frozen will secretly vote anyone of your choice for the next elimination. If they thaw after this ability is used, their vote will be returned to normal. ",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Absorption": {
            "role": "Amalgamation",
            "rarity": "Not an Any Ability",
            "exclusive": true,
            "removed": false,
            "effect": "Select a player. Upon their death you may see their abilities and perks and pick one of each. You will be given the ability and perk, and you will also regain a charge of Absorption after doing so. This cannot gain charges outside of its base conditions, and cannot be copied.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": "Can copy fake abilities/perks (facade, confusion, etc). May also attempt to blindly take an ability/perk, will succeed if the target's actual role has said ability/perk."
        },
        "Man's Blessing": {
            "role": "Backstabber",
            "rarity": "Rare",
            "exclusive": false,
            "removed": false,
            "effect": "The first vote on a selected player has 1 less power and remains permanent until you change it. This can stack and go across multiple voters.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Decode": {
            "role": "Backstabber",
            "rarity": "Not an Any Ability",
            "exclusive": true,
            "removed": false,
            "effect": "Reverse the effects of Mans Blessing, making the first vote on them increase by 1 instead or reverse the effects of Fatality, making any votes on your allies and yourself not counting (can be used solo).",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Fatality": {
            "role": "Backstabber",
            "rarity": "Epic",
            "exclusive": false,
            "removed": false,
            "effect": "For one elimination, all votes on any of your allies count as an increased power of 1. Announces in alliance Fatality is used - but not which version.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Inheritance Tax": {
            "role": "Banker",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "You take all money from a dead player.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Last Will": {
            "role": "Banker",
            "rarity": "Rare",
            "exclusive": false,
            "removed": false,
            "effect": "If you receive the most votes for the upcoming elimination, everyone who voted you has their coin count reduced to 0. This applies even if rebounded / immune.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Payday": {
            "role": "Banker",
            "rarity": "Rare",
            "exclusive": false,
            "removed": false,
            "effect": "Everyone currently alive must pay up 200 coins to you or become Restrained for 3 days. If Banker: You know who didn't pay afterwards.",
            "upgrades": [],
            "degrades": [],
            "targeting": "All Alive Players",
            "actionTypes": [],
            "additionalInfo": "You cannot do any actions until choosing whether or not to pay. If you don't pick in 24 hours, it defaults to Restrained."
        },
        "Inflate": {
            "role": "Banker",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "Increases an items price by 1000 coins.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Charisma Chant": {
            "role": "Bard",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "Select a player, their luck goes up by +2 and +50% until a luck event occurs. Any statuses on them that are negative will be degraded. Cannot be self used more than once",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Damage Dance": {
            "role": "Bard",
            "rarity": "Rare",
            "exclusive": false,
            "removed": false,
            "effect": "Select a player, their next offensive ability / item use will be 2-fold",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Protective Prance": {
            "role": "Bard",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "Select a player, the next negative on them will be blocked.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Tactical Tune": {
            "role": "Bard",
            "rarity": "Legendary",
            "exclusive": false,
            "removed": false,
            "effect": "Upon use, become immune to death, statuses and elimination, lasts 24h. If attacked or eliminated, except for using a scarlet potion, in this time, add 24 hours onto this - loops.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Sticky Bomb": {
            "role": "Bomber",
            "rarity": "Not an Any Ability",
            "exclusive": true,
            "removed": false,
            "effect": "Put a sticky bomb on a player without them knowing. When the holder is visited, the visitor gets the bomb. Detonates after 48 hours.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Gas Bomb": {
            "role": "Bomber",
            "rarity": "Epic",
            "exclusive": false,
            "removed": false,
            "effect": "Gas a player. Them and any visitors get Paralysed, Disabled, and Blackmailed for a 48 hour period. Gas goes away after 72 hours. Self-visits will not gas you.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Tagger Bomb": {
            "role": "Bomber",
            "rarity": "Epic",
            "exclusive": false,
            "removed": false,
            "effect": "Tag a player. Every time the tagged player visits someone they also get tagged. You can see tagged peoples visits.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Bend": {
            "role": "Cheater",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "Change someone's alignment to an alignment of your choice. They will be informed of this. If Cheater: Gain a charge of this every day.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Interception": {
            "role": "Cheater",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "Target a person, receive the next feedback that they would receive from an ability/item.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Break": {
            "role": "Cheater",
            "rarity": "Legendary",
            "exclusive": false,
            "removed": false,
            "effect": "For 24 hours, if whoever you select dies, they will come back to life at the end of this time.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Upgrade": {
            "role": "Cyborg",
            "rarity": "Epic",
            "exclusive": false,
            "removed": false,
            "effect": "Select someone, they can now upgrade a perk or ability. Max once per ability or perk.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Overclock": {
            "role": "Cyborg",
            "rarity": "Rare",
            "exclusive": false,
            "removed": false,
            "effect": "Select someone, they can now upgrade an item of choice. Max once per item.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Hyperdrive": {
            "role": "Cyborg",
            "rarity": "Legendary",
            "exclusive": false,
            "removed": false,
            "effect": "Select someone, they gain a new charge for an ability of choice, once every 4 days.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Degrade": {
            "role": "Cyborg",
            "rarity": "Rare",
            "exclusive": false,
            "removed": false,
            "effect": "Select someone, you learn their role and see their abilities and perks, you can degrade an ability or perk of choice.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Opening Act": {
            "role": "Entertainer",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "Select someone, for the next 48h, they will have -/+10% immunity card chances, you decide upon choosing them. If they are in an alliance within this time, you will know the alliance. Does not stack.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Side-Show": {
            "role": "Entertainer",
            "rarity": "Uncommon",
            "exclusive": true,
            "removed": false,
            "effect": "Select someone, joining their alliance, as if someone invited you. You can be in 2 alliances at once using this method. If you use this when in 2, leave 1, you pick.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "The Twist": {
            "role": "Entertainer",
            "rarity": "Uncommon",
            "exclusive": true,
            "removed": false,
            "effect": "Select 2 players, their alliances will be merged for 24 hours. If in same alliance, the alliance is instead split equally. People may not leave for the duration of this ability.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Finale": {
            "role": "Entertainer",
            "rarity": "Not an Any Ability",
            "exclusive": true,
            "removed": false,
            "effect": "Select someone, their alliance must vote within alliance chat a person to die. Draws kill all not in the draw. An alliance of 2 will have draws kill both. People may only use vote/elimination/alliance impacting abilities/items and may not leave for the duration of this ability, counts as an elimination kill. If you pick someone alone, you will be blackmailed & despaired. If no one dies due to this ability, gain one-time death/elim immunity.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Invisibility": {
            "role": "Ghost",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "Go invisible which allows nobody to visit you for 24 hours.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Curse": {
            "role": "Ghost",
            "rarity": "Common",
            "exclusive": false,
            "removed": false,
            "effect": "Curse somebody, giving them Cursed. Removes any other status effects they have.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Death Curse": {
            "role": "Ghost",
            "rarity": "Not an Any Ability",
            "exclusive": true,
            "removed": false,
            "effect": "Curse somebody, giving them a special Cursed which can only be cured by the Bless. Someone inflicted with this curse will have their perks and abilities disabled unless you die. Cannot be moved once inflicted.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Disappear": {
            "role": "Ghost",
            "rarity": "Legendary",
            "exclusive": true,
            "removed": false,
            "effect": "Vanish for up to two days, making nothing happen to you. You're also immune to votes. You may reappear at any time once you vanish.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Bloody Knuckles": {
            "role": "Goliath",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "Target somebody, you learn their status immunities. Choose a status immunity to remove from them permanently. If the target has no immunities they leave a blood trail which tracks their next visit for you even through Shatter. (who they visited and the nature of the visit)",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Wall Breaker": {
            "role": "Goliath",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "Target somebody, if they're in an alliance you publicly reveal the alliance name and members. If they aren't in an alliance this does nothing and you gain a charge back but they're aware Goliath tried to break in.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Dimensional Shatter": {
            "role": "Goliath",
            "rarity": "Not an Any Ability",
            "exclusive": true,
            "removed": false,
            "effect": "Gain a charge of this ability only after Rage has activated four times. For 24 hours all visits are untraceable, any deaths are not revealed but still happen. Whoever is eliminated at the end of the day dies and doesn't get their last words. In the case of a draw, everybody involved dies. All investigation abilities reveal nothing.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Demonic Embrace": {
            "role": "Incubus",
            "rarity": "Epic",
            "exclusive": true,
            "removed": false,
            "effect": "Pick someone once every 24h. They will be told they have been embraced by an Incubus. embraced targets will have x2 vote power when voting with you or an embraced person and you also have x2 vote power when voting with embraced, as long as Sinister smile isnt on.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Sinister Smile": {
            "role": "Incubus",
            "rarity": "Not an Any Ability",
            "exclusive": true,
            "removed": false,
            "effect": "Embraced targets only have their vote work when voting with you, or against you. You gain 2/6 vote power per living embraced and 1/6 per dead embraced, your vote rounds up. You can switch this on or off, embraced will not know.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Hair Pulling": {
            "role": "Incubus",
            "rarity": "Rare",
            "exclusive": true,
            "removed": false,
            "effect": "Force all embraced to vote with you.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Gentle Holdings": {
            "role": "Incubus",
            "rarity": "Uncommon",
            "exclusive": true,
            "removed": false,
            "effect": "Only works on embraced targets. Give them elim immunity and +1 vote power for next elimination. Can be cancelled. Target is told they are chosen.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Siphoning ": {
            "role": "Leech",
            "rarity": "Not an Any Ability",
            "exclusive": true,
            "removed": false,
            "effect": "Upon use, pull a random status/effect off of your host. You gain 2 charges if your host dies.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": "Cannot copy fake effects. Cannot take evasion effects (and they will succesfully evade). Can bypass/take redirection effects. Can bypass/take block effects, except for some instance such as Ready-Stance."
        },
        "Prying Eyes": {
            "role": "Leech",
            "rarity": "Not an Any Ability",
            "exclusive": true,
            "removed": false,
            "effect": "Upon use, see what effects/statuses are on your host. Your next Siphoning charge will let you choose what you pull, provided you don't change host. Gain 1 charge if your host dies.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Digestion": {
            "role": "Leech",
            "rarity": "Rare",
            "exclusive": false,
            "removed": false,
            "effect": "View what AAs your host has. Steal an AA of choice, if it has no charge, also destroy a random addition AA on them. If not leech: view what AAs an alliance member has.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Absolution": {
            "role": "Leech",
            "rarity": "Epic",
            "exclusive": false,
            "removed": false,
            "effect": "Remove a status/effect from yourself. Gain a charge each time you use Prying Eyes.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Shedding": {
            "role": "Leech",
            "rarity": "Not an Any Ability",
            "exclusive": true,
            "removed": false,
            "effect": "Force yourself onto a different host, transferring all negative statuses from yourself to your previous host. Useable through statuses/effects that prevent action.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Wriggling Alone": {
            "role": "Leech",
            "rarity": "Not an Any Ability",
            "exclusive": true,
            "removed": false,
            "effect": "Abandon your host.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Allure": {
            "role": "Masochist",
            "rarity": "Common",
            "exclusive": false,
            "removed": false,
            "effect": "Make someone vote you during elimination. If Masochist: You can cancel and regain this ability.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Repulse": {
            "role": "Masochist",
            "rarity": "Rare",
            "exclusive": true,
            "removed": false,
            "effect": "Make any votes on you reflected back to the voter, but still gain a stack. Activates with 2 charges at 5 stacks.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Submission": {
            "role": "Masochist",
            "rarity": "Epic",
            "exclusive": true,
            "removed": false,
            "effect": "All votes don't work on you apart from giving you stacks. Every vote you receive now counts towards your vote (loops break). Activates with 1 charge at 8 stacks.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Cross Eyes": {
            "role": "Masochist",
            "rarity": "Uncommon",
            "exclusive": true,
            "removed": false,
            "effect": "Works for 24 hours on use. If you have a negative status put on you - it fails, gives the user frozen. Gives you 3 stacks per success. Activates with 1 charge at 11 stacks.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Re-enact": {
            "role": "Mimic",
            "rarity": "Epic",
            "exclusive": false,
            "removed": false,
            "effect": "Select someone, you copy and gain a charge of their next ability they use. Can be cancelled and regained.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Replay": {
            "role": "Mimic",
            "rarity": "Rare",
            "exclusive": false,
            "removed": false,
            "effect": "Select someone, any votes they gain - you gain that as your vote power for next elimination. Can be used on yourself at half vote power. You are not told how much vote power you gained.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Reaction": {
            "role": "Mimic",
            "rarity": "Rare",
            "exclusive": false,
            "removed": false,
            "effect": "The next action done to you also effects the person doing it to you. Can be cancelled and regained.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": "The user of Reaction is the one who uses the action on the orignal user. For instance, if someone uses a Role Scanner on someone with Reaction, the original will get the results for the Reaction user and the Reaction user will get results for the orignal user."
        },
        "Reuse": {
            "role": "Mimic",
            "rarity": "Epic",
            "exclusive": false,
            "removed": false,
            "effect": "Select a person, gain a copy of the next item they use. Items that are Mythical or higher, can be copied max twice. Reliable wish may only be copied three times. Can be cancelled and regained.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Spacial Followings": {
            "role": "Nephilim",
            "rarity": "Rare",
            "exclusive": true,
            "removed": false,
            "effect": "Defensive: When used, for 24 hours, you will disarm anyone of their items used against you or an ally and claim them for yourself, you will know who you disarmed. Offensive: Select someone, breaking their arms, preventing item use and passing for 24 hours and inflicting paralysis.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Ready-Stance": {
            "role": "Nephilim",
            "rarity": "Rare",
            "exclusive": true,
            "removed": false,
            "effect": "Defensive: Upon use, anything used on you in the next 24 hours you will know about, you can choose to block the visit entirely, inflict it on an ally, or take it. Offensive: Select someone, anything negative that happens to you in the next 12 hours, also happens to them, if they try to do a negative onto you, disable, restrain and blackmail them, preventing the action. You will be told who does what to you during this, and for every negative action done to you, the timer increases by 2 hours.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Brute Force": {
            "role": "Nephilim",
            "rarity": "Epic",
            "exclusive": true,
            "removed": false,
            "effect": "Offensive only: Bind someone's alliance, causing them only to target each other for the next 24 hours, including votes. If not in an alliance, break their arms preventing item use and passing for 24h, and prevent them from joining an alliance for 24h.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Iron Will": {
            "role": "Nephilim",
            "rarity": "Epic",
            "exclusive": true,
            "removed": false,
            "effect": "Defensive only: If killed or eliminated within the next 24 hours, survive it, gaining immunity to all negative statuses for the next 3 days.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Body Examine": {
            "role": "Pathologist",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "Find the role of a player who has died.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Act Out": {
            "role": "Pathologist",
            "rarity": "Legendary",
            "exclusive": false,
            "removed": false,
            "effect": "Choose a perk and an ability to gain from somebody who is dead. Max 2 times per person. If not path: Max 1 perk at a time, unable to gain multiple. Can choose to not get a perk when using it.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Disrespectful Peek": {
            "role": "Pathologist",
            "rarity": "Common",
            "exclusive": false,
            "removed": false,
            "effect": "Check what items a dead player has.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Confiscate": {
            "role": "Pathologist",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "Take all the items from a player who has died for yourself.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Safeguard": {
            "role": "Sidekick",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "Protect somebody from the next Elimination. Cannot be yourself. Whoever you protect won't be notified. Can be cancelled, giving you the charge back.",
            "upgrades": [
                "Protect somebody from the next Elimination. Whoever you protect won't be notified. Can be cancelled, giving you the charge back."
            ],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Surveillance": {
            "role": "Sidekick",
            "rarity": "Rare",
            "exclusive": false,
            "removed": false,
            "effect": "Blocks outside visits to your alliance for 24 hours. Your alliance is informed, can be used solo.",
            "upgrades": [
                "Blocks outside negative visits to your alliance for 24 hours. Your alliance is informed.",
                "Blocks outside visits to your alliance for 48 hours. Your alliance is informed.",
                "Blocks visits to you except from your alliance for 24 hours."
            ],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Steel Guard": {
            "role": "Sidekick",
            "rarity": "Epic",
            "exclusive": false,
            "removed": false,
            "effect": "Protect your alliance from the next Elimination. Can be used solo. Your alliance is informed, can be used solo.",
            "upgrades": [
                "Protect yourself from the next Elimination."
            ],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Silver Finger": {
            "role": "Sidekick",
            "rarity": "Rare",
            "exclusive": false,
            "removed": false,
            "effect": "Your vote counts as 2 for the next Elimination and 2 votes will be nullified against you.",
            "upgrades": [
                "Your vote counts as 3 for the next Elimination and 2 votes will be nullified against you.",
                "Your vote counts as 2 for the next Elimination and 3 votes will be nullified against you."
            ],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Charm": {
            "role": "Succubus",
            "rarity": "Epic",
            "exclusive": true,
            "removed": false,
            "effect": " Pick someone to charm, they can no longer vote you however they know who you are and your vote doubles if a charmed votes the same player as you, charmed players will also get x2 vote power when voting with you. 48 hour cooldown.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Gag": {
            "role": "Succubus",
            "rarity": "Common",
            "exclusive": false,
            "removed": false,
            "effect": "Gag a player, giving them blackmailed. Refer to perks if charmed player.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Contract Break": {
            "role": "Succubus",
            "rarity": "Not an Any Ability",
            "exclusive": true,
            "removed": false,
            "effect": "Pick a charmed person to free from charm and gain a charge for Gag. 48 hour cooldown.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Override": {
            "role": "Tinkerer",
            "rarity": "Epic",
            "exclusive": true,
            "removed": true,
            "effect": "Use an AA without using up a charge. Using this on an AA more than once will delete the AA from your inventory afterwards. Cannot be used on empower nor hyperdrive when empowered.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Matter Reconstruction": {
            "role": "Tinkerer",
            "rarity": "",
            "exclusive": true,
            "removed": true,
            "effect": "Transform an item into a random equally rare AA. If Unique, gain a random AA of Uncommon+. Ultimate and Mythical items become a Legendary AA.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Upsurge": {
            "role": "Apex Predator",
            "rarity": "Epic",
            "exclusive": true,
            "removed": true,
            "effect": "Merge 2 AA's of the same rarity into one of choice from the rarity above. Will have a charge if both used AA's had one.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Down-surge": {
            "role": "Tinkerer",
            "rarity": "Uncommon",
            "exclusive": true,
            "removed": true,
            "effect": "Break down an AA into 2 of choice from the rarity below. Both will have a charge if broken down one did. If not, only one of them will.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Assimilate": {
            "role": "Tinkerer",
            "rarity": "Epic",
            "exclusive": true,
            "removed": true,
            "effect": "Select someone, taking AA's of choice from them. You may not use these AA's outside of using them to build in your other abilities.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Bond": {
            "role": "Villager",
            "rarity": "Common",
            "exclusive": false,
            "removed": false,
            "effect": "Bond with a player of choice, giving them +30% coin bonus. Cannot be used on the same person again within 12 hours. Can stack.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Apex": {
            "role": "Apex Predator",
            "rarity": "Not an Any Ability",
            "exclusive": true,
            "removed": true,
            "effect": "Gain one AA of each rarity of your choice. These AAs will have no charges, and the epic and legendary AAs cannot be energized or empowered, nor can the AAs created with these.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Downsurge": {
            "role": "Apex Predator",
            "rarity": "Epic",
            "exclusive": true,
            "removed": true,
            "effect": "Break down an AA into 2 of choice from the rarity below. Both will have a charge if broken down one did. Else, one of them will.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Power Grasp": {
            "role": "Apex Predator",
            "rarity": "Not an Any Ability",
            "exclusive": true,
            "removed": true,
            "effect": "Copy a perk from one of the AAs in your inventory. The perk lasts for 24hrs and you cannot copy the same role twice.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Opening Speech": {
            "role": "Vizier",
            "rarity": "Rare",
            "exclusive": true,
            "removed": true,
            "effect": "If Vizier, +1 charge per day. Make a public statement, and state if you think its true or false. Decide if you believe players will vote on it majority being true, or false. If correct: If false, you may make it true. If True, you may make it false. If the statement was opposite to your original belief, then nothing occurs.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Subliminal Messaging": {
            "role": "Vizier",
            "rarity": "Epic",
            "exclusive": true,
            "removed": true,
            "effect": "Make a public statement, and select true or false. Decide if you believe players will vote on it majority being true, or false. After votes are in, you will learn if it was true or false. If correct on majority vote: If false, you may make it true. If True, you may make it false. If your guess was also correct, you gain 1VP for an elim. You may decide when this VP is used.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Maddening Whisper": {
            "role": "Vizier",
            "rarity": "Rare",
            "exclusive": true,
            "removed": true,
            "effect": "Select someone and tell them a statement, and true or false. Give a timeframe of 24-72h. They must try to make people believe or disbelieve the statement. Throne of Lies logic applies to them and this statement. If successful within the time given, something positive will occur for them, if they fail, something negative will occur for them. The harsher the statement the bigger the reward, the opposite, the bigger the negative.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Serene State": {
            "role": "Wanderer",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "When activated, evade the next visit on you, you know what it was, and who did it. Can be cancelled and regained",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Forceful Resignation": {
            "role": "Wanderer",
            "rarity": "Rare",
            "exclusive": false,
            "removed": false,
            "effect": "Select someone, if in alliance, they are removed from the alliance and cannot re-join an alliance for 24 hours. If not in alliance, they become paralysed and blackmailed.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Off The Beaten Path": {
            "role": "Wanderer",
            "rarity": "Common",
            "exclusive": false,
            "removed": false,
            "effect": "Select someone, you swap coin bonuses for next coin phase. You also swap luck if yours is lower. Luck is swapped until luck influencing event occurs.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Purge": {
            "role": "Anarchist",
            "rarity": "Rare",
            "exclusive": true,
            "removed": false,
            "effect": "Choose someone and they will have their vote blocked. If their vote power is personally buffed due to a perk or ability, their vote power will only be decreased by 1. They will be alerted that their vote was blocked by the Anarchist. If Anarchist, gain a charge of this after every elimination phase.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Imperium": {
            "role": "Anarchist",
            "rarity": "Rare",
            "exclusive": false,
            "removed": false,
            "effect": "Select someone, they may cast three votes for the upcoming Elimination. Must all be for different people.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Isolate": {
            "role": "Anarchist",
            "rarity": "Rare",
            "exclusive": false,
            "removed": false,
            "effect": "Isolate someone for until the upcoming Elimination, making them unable to do anything (including vote) but also not able to be visited or voted.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Sunder": {
            "role": "Anarchist",
            "rarity": "Epic",
            "exclusive": false,
            "removed": false,
            "effect": " Split the players into 2 equal groups of your choice. Everyone can only visit, vote and talk to people in that group until the next Elimination. Both groups will vote someone out. If used 12h before elim, occurs immediately, else, occurs at eliminaiton. Empowering this breaks empower, cannot be energized. If anarchist: Can be energized once.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Douse": {
            "role": "Arsonist",
            "rarity": "Uncommon",
            "exclusive": true,
            "removed": false,
            "effect": "Every 24 hours, you may douse someone, not notifying the person you douse. Using this on a doused will remove the douse, but give you +1 luck.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Incineration": {
            "role": "Arsonist",
            "rarity": "Epic",
            "exclusive": true,
            "removed": false,
            "effect": "Upon use, burn all doused players, destroying all of their items, and giving them burned.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Ignite": {
            "role": "Arsonist",
            "rarity": "Rare",
            "exclusive": true,
            "removed": false,
            "effect": "Select a doused player, burning them and destroying their highest tier item, and remove doused on them. Alternatively, give burned to all doused.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Chemical Burning": {
            "role": "Arsonist",
            "rarity": "Epic",
            "exclusive": true,
            "removed": false,
            "effect": "Select someone, giving a special burned, which burns ability charges instead of items. Can be cured using 2 lots of burn removal items/abilities. Can only select doused targets, removes doused on them.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "On the House": {
            "role": "Bartender",
            "rarity": "Common",
            "exclusive": false,
            "removed": false,
            "effect": "Pick someone giving them Drunk. If Bartender - Gain a charge every 24 hours. This timer pauses if you have 2+ charges.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Intoxication": {
            "role": "Bartender",
            "rarity": "Rare",
            "exclusive": true,
            "removed": false,
            "effect": "Upon activation, select a person, them and all people currently with Drunk will gain an extra stack of Drunk as well as Blackmailed, Disabled and Paralysed for 24hrs.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Clink": {
            "role": "Bartender",
            "rarity": "Epic",
            "exclusive": false,
            "removed": false,
            "effect": "Select a person, their entire inventory will become Iron Balls.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Moonshine": {
            "role": "Bartender",
            "rarity": "Rare",
            "exclusive": false,
            "removed": false,
            "effect": "Select a person, remove any other status effects aside from Cursed that they currently have and they will become 100% Drunk for 24 hours",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Private Show": {
            "role": "Consort",
            "rarity": "Not an Any Ability",
            "exclusive": true,
            "removed": false,
            "effect": "Select someone - Any actions they attempt to do for the next 12 hours will fail, they will not be informed unless its a feedback action.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Public Display": {
            "role": "Consort",
            "rarity": "Not an Any Ability",
            "exclusive": true,
            "removed": false,
            "effect": "Select someone - Any actions themselves or their alliance attempt to do for the next 24 hours will fail, they will not be informed unless its a feedback action.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Revealing Attraction": {
            "role": "Consort",
            "rarity": "Not an Any Ability",
            "exclusive": true,
            "removed": false,
            "effect": "Select someone - If they use any positive actions or send items / money for the next 24 hours, you receive it instead. This does not include self-use positives.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Mark of the Fallen": {
            "role": "Cultist",
            "rarity": "Not an Any Ability",
            "exclusive": true,
            "removed": false,
            "effect": "The targeted player becomes marked. Any action marked people do to someone else passes along the mark. This is not known to the target. It can be spread indefinitely. (You cannot pick yourself)",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Forbidden Knowledge": {
            "role": "Cultist",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "See all actions performed on alliance members from last elim and till upcoming elim. Only reveals the type of actions performed and who did it.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Sacrifice": {
            "role": "Cultist",
            "rarity": "Not an Any Ability",
            "exclusive": true,
            "removed": false,
            "effect": "You can only target Marked people with this. Whoever is chosen by you will be marked for death, they have 48 hrs to pass it onto someone else by visiting them. People will be notified when they are marked for death. The timer increases by 6 hours every time the Mark of Death is passed on. (You cannot pick yourself)",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Soul Seeking": {
            "role": "Doll",
            "rarity": "Common",
            "exclusive": true,
            "removed": false,
            "effect": "Check someone - finding out their luck, coins and statuses. Starts with 2 charges. Gains a charge each time you get a status and every 24 hours.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Soul Swap": {
            "role": "Doll",
            "rarity": "Rare",
            "exclusive": false,
            "removed": false,
            "effect": "Swap statuses between 2 players of choice.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Coin Flip": {
            "role": "Doll",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "Select 2 people, swapping coin bonuses for 48 hours.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Luck Transfer": {
            "role": "Doll",
            "rarity": "Rare",
            "exclusive": false,
            "removed": false,
            "effect": "Permanently swap 2 people's luck. If you use it on yourself, you will only swap if yours is lower.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Survival Swap": {
            "role": "Doll",
            "rarity": "Epic",
            "exclusive": false,
            "removed": false,
            "effect": "You swap immunities between 2 players permanently.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Body Swap": {
            "role": "Doll",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "Select 2 people, visits on 1 go to the other, and vise versa, for 48 hours. Self-visit only actions do not.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Blackened Chains": {
            "role": "Forsaken Angel",
            "rarity": "Rare",
            "exclusive": false,
            "removed": false,
            "effect": "Select someone, the next negative that happens to you, happens to them 2 fold. Can be cancelled and regained.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Erasure": {
            "role": "Forsaken Angel",
            "rarity": "Epic",
            "exclusive": false,
            "removed": false,
            "effect": "Select someone, and remove a positive perk of choice from them if they have visited you or an ally within the last 48 hours. They gain it back upon your death. Cannot be used on the same person more than once per game. Empowering this cancels your empower.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Broken Blade": {
            "role": "Forsaken Angel",
            "rarity": "Epic",
            "exclusive": false,
            "removed": false,
            "effect": "Select someone, destroy all positive effects on them, and destroy any positive items within their inventory.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Wing Tear": {
            "role": "Forsaken Angel",
            "rarity": "Not an Any Ability",
            "exclusive": true,
            "removed": false,
            "effect": "Gain a charge after surviving a majority vote or attack. Select someone, upon dying, drag them to death with you. You can use your abilities, coins & items when dead, along with their abilities, coins and items too. In addition, you act as if permanently preserved. Suicides do not give charges. This cannot gain charges out of its main condition, other than empower - which breaks on use.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Restrain": {
            "role": "Gatekeeper",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "Restrain someone, giving them Restrained. Removes any other status effect they have apart from Cursed. Will be removed on your death. If Gatekeeper - You will know your prisoners role.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Force Ability": {
            "role": "Gatekeeper",
            "rarity": "Uncommon",
            "exclusive": true,
            "removed": false,
            "effect": "Force your prisoner to use any of their abilities on any player.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Release": {
            "role": "Gatekeeper",
            "rarity": "Not an Any Ability",
            "exclusive": true,
            "removed": false,
            "effect": "Select someone, removing Restrained from them.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "False Result": {
            "role": "Hacker",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "Choose three targets, for the next elimination, if your first target votes your second target, they instead vote your third target.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Troll": {
            "role": "Hacker",
            "rarity": "Epic",
            "exclusive": false,
            "removed": false,
            "effect": "For the upcoming elimination, you become immune to votes but votes on any of your allies are now doubled. Your allies cannot leave the alliance until after the elimination. Must be used 6h before elim for full effect, else only immunity applies.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Silence": {
            "role": "Hacker",
            "rarity": "Common",
            "exclusive": false,
            "removed": false,
            "effect": "Give a player Blackmailed.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Disable": {
            "role": "Hacker",
            "rarity": "Common",
            "exclusive": false,
            "removed": false,
            "effect": "Give someone Disabled. Removes any other status effects apart from Cursed. This effect is removed from anyone who has it when you die.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Ruthless Murder": {
            "role": "Highwayman",
            "rarity": "Not an Any Ability",
            "exclusive": true,
            "removed": false,
            "effect": "Reveal your role and shoot someone of your choice. If you kill someone opposite your alignment, become immune to something of choice. This takes a charge from Armed Friend.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Hold-Up": {
            "role": "Highwayman",
            "rarity": "Epic",
            "exclusive": false,
            "removed": false,
            "effect": "Threaten to kill someone, they can either accept death, give you all their money or all of their items. The target cannot act until decision is made. Cannot select the same target within 12h.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Armed Friend": {
            "role": "Highwayman",
            "rarity": "Not an Any Ability",
            "exclusive": true,
            "removed": false,
            "effect": "You give somebody Ruthless Murder. This takes a charge from Ruthless Murder. Anyone they kill, you get the coins from.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Bloody Escape": {
            "role": "Highwayman",
            "rarity": "Rare",
            "exclusive": false,
            "removed": false,
            "effect": "Choose a person to hide behind permanently. If you're attacked, they will attack your target instead. The person you hide behind will appear as Highwayman if investigated.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Mask": {
            "role": "Hunter",
            "rarity": "Rare",
            "exclusive": false,
            "removed": false,
            "effect": "Select someone, giving them a mask which makes all information about them hidden.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Hunt": {
            "role": "Hunter",
            "rarity": "Not an Any Ability",
            "exclusive": true,
            "removed": false,
            "effect": "Guess someone's role. If nobody alive has investigated them and found their exact role, their role is revealed to everyone and you kill them. If you guess wrong/their role was found, you become Blackmailed.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Scent Marker": {
            "role": "Hunter",
            "rarity": "Rare",
            "exclusive": true,
            "removed": false,
            "effect": "Mark someone with a special scent, when they die, you gain a Stack for Thrill of the Hunt and gain another charge for Scent Marker.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Mischief": {
            "role": "Imp",
            "rarity": "Rare",
            "exclusive": true,
            "removed": false,
            "effect": "Reverse someone's coin percentage for 48 hours. The target is not informed until coin phase. If you are Imp, gain a charge for every 2 times you use Luck Up.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": "Coin percentage includes the 100% every player starts with."
        },
        "Luck Up": {
            "role": "Imp",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "Select someone giving them lucky, if they have lucky, give them unlucky and restrained. If you are Imp, gain a charge of this every time someone you have visited before dies.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Gathering Trick": {
            "role": "Imp",
            "rarity": "Epic",
            "exclusive": false,
            "removed": false,
            "effect": "Select someone, steal all coin percentages and positive statuses from them and their alliance members for next coin phase. You get half the coin percentage % stolen.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": "Coin percentage includes the 100% every player starts with."
        },
        "Impish Grin": {
            "role": "Imp",
            "rarity": "Rare",
            "exclusive": true,
            "removed": false,
            "effect": "Select someone, doubling their current coin bonus until next coin phase. Cannot self select.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Jokester": {
            "role": "Jester",
            "rarity": "Common",
            "exclusive": false,
            "removed": false,
            "effect": "Give someone Despaired, removing all other status effects other than cursed. Lasts until you die.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Depressing Ballad": {
            "role": "Jester",
            "rarity": "Rare",
            "exclusive": false,
            "removed": false,
            "effect": "Select a target, everyone within their alliance will be inflicted with Paralyzed and Despaired.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Entire Circus": {
            "role": "Jester",
            "rarity": "Epic",
            "exclusive": false,
            "removed": false,
            "effect": "Everyone who has visited you or a current ally during the game will have their vote count as 0 if it's placed on you, and you will give them Blackmailed upon the elimination phase ending.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Peek of the Grave": {
            "role": "Juggernaut",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "Find the exact role of a player who is dead. If Juggernaut - Gain an extra use for Peek of the Living when used.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Peek of the Living": {
            "role": "Juggernaut",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "Find the exact role of a player. If Juggernaut -  When the player you investigated dies, you gain an extra use for Peek of the Grave.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Resilient Aura": {
            "role": "Juggernaut",
            "rarity": "Legendary",
            "exclusive": false,
            "removed": false,
            "effect": "If you are voted to be eliminated next elimination, a player of your choice instead will be eliminated. You stay anonymous during this. If successful, you become immune to the next Elimination too.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Demon Hunt": {
            "role": "Overlord",
            "rarity": "Common",
            "exclusive": false,
            "removed": false,
            "effect": "Find out if a player is evil or not.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Reanimate": {
            "role": "Overlord",
            "rarity": "Legendary",
            "exclusive": false,
            "removed": false,
            "effect": "Reanimate a dead player and be able to use any abilities they didn't use. If not OL - Bodies will decay over time, refer to ECO or Additional Info.",
            "upgrades": [],
            "degrades": [],
            "targeting": "Single (Dead)",
            "actionTypes": [],
            "additionalInfo": "When not used by Overlord, the reanimation by default lasts 72 hours, starting from when reanimated or 24 hours after the player died, whichever is longer.\nNegatives:\nBurned - Removes 6h upon infliction and every trigger.\nParalyzed - Removes 6h upon infliction and 12h when triggered.\nEmpowered - Removes 4h every time an empowered charge is used.\nUnlucky - 50% of losing 12h on day start.\nPositives:\nFrozen - Pauses timer and prevents it from being decreased.\nDrunk - Adds 6h per stack.\nLucky - 50% of gaining 12h on day start.\nAbilities:\nRevival Abilities - Additionally give 24h.\nOther Postive Abilites - Additionally give 6h, except Empower.\nNegative Abilities - Additionally remove 6h.\nPositives and Negatives can't change the timer more than three times in 6h."
        },
        "Discover": {
            "role": "Overlord",
            "rarity": "Rare",
            "exclusive": false,
            "removed": false,
            "effect": "Find the exact role of a player ignoring everything.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Abyssal Curse": {
            "role": "Phantom",
            "rarity": "Epic",
            "exclusive": true,
            "removed": false,
            "effect": "Select someone, gain a use of this every day. The person will suffer the longer the curse is on them. Refer to perks.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Shadowed Hands": {
            "role": "Phantom",
            "rarity": "Rare",
            "exclusive": true,
            "removed": false,
            "effect": "Speed up all Abyssal effected by a day. Gain a charge if someone dies once past/at 6 days.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Abyssal Blessings": {
            "role": "Phantom",
            "rarity": "Common",
            "exclusive": false,
            "removed": false,
            "effect": "Give someone of choice Lucky. If non-AA use, only works on abyssal cursed players, alongside freeing them from the curse.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Shadowed Guard": {
            "role": "Phantom",
            "rarity": "Rare",
            "exclusive": true,
            "removed": false,
            "effect": "Upon use, if attacked (not suicide) within the next 24h, survive it, and your most recent Abyssal curse target is attacked at the end of this time, as if they were the original target of the attacker. Gain a charge each time an Abyssal Curse target dies to non-elim. ",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Gaslighted Discussion": {
            "role": "Psychotherapist",
            "rarity": "Rare",
            "exclusive": false,
            "removed": false,
            "effect": "Select someone, inflicting despair and disable, but also giving elimination immunity. Next elimination they will have x2 votes against them. Does not inform target they are immune or the x2 votes.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Silver-Tongue": {
            "role": "Psychotherapist",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "Select someone, inflicting despair and disable.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Ignorance Bubble": {
            "role": "Psychotherapist",
            "rarity": "Rare",
            "exclusive": false,
            "removed": false,
            "effect": "Your alliance blocks votes from outside of the alliance. Everyone in your alliance other than you has votes on them worth x5. Cannot be used alone.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Double Edged": {
            "role": "Slaughterer",
            "rarity": "Not an Any Ability",
            "exclusive": true,
            "removed": false,
            "effect": "Select 2 people, both will be forced into a public duel, much like that of an excal duel. The first 2 rounds cannot get external help effects. You claim the coins, items and AAs of whoever dies, potentially both. If Slaughterer - if you enter the duel yourself, your opponent will have external help do nothing for them.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Skinning": {
            "role": "Slaughterer",
            "rarity": "Rare",
            "exclusive": true,
            "removed": false,
            "effect": "Select someone, stripping them of all their AA's, you gain a random one.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Bone Breaker": {
            "role": "Slaughterer",
            "rarity": "Rare",
            "exclusive": false,
            "removed": false,
            "effect": "Smash someone up, giving unlucky, burning, paralysing, disable, frozen, despairing and restraining them. The permanent effects are removed when you die.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Corpse Shield": {
            "role": "Slaughterer",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "Pick someone, once they die, they will take any hits from lethal actions for you for 1 hit. Upon target hit, regain a charge if you are Slaughterer.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Steal": {
            "role": "Threatener",
            "rarity": "Rare",
            "exclusive": false,
            "removed": false,
            "effect": "If player you chose has any items, you will take them all.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Shutdown": {
            "role": "Threatener",
            "rarity": "Epic",
            "exclusive": false,
            "removed": false,
            "effect": "Target a player, blackmail them and prevent their alliance from voting at the next elimination.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Redirect": {
            "role": "Threatener",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": false,
            "effect": "Redirect a player to visit a player of your choice next time they visit somebody. They will not be informed.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Survivalists Threaten": {
            "role": "Threatener",
            "rarity": "Epic",
            "exclusive": false,
            "removed": false,
            "effect": "Prevent two players from voting two players of your choice for the next elimination. Can prevent players from voting yourself.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Soul Binding": {
            "role": "Witchdoctor",
            "rarity": "Legendary",
            "exclusive": false,
            "removed": false,
            "effect": "Choose 2 players. Those players are now connected, and if one of them dies the other does too. All status ailments/effects and buffs are shared as well. Link is broken when you die. If put within 6h of elim, that elim will not kill a linked player.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Voodoo Doll": {
            "role": "Witchdoctor",
            "rarity": "Legendary",
            "exclusive": false,
            "removed": false,
            "effect": "Make a Voodoo Doll of someone, anything that happens to you will also happen to them, aside from receiving votes and being eliminated. This Voodoo Doll becomes an item in your inventory and whoever holds the item has this power.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Hex": {
            "role": "Witchdoctor",
            "rarity": "Epic",
            "exclusive": false,
            "removed": false,
            "effect": "Whoever is affected by the Hex, can use their next item twice. You cannot loop this ability via empower giving items.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Half-Swording": {
            "role": "Executioner",
            "rarity": "Not an Any Ability",
            "exclusive": true,
            "removed": true,
            "effect": "Select someone, if they attempt to harm you, you will render them unable to act for 12 hours.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Hand Off": {
            "role": "Executioner",
            "rarity": "Not an Any Ability",
            "exclusive": true,
            "removed": true,
            "effect": "You may decide to give whoever is most in the lead in your chosen requirement for end elimination, the ability to pick who dies instead of yourself. They can also choose to kill you instead, bypassing your elim immunity.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "The Deal": {
            "role": "Merchant",
            "rarity": "Not an Any Ability",
            "exclusive": true,
            "removed": true,
            "effect": "Players may start trades with you for your items. You may trade what you deem to be of equal value.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Swindle": {
            "role": "Merchant",
            "rarity": "Not an Any Ability",
            "exclusive": true,
            "removed": true,
            "effect": "Upon use, the next deal received, you may totally rip the person off.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Soul for a Soul": {
            "role": "The Reaper of Souls",
            "rarity": "Not an Any Ability",
            "exclusive": true,
            "removed": true,
            "effect": "Select a living and dead player, if the living player has voted you ever, and the dead has never voted you, the living dies and the dead revives.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Soul Stasis": {
            "role": "The Reaper of Souls",
            "rarity": "Not an Any Ability",
            "exclusive": true,
            "removed": true,
            "effect": "Select a player, they now register as dead and alive for votes and action against / by them. This ends after the Traveller leaves.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Danse Macabre": {
            "role": "The Reaper of Souls",
            "rarity": "Not an Any Ability",
            "exclusive": true,
            "removed": true,
            "effect": "For one elimination phase, all players, living and dead, can vote on all voting pools. If there was not an undead revival pool active when this was used, it becomes active.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Rolling": {
            "role": "Ball",
            "rarity": "Not an Any Ability",
            "exclusive": true,
            "removed": true,
            "effect": "Send a notification to the game that a ball is rolling. Gain immunity to a status of choice, and +1 vote power at the next elimination. 12 hour cooldown.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Bouncing": {
            "role": "Ball",
            "rarity": "Not an Any Ability",
            "exclusive": true,
            "removed": true,
            "effect": "It will be publically announced that you are the ball, however 12 hours from using this ability, you gain permanent death immunity.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Speed Up": {
            "role": "Ball",
            "rarity": "Not an Any Ability",
            "exclusive": true,
            "removed": true,
            "effect": "Activates once you have used bouncing, +1 vote power permanently. 24 hour cool down.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        },
        "Check": {
            "role": "None",
            "rarity": "Uncommon",
            "exclusive": false,
            "removed": true,
            "effect": "Choose a player, learn if they are dead.",
            "upgrades": [],
            "degrades": [],
            "targeting": "",
            "actionTypes": [],
            "additionalInfo": ""
        }
    },
    "perks": {
        "Hawkeye": {
            "role": "Agent",
            "effect": "If someone steals from you, you will know who did it.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Organised": {
            "role": "Agent",
            "effect": "Your vote cannot be stolen, blocked or tampered with in any way, including Sunder.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Tracker": {
            "role": "Agent",
            "effect": "If anyone in your alliance does a positive action to someone outside of your alliance, you will know who gave who, but not what it was.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Face Reader": {
            "role": "Analyst",
            "effect": "If an ally gains information feedback from anything that they use, you will be told the information as well.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "That Much Smarter": {
            "role": "Analyst",
            "effect": "Information items can be upgraded freely by you, or, have 2 uses. Info aas can be upgraded by you as well.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "X-Ray Vision": {
            "role": "Analyst",
            "effect": "Any form of investigation done by you cannot be effected by perks or abilities, assuming the target is visitable.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Motor Gang": {
            "role": "Biker",
            "effect": "Your alignment is counted as the same as the majority of your alliance for the purpose of alliance benefits. As long as your alliance is 4+, your vote counts as 2. Every good within your alliance gains an additional +1 luck, as well as yourself.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Rider of the Storm": {
            "role": "Biker",
            "effect": "As long as you remain in an alliance with at least 1 other player, you gain immunity to paralysis, burn, frozen, and your ability usage can't be blocked.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Rev Up": {
            "role": "Biker",
            "effect": "All timed statuses and abilities happen in half the time for you, not including curse, burn, paralysis, or mass game effects.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Full-Throttle Slam": {
            "role": "Biker",
            "effect": "If an ally is attacked - regardless of if it kills them, ram the killer with your bike, inflicting blackmail and paralysis - you find out who they are and their role.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Spare Heads": {
            "role": "Cerberus",
            "effect": "Survive 2 attacks, burning the attacker in both of these instances.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Hades' Hound": {
            "role": "Cerberus",
            "effect": "Immune to Frozen and Burned.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Ash Formation": {
            "role": "Cerberus",
            "effect": "Any items you cause to be burnt away, you gain. This includes Lava Walls item destruction.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Clever": {
            "role": "Detective",
            "effect": "Immune to Blackmailed, Disabled and Despaired.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Self-Defence": {
            "role": "Detective",
            "effect": "You are protected from attacks. If someone attacks you, you will inflict them with blackmailed and you find out their name & role.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Fishing Buddies": {
            "role": "Fisherman",
            "effect": "For every 2 Allies of the same alignment you have, gain an extra item during item rains.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Barrels": {
            "role": "Fisherman",
            "effect": "You get an extra 4 inventory spaces.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Confidence": {
            "role": "Gunman",
            "effect": "Once you've killed someone not your alignment, you become immune to negative status effects.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Ignorant": {
            "role": "Gunman",
            "effect": "Cannot be redirected to another target when you attack somebody.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Justice's Gift": {
            "role": "Gunman",
            "effect": "If you kill someone in the opposite alignment, you will obtain an Unreliable Wish and any AAs, items and money they had.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Heroic Power": {
            "role": "Hero",
            "effect": "You get x1.25 higher Immunity Card chances and +3 Luck if everyone in your alliance is not the opposite alignment.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Legion": {
            "role": "Overlord",
            "effect": "You may have 1 additional person in your alliance, should you choose to allow it.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Guilded": {
            "role": "Hero",
            "effect": "Every immunity card you get, increase the immunity card chances by 2.5%. This is added after other chance effects. Hero can get bonuses in an alliance alone.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Regenerative": {
            "role": "Hydra",
            "effect": "If inflicted with a neg status, gain immunity to it after its gone. If attacked & survived, blocked, or redirected, develop immunity to that interaction - all immunities develop EOD.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Multi-Headed Stare-Down": {
            "role": "None",
            "effect": "If you perform multiple actions, you can have them all register as 1 visit, even to multiple people. Action will register as the most convenient type used.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Rejuvenative Aura": {
            "role": "Hydra",
            "effect": "Allies that lose a neg status will develop immunity to it. You may toggle this per ally.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Head Growing": {
            "role": "Hydra",
            "effect": "Each time you/ally gain an immunity, and/or a new day starts, gain a base ability charge [Max 5 per day from immunities]. VR costs 2 per charge, Head-Shield max 2 per day",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Justice": {
            "role": "Judge",
            "effect": "If both people eliminated during the Lawful trial are not your alignment then you gain a random Epic-Mythical tier item.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Dystopia": {
            "role": "Judge",
            "effect": "If both of the people eliminated are your alignment during the Lawful trial then your abilities and alignment AA's are disabled, and you get Despaired.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Golden Gavel": {
            "role": "Judge",
            "effect": "If you vote on the eliminated player, gain +1 luck. If successful in a row, gain +1 luck per streak eliminations.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Tradesman": {
            "role": "Manager",
            "effect": "Your luck goes up by 1 every time you receive an item from a player and down by 1 when you give an item.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Money Transfer": {
            "role": "Manager",
            "effect": "Allows you to transfer an amount of coins to anyone within your alliance. Anyone in the Manager's alliance can also transfer money to allies. Manager can turn this on or off.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Enhanced Learning": {
            "role": "Mecha",
            "effect": "Each time your base abilities are successfully used, gain 1 luck and 5% coins.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Lock On": {
            "role": "Mecha",
            "effect": "Redirections will work on you, but also inflict your original target and redirection users with the ability/item as well.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Loadout Change": {
            "role": "Mecha",
            "effect": "At any point, you may choose to add a charge to Entrapment or Smoke Grenade. You have 5 charges. This cannot be copied.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Service": {
            "role": "Medium",
            "effect": "If you save anyone with Preserve, they cannot vote you for the rest of the game.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Haunted Tombstone": {
            "role": "Medium",
            "effect": "Cut a player of your choices coins in half when you're eliminated, you choose who gets the coins. Corpses are not removed from alliance chat and still count for luck, coins and IC - they may talk in alliance chat if permitted by Medium. Medium can remove dead members from alliance.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Spiritual": {
            "role": "Medium",
            "effect": "You can open chats with the dead, allowing communication.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Powerful Immunity": {
            "role": "Nurse",
            "effect": "Immune to negative status effects.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Medical Bills": {
            "role": "Nurse",
            "effect": "You may charge your target an amount of coins when using any of your base abilities on somebody. If they refuse the bills, you will get your ability charge back.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Cleansing Aura": {
            "role": "Seraph",
            "effect": "Negative statuses on yourself and allies are degraded to not be as effective. Can be toggled on/off per ally.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Angelic": {
            "role": "Seraph",
            "effect": "Positives inflicted by you on others will reward you with 200 coins. Positives inflicted on you will reward the inflictor with 100 coins, provided its not you.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Golden Thread": {
            "role": "Seraph",
            "effect": "If you are killed from an attack, your death is delayed for 24 hours, multiple attacks will all strike at the 24h mark. Elimination does not count towards this, except Soul-Bound or Finale. These attacks are treated like a visit and effect at the 24h mark, but have no origin.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Hourglass of Life": {
            "role": "Terminal",
            "effect": "Every time an ally dies, or you're alone for an elimination, gain 1 regret.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Heartbeats": {
            "role": "Terminal",
            "effect": "Immune to all negative statuses, but every time you gain a regret, lose an immunity of choice.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Spiritual Remains": {
            "role": "Terminal",
            "effect": "While without regrets, your vote has +2 power. This perk does not stack with itself.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Shaking Hands": {
            "role": "Terminal",
            "effect": "While having less than 3 regrets, you cannot be redirected.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Shallow Breaths": {
            "role": "Terminal",
            "effect": "While with less than 4 regrets, if an ally or yourself is attacked, you can choose to kill the attacker, or stop them, paralysing and despairing them. Killing them will add a regret to yourself, but not killing them will remove a regret from yourself.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Level Headed": {
            "role": "Terminal",
            "effect": "While with less than 6 regrets, you will remove a negative status from yourself or an ally of choice every day.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Timelines": {
            "role": "Time Traveller",
            "effect": "You can choose with up to a 12 hour delay, when a status placed on you begins effecting you.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": "You only learn the type of status (including curse vs death curse), not what variant it is (Wizard freeze vs freeze, Ghost death curse vs death curse) before it effects you."
        },
        "Time Zoned": {
            "role": "Time Traveller",
            "effect": "If your ability is reflected back onto you, or fails, you can re-use it. This cannot be copied.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": "Includes AAs."
        },
        "Exposed": {
            "role": "Undercover",
            "effect": "If three currently living people have declared you as the Undercover, you cannot use Deduct or Investigate anymore. If someone incorrectly declares, find out who they are, and you may reduce their coin bonus to 0% and inflict a negative [not DC] status of choice, at any point once per incorrect guess.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Paranoia": {
            "role": "Undercover",
            "effect": "Cannot be redirected.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "White Clues": {
            "role": "Undercover",
            "effect": "Gain a charge for Investigate every time you deduce an opposite aligned person.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Magic Barrier": {
            "role": "Wizard",
            "effect": "Immune to Frozen, Paralysed, Burned and Cursed. Reflects onto the inflictor.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Winter Coat": {
            "role": "Yeti",
            "effect": "You reflect Frozen, and may choose to give allies immunity to Frozen. You may also choose to remove this immunity at any time even if they left the alliance.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Nomadic": {
            "role": "Yeti",
            "effect": "You can see who is currently Frozen at any time and will be told if anyone thaws, and who caused the Frozen removal.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Icicles": {
            "role": "Yeti",
            "effect": "When any players thaw out naturally, you may choose to re-freeze them for 24 hours.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Glacial Wall": {
            "role": "Yeti",
            "effect": "If anyone attempts to vote you while they are Frozen it will not count.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Snow Globes": {
            "role": "Yeti",
            "effect": "Every time you use 2 items, you gain an Ice Wand. If an item is overused for this perk, it may be disregarded by the Host.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Eternal Hunger": {
            "role": "Amalgamation",
            "effect": "Every time something is used on you, gain 5% coin bonus.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Manipulator": {
            "role": "Backstabber",
            "effect": "If you Decode someone and they have the Lucky status, they get the Unlucky status or vice versa. Same applies with Burned & Frozen. You can choose to turn this off.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Finger of Death": {
            "role": "Backstabber",
            "effect": "When you die, you may pick a target to have the first vote for someone count as 2 permanently. Once that target dies, you may choose another player.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Counting Stars": {
            "role": "Backstabber",
            "effect": "Every time one of your allies die, you gain a charge for Man's Blessing or Decode.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Bank Loans": {
            "role": "Banker",
            "effect": "When in an alliance, all members gain x1.2 more coins. Also allows you to transfer an amount of coins to anyone. Anyone in the Banker's alliance can also transfer money to each other. Banker will know who passes what amounts to who and Banker can turn this on or off.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Greedy": {
            "role": "Banker",
            "effect": "If in an alliance, you may take all coins that non-aligned allies get. If 50% of living player pay payday, you gain elimination immunity for next elimination, if 75% pay, also gain +2 vote power for upcoming elimination.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Shopkeeper": {
            "role": "Banker",
            "effect": "You will know when an item is bought, and what item it is.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Bards Charisma": {
            "role": "Bard",
            "effect": "If Bard, x2 luck and coins from all sources. If not, x1.5 coins instead of x2. Lucky does not effect coins. This perk cannot stack with itself.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Lullaby": {
            "role": "Bard",
            "effect": "If killed, your killer will be blackmailed for 36 hours. If eliminated, all voters will be given unlucky.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "On Deaf Ears": {
            "role": "Bard",
            "effect": "You may fake-use any base abilities of yours on people.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Bomber's Mask": {
            "role": "Bomber",
            "effect": "Allows you to track the locations of your bombs, including 6 Point Bombs when held.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Cautious Nature": {
            "role": "Bomber",
            "effect": "When going to use an ability or item on someone, you will know if an ability/effect/perk is active on or around them.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Resistant Vest": {
            "role": "Bomber",
            "effect": "Immune to any effects of a bomb and any fatal item effects.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Rulebreaker": {
            "role": "Cheater",
            "effect": "Negative item effects from the alignment you currently are will not affect you.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Wilful Ignorance": {
            "role": "Cheater",
            "effect": "Your actions cannot be blocked in any way.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Perfection": {
            "role": "Cyborg",
            "effect": "You're already perfect, you cant use Upgrade on yourself. Hyperdrive on yourself will give 1/2 charges when applying then to aas, and 1/3 to base abilities. Your self-hyper runs off a different timer than other hypers given to you.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Tinkering": {
            "role": "Cyborg",
            "effect": "You can upgrade any Common items you obtain once per item type, and any Uncommon items you obtain once.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Robotic Nature": {
            "role": "Cyborg",
            "effect": "You're immune to Paralysed, Frozen, Burned, Despaired, Blackmailed and Drunk.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Cybernetic Link": {
            "role": "Cyborg",
            "effect": "Upgrades done by you become Degrades when you are killed/eliminated. If an upgraded player no longer has charges in the upgraded ability / lost the perk - their inventory is capped at 2 and loses any immunities they currently have. While there's a living player that you've upgraded or hyperdrived, you can only die to eliminations.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Lead Actor": {
            "role": "Entertainer",
            "effect": "You gain 2 luck from Good&Evil, for every good & evil pair in an alliance, gain an additional 2 luck. When you leave an alliance, you may have any form of leave message come up. You can leave your own abilities.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Top-Hat Tip": {
            "role": "Entertainer",
            "effect": "You start the game lucky, you are immune to unlucky. You can see yours & all your allies luck upon request (12h cooldown).",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "False-Smile": {
            "role": "Entertainer",
            "effect": "If someone leaves your alliance, use a free charge of opening act on them for -10%, or, you can inflict unlucky, frozen or disabled within 12h, frozen & disabled will last 12h.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Forced Performance": {
            "role": "Entertainer",
            "effect": "If someone uses a negative action on you that tells you it was used, if you correctly say who did it, you may drag them into your alliance at any time",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Ghost's Blood": {
            "role": "Ghost",
            "effect": "Immune to Cursed.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Secret Spirit": {
            "role": "Ghost",
            "effect": "You can still use your items and abilities when you're eliminated. You still gain AA's and items from power drops/item rains. In addition, you act as if permanently preserved",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Confusion": {
            "role": "Ghost",
            "effect": "If you're investigated, the investigator will receive a random result instead.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Rage": {
            "role": "Goliath",
            "effect": "When you or an ally is negatively afflicted, gain another charge of Bloody Knuckles. You can only gain 1 charge per person who negatively inflicts you or your allies every 2 days.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "God's Fist": {
            "role": "Goliath",
            "effect": "Once Rage activates ten times gain a powerful upgrade for one use of Bloody Knuckles that strips all immunities including death immunity or protection, can't be blocked or redirected.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Crippling Strike": {
            "role": "Goliath",
            "effect": "When an ally is attacked, you will know who did it even through Shatter, and can choose to paralyze them. Status immunities you have chosen to remove with Bloody Knuckles prior to the attack will be removed permanently from the attacker.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Scrying": {
            "role": "Goliath",
            "effect": "When you use Dimensional Shatter you gain death immunity, nullify 50% of votes on you, and Crippling Strike also activates for both status infliction and attacks.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Sexual Findings": {
            "role": "Incubus",
            "effect": "Every time someone new uses something on you, gain 25 coins. Every time you use something new, gain 25 coins.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Kiss Of Death": {
            "role": "Incubus",
            "effect": "Each time an embraced dies, gain 300 coins.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Master": {
            "role": "Incubus",
            "effect": "You will be told if an embraced is voting you / going to vote you. embraced will not gain x2 votes against you, and instead will be halved in vote power. If majority of votes are going to be on you [based on if nothing was reducing vote power / redirecting votes] from embraced members mostly, you may choose to have a random one die via Soul Suck, bypassing everything, max once every 36 hours.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Utter Affection": {
            "role": "Incubus",
            "effect": "If you have 4 or more living embraced, if attacked, your latest embraced will take the hit. This also activates if 33% of living are embraced.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Hard-On": {
            "role": "Incubus",
            "effect": "If 3 embraced die, gain a charge of hair pulling, and become able to self-use gentle holdings.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Love-Hate Duet": {
            "role": "Incubus",
            "effect": "Evade the first negative from an embraced each day, you learn what it was and who did it.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Lick-Up": {
            "role": "Incubus",
            "effect": "If one of your embraced die from soul suck, you gain a random item, going up in rarity for base-level. eg, 1st kill is common+, second is uncommon+, etc.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Attachment": {
            "role": "Leech",
            "effect": "Select a player as your host, you may change target at each day's start. You will know what action types (positive/neutral/negative and ability/item) they perform.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Mood Altering": {
            "role": "Leech",
            "effect": "Your host cannot vote for you. If your host is voted at all, you also get 1 vote against you. For every 3rd vote, you also get voted once more.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Immunity System Breeching": {
            "role": "Leech",
            "effect": "You may see and copy 1 immunity from your host upon picking them",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": "Can copy fake immunities. Will not see role immunities from Succubus, Masochist, and Undercover."
        },
        "Pleasure": {
            "role": "Masochist",
            "effect": "Receive a stack of pleasure every time you get voted.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Masochism": {
            "role": "Masochist",
            "effect": "Gain 100 coins for every stack you receive.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Bliss": {
            "role": "Masochist",
            "effect": "When you're attacked, it fails and you give the attacker Blackmailed. Gives you 3 stacks. Activates at 10 stacks.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Euphoria": {
            "role": "Masochist",
            "effect": "Gives additional perks when at high amount of stacks.\n12 Stacks = You get an extra vote if you have a negative status effect.\n14 Stacks = All negative status effects don't work on you apart from Cursed.\n16 Stacks = You now get an extra vote for every negative status effect.\n18 Stacks = You now may swap 3 stacks in for immunity to the next Elimination. Deactivates when under 18 stacks again.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Pain Chaser": {
            "role": "Masochist",
            "effect": "If someone in your alliance has a negative status happen, you get it instead.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "One Track Mind": {
            "role": "Masochist",
            "effect": "Immune to Lucky.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Master Bound": {
            "role": "Masochist",
            "effect": "You cannot vote yourself or inflict yourself with negative status effects, unless reflected.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Blend In": {
            "role": "Mimic",
            "effect": "In a tie vote, only your opposition can be voted.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Personal Mimicry": {
            "role": "Mimic",
            "effect": "Upon a successful Reaction, you may copy a perk from the person. Max 2 at a time.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Shifting": {
            "role": "Mimic",
            "effect": "Your alignment will change to whatever your alliance's dominant faction is luck wise. If there's a 'tie' then you may pick between the alignments.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Stinging Serenity": {
            "role": "Nephilim",
            "effect": "You may change between offensive and defensive states, with a 18 hour delay between changes. You start off in a state of choice.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Stable enough": {
            "role": "Nephilim",
            "effect": "\nDefensive: Immune to 3 statuses of choice\nOffensive: Negative Status-inflicting items/AA last twice as long, or are twice as damaging depending on the status",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Bloodied": {
            "role": "Nephilim",
            "effect": "\nDefensive: Every time an ally dies, your coin bonus increases by 15%\nOffensive: Every time someone you have harmed dies, gain 10% of their coins",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Iron-body": {
            "role": "Nephilim",
            "effect": "\nDefensive: Attacks will rebound and kill an ally instead\nOffensive: You will block attacks against you and strike back 2 fold onto the attacker",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Dead Inside": {
            "role": "Pathologist",
            "effect": "Immune to any effects from somebody's perk or ability that can happen to you when they're dead.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": "This does not make you immune to effects on dead players if they were applied by an alive player (for instance, a corpse being Gas Bombed by an alive player would still hit you)."
        },
        "Corpse Raider": {
            "role": "Pathologist",
            "effect": "Every time someone is eliminated, gain 2.5% coin bonus. Every time someone is murdered, gain 5% coin bonus.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Security": {
            "role": "Sidekick",
            "effect": "Every time you successfully protect someone with Safeguard, gain a charge for Steel Guard.",
            "upgrades": [
                "Every time you successfully protect someone with Safeguard, gain a charge for a base ability of choice."
            ],
            "degrades": [],
            "additionalInfo": ""
        },
        "Sympathetic": {
            "role": "Sidekick",
            "effect": "Prevents anyone from voting anyone else in your alliance.",
            "upgrades": [
                "Prevents anyone from voting you in your alliance."
            ],
            "degrades": [],
            "additionalInfo": ""
        },
        "Sexual Encounter": {
            "role": "Succubus",
            "effect": "Every time someone new uses something on you, gain 50 coins.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Sadistic": {
            "role": "Succubus",
            "effect": "If one of your charmed targets is voted off or killed, you gain 300 coins along with a charge for Gag.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Chain Puller": {
            "role": "Succubus",
            "effect": "If your voted target ends up in a draw, you may force all your charmed targets to vote the person of your choice. If you are voted up in a draw, you can make all charmed targets vote the other person.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Soul Sucker": {
            "role": "Succubus",
            "effect": "If a person dies from having their Soul Sucked, gain 2 charges for Gag.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Muffled Moans": {
            "role": "Succubus",
            "effect": "Blackmailing a charmed causes them to become seduced - meaning if they try to hint to who you are or do anything non-positive to you, they die, ignoring everything. This does not blackmail them, it only changes charmed -> seduced.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Blinding Desire": {
            "role": "Succubus",
            "effect": "Seduced people cannot detect your actions when they involve seducing other people.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Dominatrix": {
            "role": "Succubus",
            "effect": "Cannot be seduced, immune to blackmail.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Power Handling": {
            "role": "Tinkerer",
            "effect": "You may pass AA's to other players.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Low-Power Hotwire": {
            "role": "Tinkerer",
            "effect": "You may use a Common AA for free every day, even if it has 0 charges.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Assimilation Copy": {
            "role": "Tinkerer",
            "effect": "If you use Assimilate on someone with immunities, copy them.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Eye of Power": {
            "role": "Tinkerer",
            "effect": "You can see what AA's your allies get in Power Drops and from AA based items.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Loveable": {
            "role": "Villager",
            "effect": "You can be in up to three alliances. Gain 2 luck for neutral allies and +5% coins per ally.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Jack of All Trades": {
            "role": "Villager",
            "effect": "Gain an additional Any Ability from events and items that usually give Any Abilities.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Constantly Evolving": {
            "role": "Apex Predator",
            "effect": "Every time you use an AA you may copy one status immunity from that role, if you don't instead earn 100 coins.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Remove Weakness": {
            "role": "Apex Predator",
            "effect": "At both item rains and power drops you may permanently remove an AA with a charge or spend a charge on your RC to gain an additional random AA.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Throne of Lies": {
            "role": "Vizier",
            "effect": "Lies you spread, and lies about you, if believed enough, will become true, you may decide to not get an effect from a lie when it occurs.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Crown of Thorns": {
            "role": "Vizier",
            "effect": "If your death is caused by a lie, you may act from the grave and revive easier, and, the person who said the lie that killed you, will have negative lies about them if believed, become true.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Blade of Truth": {
            "role": "Vizier",
            "effect": "If something you state that is truth, is thought to be a lie, you may decide on what negatives to inflict upon all who don't believe that fact, or, positive to give yourself/allies/social allies. The more damaging to yourself/allies/social allies the dis-believed truth is, the larger the negative/positive.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Lonesome": {
            "role": "Wanderer",
            "effect": "When not in an alliance, gain 35% coin boost and +3 luck.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Calming Silence": {
            "role": "Wanderer",
            "effect": "When not in an alliance, you gain +1 luck every 2 days. You have access to this luck only when alone.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Observant": {
            "role": "Wanderer",
            "effect": "Observant - When not in an alliance or in an alliance of 2 - You will know whats used on you.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Wolf": {
            "role": "Wanderer",
            "effect": "When not in alliance or in an alliance of 2, you are protected from attacks and will attack anyone who attacks you. If they are immune to attacks, you learn their role and destroy their inventory.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "One Step Ahead": {
            "role": "Anarchist",
            "effect": "Each day you may select up to two players (you cannot switch to different players after selection). You will know who these players are voting for until after the upcoming Elimination.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Ashes to Ashes": {
            "role": "Arsonist",
            "effect": "Your items cannot be burnt away/destroyed nor stolen. Anyone you douse is also 'framed' and shown as Arsonist / Evil.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Flamed": {
            "role": "Arsonist",
            "effect": "Reflect burn, and, every time someone tries to burn you, gain a charge of ignite, and douse them.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Gasoline Fumes": {
            "role": "Arsonist",
            "effect": "For every doused person, get +10% coins. For every 2 doused people, get +1 luck.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Hellish Landscape": {
            "role": "Arsonist",
            "effect": "If every living player is doused; remove all burn immunities people have and then inflict everyone with a 12h burn. You also gain a random Epic-Mythical item. You may now also douse corpses.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Heat Vision": {
            "role": "Arsonist",
            "effect": "You can see who is currently Burned. You also know who is currently doused.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Drinking Buddies": {
            "role": "Bartender",
            "effect": "Gain a Beer every time someone else in the game gets a Beer",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Alcoholic": {
            "role": "Bartender",
            "effect": "Anytime someone tries to inflict you with Drunk, it gets reflected back to them.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Staggering Suggestions": {
            "role": "Bartender",
            "effect": "You know who is drunk. People within your alliance can only be the target of positive drunk actions. You can select up to 25% of living players who are not within your alliance to never be the target of positives, and always the target of negatives.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": "You are informed how many people you can pick with the second part of this perk. The player count includes reanimated players and excludes buried alive players."
        },
        "Backstage Practise": {
            "role": "Consort",
            "effect": "Every time you're visited by someone new, gain a charge for Private Show.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Tips for Tips": {
            "role": "Consort",
            "effect": "Gain 50 coins for every action you stop",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Viruses": {
            "role": "Consort",
            "effect": "Spread negative status effects you have upon every successful action stopped. You can decide with up to an hour delay when it is inflicted. You can gain statuses you are immune to, and not be affected by them. Losing the immunity while having the status, will remove the status with it.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Redressing": {
            "role": "Consort",
            "effect": "If a negative status effect or negative action is used on you by someone you're using an original ability on, your ability cancels, you learn this. Their action on you is blocked, despite the cancelling.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Mob Mentality": {
            "role": "Cultist",
            "effect": "The number of marked players the Cultist has grants different bonuses\n\n2 Marked = Coin bonus 10%\n3 Marked = Alliance receives a private Item Rain\n4 Marked = Given a Cursed Relic (Epic item)\n5 Marked = Forbidden Knowledge now works on all marked people and reveals all the marked to the Cultist.\n6 Marked = Gain 50% coin Bonus, and a charge of Forbidden Knowledge\n7 Marked = You can cure a player of all Status effects once per elimination phase (Unlimited)\n8 Marked = You can give a player any negative status effect of choice (basic) once per elimination phase (Unlimited)\n9+ Marked = Gain an extra 5% coin bonus for every marked person from this point onwards.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Dark Company": {
            "role": "Cultist",
            "effect": "You are immune to Curse. If a player in the Cultist's alliance is marked then they get Curse Immunity as long as they're in this alliance/marked. You may toggle this on/off for yourself/alliance members individually.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Martyr": {
            "role": "Cultist",
            "effect": "If all players alive are marked then they all receive Cursed. You can see who cursed are voting, but not who is voting who.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Facade": {
            "role": "Doll",
            "effect": "You may fake your role, alignment, items, immunities, etc",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Breakable": {
            "role": "Doll",
            "effect": "Upon taking a lethal attack for the first time, you survive, lose 2 ability charges of choice and lose Facade.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Halo-less": {
            "role": "Forsaken Angel",
            "effect": "Positive effects on you can be turned into equally powerful negatives, and put on a person of choice.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Forsaken Already": {
            "role": "Forsaken Angel",
            "effect": "Curses on you act as heals while active. It will not kill you upon its end. Death curses will additionally act as elimination protection till hit/gone.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Spiteful": {
            "role": "Forsaken Angel",
            "effect": "Upon dying without successfully using Wing Tear - all negatives acquired throughout the game, will be put onto your killer[s] [spread out if voted].",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Armoured": {
            "role": "Gatekeeper",
            "effect": "Immune to Restrained, Paralysed and Frozen",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Preserved": {
            "role": "Gatekeeper",
            "effect": "Items cannot be stolen. It will notify anyone who tries to steal them that they had no items.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Spare Cuffs": {
            "role": "Gatekeeper",
            "effect": "If someone is inflicted with Restrained, you can use your abilities on them as if they are a prisoner.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Escapist": {
            "role": "Hacker",
            "effect": "Immune to Disabled and Blackmailed.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Suspicious": {
            "role": "Highwayman",
            "effect": "If someone in your alliance is investigated they will investigate you instead.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Daylight Robbery": {
            "role": "Highwayman",
            "effect": "If you are ever in the public vision (abilities, elim, events) and best someone, rob them of half their coins (You can toggle this). If you kill a player who has investigated or harmed you/an ally, take an ability from their RC. Armed Friend can trigger this perk for you.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": "For example: If you are placed in a Slaughterer duel, and you win the duel, you would take half of the Slaughterer's coins. If you survive elim, you will take half the coins of whoever died to elim. Cannot copy fake abilities (facade, confusion, etc). May attempt to blindly take an ability, will succeed if the target's actual role has said ability."
        },
        "Thrill of the Hunt": {
            "role": "Hunter",
            "effect": "Gain a Stack every time somebody dies with your Scent Marker.\n1 Stack = Gain +1 Luck.\n2 Stacks = Gain a charge for Mask.\n3 Stacks = Mask now cures status effects.\n4 Stacks = Your vote becomes 2.\n5 Stacks = You become immune to attacks.\n6 Stacks = First vote against you is null.\n7+ Stacks = Gain coins equal to 50 times your stack count.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Background Laughter": {
            "role": "Imp",
            "effect": "If someone puts a negative status on you or an ally, you'll know who did it, and when using Mischief on them, they'll gain the same status back.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Trickster": {
            "role": "Imp",
            "effect": "Upon being investigated in any way shape or form, you will know and can decide to 0 their coin bonuses for next coin phase. Mass invest effects do not activate this.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Money Dump": {
            "role": "Imp",
            "effect": "Any coins people lose due to your abilities, you gain.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Chaotic Nature": {
            "role": "Imp",
            "effect": "You are immune to Despaired and Paralysed",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Double Edged Smile": {
            "role": "Imp",
            "effect": "Upon death, pick someone. If you died via elimination and the selected had voted you, double all votes upon them from your original allies and their allies. If you died via an ability/item and the selected is who attacked you, strip them of all positive effects and inflict them with any of your remaining abilities of  choice - using up charges.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Last Laugh": {
            "role": "Jester",
            "effect": "Upon elimination, everyone who voted you will become Despaired. If you got the most votes but survived, they will all become Despaired for the next 24 hours, and remove despair immunity from anyone who had it, permanently - you learn the roles that lost immunity.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Party Trick": {
            "role": "Jester",
            "effect": "If you gain a negative status, you will share it with all visitors while its active on you. You can turn this off.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Loose Noose Lasso": {
            "role": "Jester",
            "effect": "If attacked, redirect it to a random despaired person, if this fails, your killer will become despaired and blackmailed. If immune to these, remove the immunity only.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Power Up": {
            "role": "Juggernaut",
            "effect": "When 85% players are left you get: Cursed immunity, +1 inventory space, +1 item per item rain, and 25% added coin bonus.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Power Up Mega": {
            "role": "Juggernaut",
            "effect": "When 60% players are left you get: Cursed, Frozen & Paralysed immunity, +2 inventory space, +2 items per item rain, 50% added coin bonus and your vote counts as 2. Disables Power Up if active.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Final Gambit": {
            "role": "Juggernaut",
            "effect": "When 30% players are left you get: Immunity to bad status effects, death immunity, +2 inventory space, +2 items per item rain, 50% added coin bonus and your vote counts as 3. Disables Power Up & Power Up Mega if active.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Evil Aura": {
            "role": "Overlord",
            "effect": "You get x1.5 higher Immunity Card chances and +2 Luck if everyone in your alliance is not opposite your alignment.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Seize": {
            "role": "Overlord",
            "effect": "You'll find out your alliance gets an Immunity Card before everyone else and may choose to take it without anyone knowing.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Abyssal Cursing": {
            "role": "Phantom",
            "effect": "The longer it goes on, the more they suffer:\nD0 and D1 statuses can have +-3h variance in when they occur, you choose.\n0 Days - Inflict a status of choice [excluding DC/Emp].\n1 Day - Inflicted with 2 statuses of choice [^] that they are not immune to, if immune to all, remove 2 immunities.\n[Cannot inflict blackmail twice in a row to the same target]\n2 Days - Their actions have a 10% chance to effect someone random.\n3 Days - They have a ability degraded of their choice. \n4 Days - They have a  perk degraded of their choice. 10% more chance to effect someone random.\n5 Days - All abilities, including AAs are degraded.\n6 Days - All perks are degraded. 10% more chance to effect someone random.\n7 Days - Completely wipe their coins and items. 20% more chance to effect someone random.\n8 Days - Their entire role and AAs are disabled. \n9 Days+ - Additional 10% per day to effect someone random.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Abyssal Bound": {
            "role": "Phantom",
            "effect": "Abyss curse victims cannot vote you from Day 2+.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Phantom's Grasp": {
            "role": "Phantom",
            "effect": "If you die, all abyssal curses will stop functioning, but will come back if you are revived.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Abyssal Shadow": {
            "role": "Phantom",
            "effect": "You may gain the investigation results of an abyssal cursed person of choice.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Strong Manipulator": {
            "role": "Psychotherapist",
            "effect": "You ignore alliance-wide negative abilities.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Abusive": {
            "role": "Psychotherapist",
            "effect": "If someone uses a negative item on you more than once, inflict paralysis and burn on them, along with finding out their identity.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Corruption": {
            "role": "Psychotherapist",
            "effect": "Each time you save someone with your abilities, gain +3 luck. Each time your abilities assist in killing someone, gain +30% coins.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Watchful Eye": {
            "role": "Psychotherapist",
            "effect": "The second time and onwards somebody votes for you; you will be told their identity after the elimination.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Freakish Nature": {
            "role": "Slaughterer",
            "effect": "Your non-aligned allies do not gain any luck in your alliance, you instead have theirs added to yours. This is added before your own lucky/unlucky but after their lucky/unlucky/perk calculations.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Blood Luster": {
            "role": "Slaughterer",
            "effect": "Killing items cannot kill you when you use them, and can be manipulated by you to a degree.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Body Count": {
            "role": "Slaughterer",
            "effect": "Each time you murder someone / are the main cause of someone dying, gain an immunity of choice immediately, including 1 time elim immunity which lasts till hit. Also gain a 30% coin bonus.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Dealer": {
            "role": "Threatener",
            "effect": "Allows you to transfer coins to somebody. Anyone in the Threatener's alliance can also transfer money to each other. The Threatener can choose who within the alliance can do this.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Broker": {
            "role": "Threatener",
            "effect": "Has +2 item count.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Insane": {
            "role": "Witchdoctor",
            "effect": "You cannot become Despaired, Drunk or Blackmailed.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Magic Mind": {
            "role": "Witchdoctor",
            "effect": "Your actions and votes cannot be controlled by anyone or anything.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Executioner's Blade": {
            "role": "Executioner",
            "effect": "While alive, every elimination is a double elimination, but the 2nd elimination will have candidates put up for you to pick from, based on terms you put up at day start. You do not need to kill someone.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Pen & Blade": {
            "role": "Executioner",
            "effect": "You may not vote, you learn who is voting you. You survive one elimination. You may publicly reveal who voted you upon your death.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Intimidating Aura": {
            "role": "Executioner",
            "effect": "You may join alliances, not taking up a slot. You increase immunity card chances by 1.25, but you decide who gets it, based on whom in the alliance is top of the previous requirement (top 50% of alliance).",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Bribery Benefits": {
            "role": "Merchant",
            "effect": "Your vote is worth 2, you may vote 3 times, but only with whoever gave you the most in:\nMoney (coin total)\nItems (based on value)\nAbilities (based on positiveness/rarity)\nPeople may hand you money and aas freely. Draws mean neither get it, and every new day the totals are reset.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Many Wares": {
            "role": "Merchant",
            "effect": "You have infinite inventory space. You gain 2 items every day and start with 6 items. Your luck is randomly between 5-15 every time it is rolled.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Cargo Cart": {
            "role": "Merchant",
            "effect": "You may join multiple alliances not taking a slot. Alliance members have -25% luck but gain 1-2 additional items in item rains, and -50% luck in power drops but gain an additional aa.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Banker's Jeaolusy": {
            "role": "Merchant",
            "effect": "While alive all shop items cost 10% more. You may make 2 items you have cost 25% more.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Relentless Spirits": {
            "role": "The Reaper of Souls",
            "effect": "While this Traveller is active, the dead may act on dead as if both players were alive, and statuses and effects work as if they're alive.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Fetch me their Souls": {
            "role": "The Reaper of Souls",
            "effect": "While this traveller is alive, every day the dead will have the opportunity to vote on one dead player to send to the Reaper (TD), and every second day they may vote on a dead player to revive alongside the first vote.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Undead Resilience": {
            "role": "The Reaper of Souls",
            "effect": "The first time you would die by elimination and by an attack, you will resist it.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Grim Resolve": {
            "role": "The Reaper of Souls",
            "effect": "You can only vote if voted, and you vote in all possible voting pools. Your vote power is 3. You will be told if you may vote.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Life & Death": {
            "role": "The Reaper of Souls",
            "effect": "Dead may form alliances. Alliances you join may have an additional 2 players, and may invite dead / living to them. Communications are allowed within the alliance. You may join 2 alliances.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Cold Benevolance": {
            "role": "The Reaper of Souls",
            "effect": "Infinite inventory, any items and aas this role gains from drops are instead given as rewards to the revived player from the revival voting pool. This role cannot use items or aas gained by drops, but can if they are handed to them.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Harbringer": {
            "role": "The Reaper of Souls",
            "effect": "This role is immortal until 5 players die. Perks also activate at 5 players dead.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Ethereal Presence": {
            "role": "The Reaper of Souls",
            "effect": "May talk in dead and living chat, ignoring any restrictions present - even after death.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Obviously a Ball": {
            "role": "Ball",
            "effect": "You cannot obtain investigation immunity in any way.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        },
        "Uncontrollable": {
            "role": "Ball",
            "effect": "Once you have used bouncing, your actions cannot be redirected or blocked in any way.",
            "upgrades": [],
            "degrades": [],
            "additionalInfo": ""
        }
    }
}